[{"body": "It looks like some sort of prison. Libraries should be colourful. Coz they're so boring. ", "score": 1},{"body": "&gt;Pepsi had a additive called pepsin was added.\n\nYou should probably bold this whole sentence.\n\nAlso not sure if they spell it that way where you're from, but it's typically spelled Antacid, not anti-acid.", "score": 1},{"body": "My mom is dead", "score": 4},{"body": "&gt;coke\n\nHow dare you ", "score": 1},{"body": "Wait, December 2015 is in 12 years time??? ", "score": -2},{"body": "If you use an auto-feeder, I thank you on behalf of IT guys everywhere. ", "score": 1},{"body": "Twice the power. Beware you friend stabbing you with spears.", "score": 1},{"body": "so K A W A I I", "score": 0},{"body": "My dog has a spot of grey on his forehead that fades away and gets hidden as his hair gets longer", "score": 1},{"body": "That's an Unown (Pokémon).\nThe one that represents the letter H, more specifically.", "score": 2},{"body": "Every DMV I've ever set foot in has been packed. I suspect you may live in a parallel universe. ", "score": 4},{"body": "That sounds like a no. Still, you use too much toilet paper. 3 squares per wipe is all you need.", "score": 1},{"body": "Why were you rooting through a bin?", "score": 1},{"body": "I posted this yesterday, you are probably going to get a lot of hate because it's supposed to be wrinkling just a heads up ", "score": 0},{"body": "Things like this, and the interior not rattling as you go down the highway... not feeling like it's made of the same material as a plastic toy out of a gum ball machine, etc.", "score": 3},{"body": "What do you expect from someone called /u/researchcausescancer?", "score": 0},{"body": "Was this caused by Fukushima?", "score": 1},{"body": "Stats for Nerds is how Google labels all their whatever that is. It's an option in Chrome too. ", "score": 1},{"body": "how do they photoshop that*", "score": 9},{"body": "The path of the righteous man is beset on all sides by indentations in the stairs.", "score": 1},{"body": "Tell everyone to use the pin option on their staplers instead so it's easier to take apart. ", "score": 1},{"body": "[a funky Japanese drink](http://imgur.com/icVnYEQ)", "score": 1},{"body": "Why is it usually so busy? What do you actually do there? I'm from England, you book a time slot, pass your test and get your licence mailed to you. Why so many queues in America?", "score": 2},{"body": "I hope your are not spooning butter into your mouth", "score": 1},{"body": "who shat in your cereal", "score": 1},{"body": "Send to /r/WTFgarageSale ", "score": 0},{"body": "Rule 4 man.\n\nEDIT- And Rule 1 and 3", "score": 3},{"body": "Did you take this photo? What does it taste like?", "score": 1},{"body": "Do you only eat the food from the country you live in? That sounds awful boring. ", "score": 2},{"body": "Thank you! It's nice to see someone else who's so familiar with them. My sister has a Redbone Coonhound who gets along great with Hudson. I didn't know that fact about the United Kennel Club. I always thought he was just American English lol. Hudson is a bit of a handful but he's lovable. If he's anything like your dogs, I commend you for taking on raising coonhounds. ", "score": 1},{"body": "Not really, the space is just in the wrong spot", "score": 3},{"body": "So you're saying you work at Walgreens?", "score": 1},{"body": "The s got moved from make", "score": 3},{"body": "i learned of this on npr.  japan's population is so large that they have shit tons of convenience stores, but that have to stand apart from ome another, so they are always sellimg crazy shit to be one ahead of the other guy.", "score": 1},{"body": "Getting new license plates/registration, transferring titles and what not. ", "score": 1},{"body": "Life will find a way.", "score": 1},{"body": "As old as you then.. ", "score": 2},{"body": "You are.", "score": 1},{"body": "I don't understand, it says Jonah Hill", "score": 2},{"body": "makes me proud to know that I actually went in before the person before the OP and pissed all over the floor", "score": 2},{"body": "The picture?", "score": 2},{"body": "I'm 11", "score": 2},{"body": "THIS is my personal hell.", "score": 3},{"body": "it's actually just polished in that spot from all the rubbing and oils from people's hands ", "score": 1},{"body": "Whao! Is this for real? They should bring that here to the states! :)", "score": 1},{"body": "At least I wasn't the only one to notice... wonder if OP noticed", "score": 1},{"body": "http://i3.kym-cdn.com/entries/icons/original/000/006/707/nothing-to-do-here-template.jpg.scaled500.jpg", "score": 2},{"body": "Yeah, unless i'm really missing something?", "score": 3},{"body": "This made me laugh much more than it probably should have.", "score": 1},{"body": "Fun fact: those freestyle machines were designed by folks at Maserati. If you look at the bottom of the facade of the machine, you'll see the pinafarina design label.\nSource: a talk given by the CEO of Coca-Cola at a conference. ", "score": 1},{"body": "Do you suck dick as well as you post bullshit", "score": 0},{"body": "Reminds me of this: http://youtu.be/FxyD2pB6mWA", "score": 1},{"body": "K bye. Have fun at prom", "score": 2},{"body": "[Look for Milkis at asian markets.](http://www.gtc.com.hk/en/foodshow.aspx?Id=434) They're pretty good.", "score": 1},{"body": "\"Soda Stream will do for soda what 3D printing did for the assault rifle.\"", "score": 1},{"body": "The machinery of the second grade is oiled with the blood of the cafeteria workers!", "score": 8},{"body": "I said This Is The End credited James Franco first in its credits. This is true. The picture was a screengrab from the moment.", "score": -1},{"body": "What's the surprising part?\n\nDid you assume as the weather got colder your usage would increase?\n\nPerhaps holiday travel has affected this?", "score": 2},{"body": "Seriously, fuck you.", "score": 0},{"body": "Those things look like pubes. Metal pubes.", "score": 2},{"body": "I've had that. It was quite good", "score": 1},{"body": "You can look up United Kennel Club and check out their website. They are an all breed registry but they made heir mark registering coonhounds and other hunting breeds. They have a message board and all sorts of other stuff on there as well. They are based in Kalamazoo, Michigan. I would be glad to help with any questions you might have too. I've been around the breed my whole life and wouldn't want any other coonhound. ", "score": 1},{"body": "Basically I started talking with a friend in Texas who has a 350gig limit each month. Considering I stream most of my entertainment I wondered how much I used. I didn't expect as much as it was. ", "score": 1},{"body": "http://www.freakinawesomenetwork.net/wp-content/uploads/2011/11/crystal-pepsi.jpg\n\nI had this stuff in Europe about 10 years ago. Tasted the same, blew my mind. Until then I thought colas had to be tar black.", "score": 1},{"body": "http://i.imgur.com/vq6Xd.gif ", "score": 1},{"body": "It appears it just was", "score": 1},{"body": "Most states don't make appointments unless you own commercial trucks, like 18 wheelers or for farm equipment. Some want an appointment for a motorcycle test, driving the obstacle course. Otherwise, bring a book and be prepared to wait.", "score": 1},{"body": "Thats the spoon people tell you to eat their ass with", "score": 2},{"body": "Because here in America. We don't know how to prioritize. \n\nMost of the times though it's because a lot of people are renewing, taking tests, setting up appointments, having appointments and so on.\n\nA lot more gets done in our DMV and also the clerks take their jolly ass time like it's a fucking game.\n\nThe reason why my local one was empty is because they removed the testing center. Those are being done by the driving schools instead of the DMV offices now.\n\nThe bulk of the crowd dealt with just that. So now it's a barren wasteland.", "score": 1},{"body": "Very sure, I don't have a photo of the cross section but it definitely looked, tasted and smelled like a cucumber.", "score": 1},{"body": "Finally we don't have to share with the coloreds", "score": 2},{"body": "Well would you look at that! I've been cucumbering wrong all these years!", "score": 2},{"body": "I though it was until I actually picked it up", "score": 2},{"body": "I had heard of Japanese having dozens of flavours of KitKats and now this. ", "score": 1},{"body": "Not exactly the same thing, but Canada Mints taste like Pepto Bismol.", "score": 2},{"body": "Oh I see....I live in Texas, never heard of a limit from any providers here...I must be lucky, there's no way I could cap the data on my home internet.  Even my phone is unlimited lol.", "score": 2},{"body": "That's just the study rooms, the rest of the library is pretty awesome. ", "score": 1},{"body": "Yeah, I tried Pepsi Pink a couple weeks ago and it is indeed gross. It was right on that \"Should I just pour this down the sink?\" border. Drinkable but just barely.\n\nCoke Orange wasn't *bad*... just disappointing. It tasted like orange soda that somebody put a bit of Coke in. That's fine I guess. If you're making a whole new product though I'd hope we could do better.", "score": 1},{"body": "Are you a wizard?", "score": 2},{"body": "Gook Juice.", "score": -1},{"body": "All I can see is a super small pinky toe! =P ", "score": 1},{"body": "Same. I walked in and immediately started looking for an out of place Blue Police Box.\n\nIt felt alien to be honest. ", "score": 2},{"body": "Man I think you might need to see a doctor if that's how yours look", "score": 2},{"body": "A \"Her\" moment right there. ", "score": 1},{"body": "There's plenty of good music for the trombone, it just might say \"cello\" at the top.", "score": 1},{"body": "She picked the song. Before realizing the lyrics. Lmao.", "score": 1},{"body": "Thanks for the tip, but I'll stick to Cottonelle.", "score": 1},{"body": "Stop using your socks as a cum rag.", "score": 2},{"body": "I love Pepsi Pink AND Coke Orange!!!", "score": 1},{"body": "But then wouldn't it say James Franco?", "score": 2},{"body": "IT'S SO FUCKING GOOD AND I ONLY FOUND IT IN ONE PLACE D': It tastes like Pepsi, but with other awesome strawberry and milk flavours... So good.", "score": 9},{"body": "Just seeing this picture is immensely satisfying", "score": 2},{"body": "Roughly 100 years", "score": 4},{"body": "Bring back Pepsi Blue!!", "score": 1},{"body": "Nature's Pizzelle.", "score": 1},{"body": "Ok I see I was just excited I got it and uploaded without logical thought", "score": 1},{"body": "It's like the sword in the stone. I might be a department store king!", "score": 1},{"body": "like vodka and redbull", "score": 3},{"body": "You're going to get credited with this discovery even though it has been known far sooner.", "score": 1},{"body": "The dark one was photoshopped in. Just like University of Wisconsin's brochures", "score": 6},{"body": "Sorry, time difference means I was sleeping lol It tastes like strawberry-covered sex. I love it more than is rational to love a soda.", "score": 1},{"body": "Its probably just the curtains.", "score": 3},{"body": "&gt; out of a dozen easily recognizable veggies\n\nout of a dozen easily recognizable veggies they could have used that instead.\n\n*ftfm", "score": 1},{"body": "That's pretty good advertising.", "score": 2},{"body": "&gt;Edit: Bolded my mistake for the lulz\n\nYou didn't bold the other mistake tho\n\n&gt;beptobismol", "score": 6},{"body": "It tastes like strawberry flavoured pepsi...really good actually.", "score": 1},{"body": "Do you think someone would do that? Just go on the internet and tell lies?", "score": 1},{"body": "Try semen next.\n\nFuck, I'm so sorry, that instantly popped into my mind and I hate it.", "score": 11},{"body": "If I had a choice between sex and a melon soda float, I would choose a melon soda float every god-damn time.", "score": 1},{"body": "i would enema my asshole with that in a heart beat ", "score": 1},{"body": "He uses Grande, Somewhere near Midland.", "score": 1},{"body": "That video has no audio on mobile.", "score": 1},{"body": "They have beans in their veggies, which is also in their protein section.", "score": 1},{"body": "It's fucking legendary... I have to go back to shufu no mise to find some more of it...", "score": 1},{"body": "It's probably just water droplets that were on his bike but fell off once he moved it", "score": 2},{"body": "What is an \"inductor y\" paragraph, some type of capitalist plot?", "score": 3},{"body": "the fuck is wrong with thier taste buds", "score": 2},{"body": "Not risking", "score": 1},{"body": "Cum on man, I know to use the white ones.", "score": 2},{"body": "\"tallasiandude99\" *gags*", "score": 1},{"body": "Ugh, no T_T that's awful. Also haven't seen it anywhere around where I live. Sucks T_T", "score": 1},{"body": "You really came out and socked it to me.", "score": 2},{"body": "Best I've seen is /u/SourCreamWater", "score": 2},{"body": "Penises.\n\nRedbull gives you penises", "score": 4},{"body": "That's probably due to the cocaine content.", "score": 1},{"body": "Chu wildling ", "score": 1},{"body": "It's more sour as it ripens.\ndepending from what region you're from, this is a preferred taste.", "score": 2},{"body": "Mine fell off today (in some food... hehehe)\n\nIt doesn't hurt, no.  But it's weird as fuck because I thought it was a bruise and I had never heard of a blood blister before I got one but now I see someone else getting one on reddit.\n", "score": 2},{"body": "*dons wizard robes*", "score": 1},{"body": "It's like imagine the strawberry flavored [Nesquik](https://www.marketday.com/prodLarge/8106.jpg) but with a bit of carbonation to it.", "score": 1},{"body": "Who asked, you rat fink? ", "score": 0},{"body": "Of course not. If you live in Japan and are looking for Tex-Mex sure, it's understandable. I was talking about people visiting.", "score": 1},{"body": "Pepusi Pinku", "score": 0},{"body": "This looks like an old picture from 1930's the way its colored, it's cool.", "score": 1},{"body": "Wookiee (two e's)", "score": 1},{"body": "This is the weirdest Japan soda I've seen yet.", "score": 1},{"body": "No. No, Private Pile it would not.", "score": -1},{"body": "I must have passed through a time warp field  😬😬😬", "score": 1},{"body": "I promise I won't keep stalking you about this, but look what this exceptionally rare one sold for:\n\nhttp://www.ebay.com/itm/321652505097?\n\nEdit:  Crap, didn't realize it was the machine also.  I think a LOT of that price is the keyboard though.", "score": 1},{"body": "Haha I'm flattered, but what about /u/MOLDY_QUEEF_BARF", "score": 2},{"body": "I'm *not* Googling that, so might I get a hint as to why that's disgusting?", "score": 1},{"body": "Also adding baking soda to the water helps a ton!", "score": 2},{"body": "And something else to add weight.", "score": 2},{"body": "Carrots, potatoes, and broccoli are all vegetables, no?", "score": 1},{"body": "ewww, hahaha", "score": 1},{"body": "It. Tastes. So. Bad.", "score": 1},{"body": "Is it from costco?\nMine started sprouting too\nThe sprouted bit was kinda tough.", "score": 1},{"body": "Don't be rude you probable Twink", "score": -2},{"body": "I have not experimented with this but supposedly it does help! ", "score": 1},{"body": "at least you mad ethe best of it", "score": 3},{"body": "That's brilliant in the most sketchy of ways", "score": 8},{"body": "The exclamation point in the title makes this far too interesting.", "score": 1},{"body": "That's exactly what it was! The seat was all wet and dripped off. ", "score": 3},{"body": "Kindergarten teachers are chosen by the administration to pit one faction of children against another, for if the kindergartners were allowed to speak with one voice and move in one direction, even the principal would fear their might! Kindergartners, wake up from nap time! History waits!", "score": 2},{"body": "This is strange. Weird drinks in Japan are weird but weird drinks in the US are cool? ", "score": 1},{"body": "It was definitely sour, I didn't know people actually preferred it that way though. That's actually pretty interesting!", "score": 2},{"body": "Looks like this belongs on /r/DiWHY ", "score": 1},{"body": "　　　　　　　　　　　 　 ∧__∧\n\n　　　　　　　　　　　 　( ͡° ͜ʖ ͡°)\n\n　　　　　　　　　　　　⊂　　つ\n\n　　　　　　　　　　　　　(つ ﾉ\n\n　　　　　　　　　　　　　 (ノ\n\n　　　　　＼　　　　　　☆\n\n　　　　　　　　　　　　　|　　　　　☆\n\n　　　　　　　　　　(⌒ ⌒ヽ　　　/\n\n　　　　＼　　（´⌒　　⌒　　⌒ヾ　　　／\n\n　　　　　 （’⌒　;　⌒　　　::⌒　　）\n\n　　　　　（´　　　　　）　　　　　:::　）　／\n\n　　☆─　（´⌒;:　　　　::⌒`）　:;　　）\n\n　　　　　（⌒::　　　::　　　　　::⌒　）\n\n　　 　／　（　　　　ゝ　　ヾ　丶　　ソ　─ ", "score": 5},{"body": "YES YES YESSSSS", "score": 1},{"body": "You probably don't see them because they got hunted to extinction.", "score": 1},{"body": "The ricin cigarette worked out well for Jesse too", "score": 1},{"body": "So what's the point of posting a picture of a screen paused on Jonah Hill (your username aside)?", "score": 2},{"body": "So. Much. Porn.\n", "score": 2},{"body": "I think I missed this. What is analog about the elevator buttons?", "score": 1},{"body": "What no durian flavor?", "score": 1},{"body": "I cant see fucking anything in this picture ", "score": 2},{"body": "/u/Smebster is correct!  It is Five Watt on S Nicollet and it has the best cold press in the cities.\n", "score": 1},{"body": "Yep, my South East Asian Grandparents do!\nI think it's common in Laos and Thailand.\nJust add Salt, Pepper, Tamarind or Lemon, and fish sauce and enjoy!", "score": 2},{"body": "I took this pic this morning at like 10am then posted it.  On the way out the barista said he might have seen it on Reddit.  I've never actually re-posted anything before. What do I do now?", "score": 1},{"body": "Not all Canada, sales tax varies, we have only 5% GST here. ", "score": 1},{"body": "Yeah, sorry, I should have clarified that. Japan (well Tokyo at least) has great international food, but relatively few Mexican and fewer TexMex places. However, all the other places make up or it. ", "score": 1},{"body": "Now how come I couldn't come up with that?", "score": 2},{"body": "Bring back spearmint tic tacs!", "score": 1},{"body": "What I do in the privacy of my home is my business. Well.. Within Range of my Wifi signal.. Which is technically outside the home.", "score": 2},{"body": "Interesting! I had no clue it was supposed to be strawberry milk flavoured. For me, it tasted more like liquified gummy bears with the mild flavour of pepsi.", "score": 1},{"body": "That's egg-celent", "score": 2},{"body": "Pour up Japan", "score": 1},{"body": "What the fuck did I just hear Lance?!", "score": 2},{"body": "I remember hearing it was caked Pepsi because it was made to treat dyspepsia (indigestion)", "score": 1},{"body": "I work at Costco, I see this all of the time, but the real mildly interesting this is wtf is wrong with the jug?? doesn't look like the gallons we get.", "score": 1},{"body": "They have it at the Wendy's in Omotesando and I expect at other locations as well.", "score": 4},{"body": "Good for you! Have some fucking karma! ", "score": 1},{"body": "I just keep seeing SMEGMA_CHEESE on my front page... unfortunately having cards against humanity has taught me what that is", "score": 1},{"body": "I know it's kinda cool to say British things like \"pissed\" and \"mate,\" but if you're American and you say these things, especially abbreviated versions, you should be hanged for treason and exiled to r/cringe. ", "score": 1},{"body": "Coke orange tasted super gross! (Or I guess it was for me)\nIt felt as if someone had mixed Coke with concentrate orange juice. [Pepsi pink tasted much better in my case, almost like liquified gummy bears or jelly beans.](http://i.imgur.com/k4yWdku.jpg?1) There was also melon flavoured fanta too!", "score": 1},{"body": "You gotta love mobile version.", "score": 7},{"body": "You found the Michelin Man's glory hole.", "score": 25},{"body": "Well I know what I'm collecting during my trip to Brazil this year!", "score": 1},{"body": "it's a fucking *cute* hand towel", "score": 1},{"body": "Good lookin out, hoss! That butter was meant for the frying pan. ", "score": 1},{"body": "/r/hailcorporate", "score": 1},{"body": "what the hell is the matter with you people", "score": 37},{"body": "Even your car knows", "score": 2},{"body": "Almost bought it when I was in Japan. Thankfully I didn't after learning about the taste. ", "score": 1},{"body": "Right at the 1:00 mark. ", "score": 1},{"body": "[I know where you got it.](http://images.fastcompany.com/upload/inception-bend1.jpg)", "score": 1},{"body": "You have to click reply under the comment you want to reply to...", "score": 1},{"body": "my time on the internet has now been all well spent, ahh thankyou good sir.", "score": 1},{"body": "Oh, I'd imagine. I wanna visit Japan purely for the Kit Kat stores. They can have all my money.", "score": 1},{"body": "It's spelled senpai you BAKA", "score": 12},{"body": "Ops mom was probably walking there.", "score": 1},{"body": "Twinkies?", "score": 1},{"body": "+accept", "score": 1},{"body": "I thought this meant in a bath with you lol. Very confused at first.", "score": 1},{"body": "Seriously, thanks for not showing the label and just calling it an \"energy drink.\" All this weird product placement on reddit bums me out.", "score": -3},{"body": "Neato what is that a drain for, friend?", "score": 14},{"body": "Green tea kit kats are the bomb, I picked some up in the Narita airport", "score": 1},{"body": "Just to say I've had it, I want one.", "score": 1},{"body": "Sponsored by Barney Stinson. Patent pending.", "score": 1},{"body": "That sounds delicious, I love strawberry milk!", "score": 1},{"body": "holy shit, how old's your house?", "score": 3},{"body": "The best way to best it is to shoot it with an arrow in the head. If that's too hard, you can use your sword but be careful about getting close. After a few shots/hits it will die (but there are 3 I think) and then you can get the dungeon piece and another heart piece. \n\nEdit: [Reference] (http://zelda.wikia.com/wiki/Lanmolas) ", "score": 6},{"body": "Yeah! I wish I had gotten a better picture, but I was at a stop light and had to be quick.", "score": 1},{"body": "I don't think this is from \"colored salt.\"\n\nAre you talking about [this blue sidewalk salt?](https://fopnews.files.wordpress.com/2010/02/img_6948.jpg) Because that's not even close to the same color. And neither is beet juice.\n\nA 5 second google search turned up a few possible explanations. http://cultureofchemistry.fieldofscience.com/2013/01/will-bromine-turn-squirrels-purple.html\n", "score": 3},{"body": "Mine is quite related to OP's...", "score": 1},{"body": "At that point, why not just steal it outright?", "score": 4},{"body": "Must be commercial free. ", "score": 2},{"body": "I like your username, maybe we should dine together", "score": 1},{"body": "Or...perhaps both...", "score": 1},{"body": "\"Genghis Khan firmly puts his hand on your shoulder to prevent you from crossing.\"", "score": 2},{"body": "That truly was mildly interesting. Maybe a little over the line to not at all interesting, but I think the penny joint helped. ", "score": 0},{"body": "Washing dishes at Costco!", "score": 15},{"body": "2002, its at Costco haha. ", "score": 5},{"body": "Cocalola : because when cocaine meets pedophilia, you need a moniker.", "score": 1},{"body": "Don't worry, it's safe, he's always wearing a rubber.", "score": 16},{"body": "Pepsi Pinkman", "score": 1},{"body": "My fingers started feeling icky sticky after I saw that thing, and I started worrying about diabetes, EVEN THOUGH MY LAST MEAL WAS 5 MINUTES AGO AND IT WAS EGGS SUNNY SIDE UP WITH TABASCO. That's how fucked up soda is.", "score": 1},{"body": "Really!? Fuckin Tokyo. Unfortunately I live far away from Tokyo, near Nagoya.\nI don't remember if nag has a Wendys", "score": 1},{"body": "Susan G. Komen will be on that.", "score": 1},{"body": "Two in the pink, one in the coke.", "score": 1},{"body": "That's your cup of pee.", "score": 0},{"body": "I see no such bird", "score": 1},{"body": "Ah I was the opposite. I bought the Orange on several occasions and the pink once and never again. \nThe melon is like a permanent drink, been around for forever. \n\nthe pink and orange are either seasonal or temporary, I think...", "score": 1},{"body": "So... what crime did you commit this time?", "score": 1},{"body": "Good'ol Pepsi blue and Doritos 3D! ", "score": 1},{"body": "two in the pink, one in the coke", "score": 1},{"body": "The whole thing is a commerical. An 8 min commericial. Advertising the upcoming season of Vikings.", "score": 2},{"body": "Check out Milkis soda. Korean stuff. Super tasty.", "score": 1},{"body": "ROUS?", "score": 1},{"body": "ah, the carpet threw me off since i live in an old house with gas pipes like that. makes more sense being a work place. Saw and smelled some shit at pizza hut over the years.", "score": 3},{"body": "I don't know :( it just tastes good! I love pepto, zantac (like the tablet ones) and tums..", "score": 4},{"body": "Where did you happen to find it? I haven't been able to... :(", "score": 1},{"body": "You have a ghost problem, time to call the Busters!", "score": 8},{"body": "I've been noticing this a few times after this past storm. Don't recall seeing it before but can't imagine there's this snow that's all new for 2015.", "score": 1},{"body": "Oh hello GMO.\n\nI'm a poet and no I'm not", "score": 0},{"body": "\"Zoom please\"?  You don't know how to crop a photo?", "score": 0},{"body": "/r/oddlysatisfying ", "score": 0},{"body": "One day, I spent my lunch break on the great lawn in Central Park. As I lay in the grass, the sun was blotted out for a second. Thinking some kid jumped over me thinking they were funny, I looked around to catch a hawk lifting off with a squirrel in its talons.", "score": 2},{"body": "I am definitely gunna need a link for cyanide bamboo eating lemurs.", "score": 2},{"body": "Kind of reminds me of Zoidberg's mouth", "score": 1},{"body": "It seems like everything is weird in Japan. It's like, when you beat all of the special star levels in Super Mario World and everything get's all strange. It's like, you're still playing Super Mario World, but it's no longer Super Mario World.\n\nJapan is like reality, but it's no longer reality.", "score": 1},{"body": "Shit tons of ramen.", "score": 1},{"body": "For all who don't know Green Tea Kit Kats are the best, you can get them off amazon too. ", "score": 5},{"body": "http://www.ansci.cornell.edu/plants/adapt/lemur.html ", "score": 1},{"body": "Chipception.", "score": 1},{"body": "If you say them fast enough, they're the same word.", "score": 2},{"body": "I ordered my books from Chegg too. I got a can of Red Bull and... one Tide laundry detergent pod...", "score": 3},{"body": "I've been finding loose change in my cereal as well...someone should complain.", "score": 1},{"body": "Oh no! That is totally going to mess with the time-space continuum. What the hell are you supposed to keep at a distance?? You just created infinite parallel time lines. ", "score": 1},{"body": "Omfg... that is one of the coolest things I have read. Thank you. ", "score": 1},{"body": "Coca-cola makes a milk flavored soda called [Ambasa](https://en.wikipedia.org/wiki/Ambasa) that was originally sold just in Japan. I don't have a preference between Milkis or Ambasa.\n\nDid you try McCol? It's a barley cola; it has a unique taste.", "score": 1},{"body": "#####&amp;#009;\n\n######&amp;#009;\n\n####&amp;#009;\n [**Ambasa**](https://en.wikipedia.org/wiki/Ambasa): [](#sfw) \n\n---\n\n&gt;\n\n&gt;__Ambasa__ is a [milk](https://en.wikipedia.org/wiki/Milk)-based soft drink sold by [The Coca-Cola Company](https://en.wikipedia.org/wiki/The_Coca-Cola_Company) in [Japan](https://en.wikipedia.org/wiki/Japan).  It was introduced in 1982.  The company also brought the brand into South Korea in 1984. Variants of this drink, like non-carbonated or fruits (melon and strawberry) flavoured versions, are sold in Japan.\n\n&gt;\n\n---\n\n^Interesting: [^Tewodros ^I](https://en.wikipedia.org/wiki/Tewodros_I) ^| [^Quwat ^Jabal](https://en.wikipedia.org/wiki/Quwat_Jabal) ^| [^Frutonic](https://en.wikipedia.org/wiki/Frutonic) ^| [^Santiba](https://en.wikipedia.org/wiki/Santiba) \n\n^Parent ^commenter ^can [^toggle ^NSFW](/message/compose?to=autowikibot&amp;subject=AutoWikibot NSFW toggle&amp;message=%2Btoggle-nsfw+co5f7xz) ^or[](#or) [^delete](/message/compose?to=autowikibot&amp;subject=AutoWikibot Deletion&amp;message=%2Bdelete+co5f7xz)^. ^Will ^also ^delete ^on ^comment ^score ^of ^-1 ^or ^less. ^| [^(FAQs)](http://www.np.reddit.com/r/autowikibot/wiki/index) ^| [^Mods](http://www.np.reddit.com/r/autowikibot/comments/1x013o/for_moderators_switches_commands_and_css/) ^| [^Magic ^Words](http://www.np.reddit.com/r/autowikibot/comments/1ux484/ask_wikibot/)", "score": 1},{"body": "/r/awwducational ", "score": 1},{"body": "(This is where I make eye contact with the camera) \"Tweet #thinkpinkpepsi @pepsi and show us how you, are thinking pink!\"\n", "score": 1},{"body": "This has been front page all day. I really don't care what color my soda is. Please stop. ", "score": 0},{"body": "It's full of [Wonder Bread](http://graphics8.nytimes.com/images/2007/04/25/dining/25feed_span.jpg) dough", "score": 1},{"body": "I just puked in my sink!", "score": 2},{"body": "Spoiler: it's chemically and sweet", "score": 1},{"body": "Well also poo. Cuz he said perhaps both. ", "score": 0},{"body": "Equality maaan", "score": 3},{"body": "You might have gotten more use out of it if you had removed the dead squirrel from the bottom shelf. ", "score": 2},{"body": "What the fuck are you drinking? That looks fucking disgusting.", "score": 2},{"body": "When you wrote \"I Love The Pussy\" was you thinkin' about danglin' ya dice on Lance's forehead? ", "score": 1},{"body": "is nothing sacred to these people\n\nI don't want to know what butchery they could have done to Coca-Cola", "score": 1},{"body": "(Cute little Dr. Seuss Yink pops up on the screen along with the pepsi logo, he pushes the logo to the side so he can drink his pink pepsi.)", "score": 1},{"body": "Working in the Costco food court has made me love and hate pizza, enter therapy, and get my ass back in school and be my continuing motivation to stay there. Thanks Costco. ", "score": 7},{"body": "I thought it would be really sweet, like candyfloss. I was surprised when I tried it and it was really tasty! Not too sweet and similar to a sherbet flavour.", "score": 1},{"body": "Tastes like sherbet and a slight flowery taste. Not too sweet. I was surprised when I saw that it was actually strawberry milk flavour!", "score": 1},{"body": "Ha, thats a good one.", "score": 1},{"body": "pizza hut sort of did that for me, thanks pizza hut?", "score": 2},{"body": "I've not seen too many fat kids either, but plenty of fat people 20+ years ", "score": 1},{"body": "They sell green tea kit kats at Asian  markets in Southern California  :D ", "score": 1},{"body": "I feel like it would look cooler from a distance. Like an illusion. ", "score": 2},{"body": "naw, I bought it from a little neighborhood produce market.", "score": 1},{"body": "It did, but the pic you couldn't tell it was in the corner.", "score": 1},{"body": "Sherwin williams is coming out with a kit to easily do this at home soon\n\n\nSource: I work there", "score": 1},{"body": "\"Starbucks attacks\" ", "score": -1},{"body": "\n 4. Original [OC] photographs only.", "score": 1},{"body": "Is... is that man choking her?", "score": 1},{"body": "But not as used", "score": 1},{"body": "It wasn't as funny", "score": 4},{"body": "I made a YouTube video tasting this stuff a month and a half ago. This was in Japan in 2011 as well, so there are lots of videos on YouTube from back then as well.\n\nI haven't seen it in awhile, so either it's not available anymore, in my area, or I just haven't noticed it.", "score": 1},{"body": "I would drink the shit out of that so hard", "score": 1},{"body": "The swirls are the eyes. Although, I see more of an old lady turtle wearing a wig. ", "score": 1},{"body": "[Not very surprising](http://www.daycounter.com/Calculators/Air-Core-Inductor-Calculator.phtml), but still interesting... mildly.", "score": 1},{"body": "Verry interesting.. It must taste like the lucky charms shamerock guy on the ceral just expended his intire gold savings. He probably has a horseshoe factory somewhere... He would hes irish.. Those darn irish cereal people.. ", "score": 1},{"body": "That's definitely not carpet.", "score": 4},{"body": "Wow! That was awesome! Maybe it has a flavor ?", "score": 1},{"body": "Save 'em for the next time you get one without its straw ", "score": 2},{"body": "Uhhh..... thanks... I totally noticed. :(", "score": 5},{"body": "Legal reasons why this can't come to the US, a la Susan Komen charity has trademarked the color pink. ", "score": 1},{"body": "SMEGMA_CHEESE_SANDWICH", "score": 1},{"body": "it looks like a cup on a table thanks to the car being cut off.  \nside note: is it a law that a gamestop has to be next to a starbucks?", "score": 21},{"body": "With some better wheels in front, I'd use it!", "score": 2},{"body": "Holy fuck. Is this in San Diego?  I swear this place looks familiar", "score": 8},{"body": "It's a new release with more features ", "score": 1},{"body": "Another thrifty tip: stab people and take their money.", "score": 4},{"body": "I was gonna say wow look something colored pink and not supporting Susan g conman finally.", "score": 2},{"body": "I think i'm having a bit of Déjà vu ", "score": 2},{"body": "Slow day ", "score": 2},{"body": "Ya what", "score": 1},{"body": "You should be ashamed. We say \"African-American\" caution sign. ", "score": 3},{"body": "Yeah, this is on Palm avenue in Imperial Beach.", "score": 5},{"body": "Reservoir Tic Tacs", "score": 1},{"body": "also no screenshots.\n", "score": 1},{"body": "opposed*", "score": 1},{"body": "Clempson...", "score": 1},{"body": "Shut up. Let it remain a mystery", "score": -2},{"body": "If I remeber correctly they are refered to as Nickelodeons and we're a pre-jukebox sort of set up.", "score": 2},{"body": "Go Navy lol", "score": 1},{"body": "You forgot to sign out and log into Bogon's account for this comment.", "score": 1},{"body": "$279 in 1961 is roughly equal to $2,209 today, adjusted for inflation.", "score": 1},{"body": "That totally looks like a tree hugging another tree...", "score": 1},{"body": "I never saw it that way...", "score": 1},{"body": "That's actually a really good idea, considering it's gonna get covered with stuff anyway", "score": 1},{"body": "Haha (in fake British accent)", "score": 1},{"body": "http://25.media.tumblr.com/tumblr_m3fg2adnhX1qito8io1_500.jpg", "score": 1},{"body": "Apparently this is referencing a Marvel character in the series \"New Warriors.\"\n\n*EDIT* Better source: https://en.wikipedia.org/wiki/Psionex", "score": 1},{"body": "Nice post Pepsi Co! 'Murcia primed and ready for Pepsi *pink*, free of charge.", "score": 0},{"body": "\"I don't spend much time here?\"..... I'm sorry but that just doesn't make sense. Are you... Are you fucking with me? AH HA! I get it now. _she is just fucking with me everyone. Right? Everyone spends too much time here... Right? \n", "score": 1},{"body": "Actually it stole my shield. :(", "score": 10},{"body": "Venti iced Caramel Macchiato, extra caramel.", "score": 33},{"body": "Yet another invention from the Department of Unnecessary Engineering.", "score": 1},{"body": "How did you figure out the exact number?\n\nOP is rain man.", "score": 1},{"body": "I came here to say exactly that.\n\nIt was the most durable and loyal little fucker ever :(", "score": 8},{"body": "Picture taken with a few friends in Tokyo.  Umm, if people don't get this then...", "score": 1},{"body": "Or he/she is using \"jack and coke\" as a general term for whiskey and cola. Correct me if I'm wrong, but I believe you can buy clear (unaged?) whiskey. Kind of a long shot, but then it would be completely clear. ", "score": 1},{"body": "Yeah because it was set up to deliberately look that way, just look to the left placement of the sugar/straw packet to look like a car park marking. ", "score": -5},{"body": "Any difference between with  the general one?", "score": 1},{"body": "How many times I gotta tell you, I love the pussy!", "score": 1},{"body": "Rhymes with you suck. Anhera", "score": 1},{"body": "i was just making a joke if you like it dont let it get you down", "score": 5},{"body": "Or you just have a virus. ", "score": 1},{"body": "Dat peel.", "score": 1},{"body": "Definitely getting a caramel macchiato in the morning now after seeing this before bed lol", "score": -2},{"body": "Because why not", "score": 1},{"body": "My lookout hasn't caught any.", "score": 1},{"body": "Looks like a blood transfusion bag...gross. Although being hooked up to ketchup wouldn't be the worst thing ever. ", "score": 1},{"body": "These cows are small. But these cows are far away.", "score": -2},{"body": "Eh, not really", "score": 9},{"body": "\"Now fly, motherfuckers!\"", "score": 1},{"body": "Yeah, I love how the straw/sugar is made to look like a parking lot line. ", "score": 122},{"body": "I thought you said dinner would be ready in an hour?\n\nYah.... About that....", "score": 8},{"body": "I would have never noticed that at first glance. Very observant, OP", "score": 2},{"body": "There are two wasp carcasses in my vestibule's windowsill. Pretty good. Those fuckers were gently fucked with a phone book.", "score": 1},{"body": "Oh purdue has those allllll over the place man ", "score": 1},{"body": "instructions unclear: dick stuck in toaster", "score": 6},{"body": "EWWW! Is it sticky?", "score": 1},{"body": "Imagine someone losing control of it and getting smacked in the face or shin or crotch by that sucker!!", "score": 2},{"body": "&gt; conman \n\ni like it, im gonna start using that and pretend like i came up with it.", "score": 1},{"body": "Holey Chip!", "score": 1},{"body": "Drinking that would be the most intense 30 seconds of my life.", "score": -2},{"body": "Or it's gender neutral.", "score": 0},{"body": "You made this?", "score": 2},{"body": "&gt; I luh da chicken!\n\nFTFY", "score": -2},{"body": "Not a bad idea actually. The other competitors need to catch up....\n\n-Dad", "score": 1},{"body": "Actually the ん sound can change depending on the following character. In this case it''s followed by the \"p\" sound in \"pa\" so the \"n\" sound changed to \"m\"", "score": 2},{"body": "☕", "score": 6},{"body": "I think there should be a new rule where no exclamation marks can be used in the title. It's supposed to be only **MILDLY** interesting after all. No need to raise the tone of the text. ", "score": 2},{"body": "It seems like most people liked it here but to me, it tasted like medicine. Wasn't awful, but definitely reminded me of some kind of cough syrup. ", "score": 1},{"body": "Dude I know! It was so crazy. Like 2 or 3 good pushes and you would coast down the street for so long!", "score": 1},{"body": "optical illusion", "score": -4},{"body": "I'll take 2", "score": 2},{"body": "**Nice**", "score": -5},{"body": "....Daaaaaad, I said no more web. Gawd. ", "score": 1},{"body": "Not gonna lie my wifi is shit, so I have to use my data more often then i'll admit  ", "score": 1},{"body": "its also upside down\n", "score": 7},{"body": "I'd say about 5% of the drink is coffee ", "score": -1},{"body": "Looks a lot like another area in Encinitas.", "score": 2},{"body": "Ahh, chocolate mixture live free sex cam. A family classic.", "score": 4},{"body": "Two words. \n\nHippopotamus sweat. ", "score": 1},{"body": "They're both great romanizations, [DEAL WITH IT BAKA!](/r/TsundereSharks )", "score": 2},{"body": "This is something straight out of alien tentacle hentai shit", "score": 2},{"body": "Nectar of the gods. No idea why you don't see it outside Asia.", "score": 1},{"body": "This post brought to you by the H. J. Heinz Company", "score": 0},{"body": "Who else thought of Avatar: the Last Airbender?", "score": 1},{"body": "Oh man don't ever put that stuff straight from the bottle anywhere near your eyes. It has to soak for hours or else you'll feel an immense burning pain. ", "score": 1},{"body": "haha,really like a cake", "score": -1},{"body": "Try [Pepsi White](http://www.reddit.com/r/mildlyinteresting/comments/2u68uj/i_found_pepsi_white_in_japan/), it tastes like Christmas!", "score": 0},{"body": "So what device do you use for casting to your tv?", "score": 2},{"body": "Yeh! It's Friday's post already. Elephant in the Room @coffscoastexposed.wordpress.com", "score": 1},{"body": "How long have you been sitting there?", "score": 1},{"body": "Cool.", "score": 1},{"body": "i wonder if the cam girls will be chocolate as well?", "score": 1},{"body": "Oh damn, that old thing had the ability to internally record radio. \n\nNow that I think about that, that feature was probably illegal.", "score": 30},{"body": "This wasn't near Fukushima was it?", "score": 1},{"body": "WHY DOES THIS SURPRISE YOU", "score": 1},{"body": "Wait, how? I can't seem to figure out what this cup is resting on. Is that a car roof?", "score": 0},{"body": "[http://nu.spoonuniversity.com/recipe/two-ingredient-treats/](http://nu.spoonuniversity.com/recipe/two-ingredient-treats/)", "score": 2},{"body": "What does it taste like?", "score": 4},{"body": "replaceable battery, microSD slot, physical buttons, built like a tank.  what's not to love?!?\n\ni use the Clip now, which is great, but the Sansa will always have a fond place in my heart.", "score": 13},{"body": "ohhhh you go girl!", "score": 1},{"body": "Yawn", "score": 0},{"body": "Labias.", "score": 1},{"body": "Super late response, but Haha great picture, I can actually see it now that you've pointed it out ", "score": 1},{"body": "Little bottle for little people...", "score": 1},{"body": "Jarritos ftw", "score": 3},{"body": "this just happened to me last night! I thought it was pretty cool too.", "score": 1},{"body": "How do they get up there to adjust it?", "score": 1},{"body": "In comic sans, nonetheless.", "score": 1},{"body": "A TV series about a time traveller.", "score": 1},{"body": "wait....is that from the z100 radio station segment?", "score": 1},{"body": "I still use one.\n\nIt is falling apart, but I haven't found anything to replace it that matches features and can run rockbox.\n\nI have a bad feeling that I am going to have to pay decent money to buy a new in box one on ebay soon.", "score": 19},{"body": "hmmmm spoonuniversity. Somehow I am not sure that link was a mistake", "score": 1},{"body": "It tastes like walking around an abandoned mall at 3am while slowed down elevator music plays. ", "score": 1},{"body": "Need to turn it into a vector image and smooth out the lines. ", "score": 1},{"body": "Stupid and pointless. \n\nYou know how heavy the door is trying to do use it with your foot?\n\nThankfully, after using it many many times, I developed enough leg strength to win a race.\n\nI'm thankful for this technology, albeit the same time I hate it.\n\nI mean, everyone skips leg days right?", "score": 1},{"body": "/r/mildlydisgusting", "score": 7},{"body": "In case somebody doesn't know it: Ulan Bator is the capital of Mongolia, home land of the huns and their leader Genghis Khan.", "score": 1},{"body": "Just needs a straw. ", "score": 1},{"body": "That is one disgusting birthday cake.", "score": 1},{"body": "It's a trifecta ", "score": 1},{"body": "Orange Coke is a huge thing in Germany/Austria/a few other places. it's called Mezzo Mix.", "score": 3},{"body": "ill give you money to send me some!!", "score": 1},{"body": "Christmas!\n\n(cola + peppermint)", "score": 5},{"body": "You had one job! ", "score": 3},{"body": "Right, but Huns and Mongolians are typically thought of as different groups.  ", "score": 6},{"body": "*goldeneye intro*", "score": 1},{"body": "I think that happens most every time...", "score": 1},{"body": "Maybe it's not random at all...", "score": 1},{"body": "I was gonna say Oceanside. Haha", "score": 1},{"body": "I made the Genghis Khan part up, \nIt's probably just a man dress in traditional mongolian clothing. ", "score": 7},{"body": "It doesn't quite taste like strawberry milk. Just sweeter, more artificial, Pepsi.", "score": 1},{"body": "Real men drink pink!!!!", "score": 1},{"body": "So was OP.", "score": 2},{"body": "With Japans history in weird, it was probably made from Pepsi Crystal ran through a filter of used tampons.", "score": 1},{"body": "1 muffin was over $4? And that was the sale price? ", "score": 1},{"body": "i bought the Clip as a 'temporary' player a few years ago when my sansa died while i was away from home on business.  \n\ni'm running rockbox, and the only annoying thing is the volume buttons don't work if you lock it.  other than that, no real complaints.", "score": 7},{"body": "I though it said \"sluts\". Was disappointed. ", "score": 1},{"body": "It was a twelve-pack.", "score": 1},{"body": "I left a potato at the back of my food cupboard once for several months. The shoots it grew in the darkness there were about 3 ft long!", "score": 2},{"body": "Thought the entire sky would be pretty. ", "score": 1},{"body": "And it's crispier too! \n\nThe crispy ones are so good :) ", "score": 1},{"body": "BURN It WITH FIRE", "score": 1},{"body": "Jones used to make one! ", "score": 1},{"body": "gotta feed the butt-man", "score": 1},{"body": "That's the one I laughed at (the beptobismol).  I thought the Cocalola was some product I wasn't familiar with...", "score": 1},{"body": "Québec ", "score": 1},{"body": "That's tow-tally awesome.", "score": 4},{"body": "Commies are everywher", "score": 0},{"body": "I think most whisk(e)y and coke mixes call for aged whisk(e)y, since it gives a special \"tang\" to the drink. Wouldn't the clear kind be basically like vodka?", "score": 2},{"body": "Illusion aside, what drink is that? It looks really delicious...", "score": -2},{"body": "I believe they're called maggots.", "score": 2},{"body": "https://www.reddit.com/r/mildlyinteresting/comments/2u3j5h/i_found_pepsi_pink_in_japan/", "score": 4},{"body": "/r/notinteresting ", "score": 1},{"body": "And it's only going to cost you $4,999.99 for a home installation!", "score": 1},{"body": "Internally? Can't most smartphones today record audio? What am I missing?", "score": 6},{"body": "This is the most honest product on the planet. There is no way to describe the flavor other than \"it tastes pink\"", "score": 1},{"body": "&gt;defiantly happened during manufacturing\n\n\"Take that you alcoholic fuck!\" -bottle", "score": 2},{"body": "Plsno", "score": 1},{"body": "Even better. Its baby alien doo doo. It boosts your immune system.", "score": 0},{"body": "Interesting example, the Strawberry Guava is an invasive species in Hawaii, and it often grows in thick groves around hiking trails because when hikers step on the fruit, they spread the mush and seeds as they walk.", "score": 2},{"body": "It's rotten, you'd better report this to the proper authorities before we face an epidemic of tic-tac blight.", "score": 1},{"body": "My SO once had an entire bag of kit kats with no wafers. They should make them like that because that's the best chocolate ever. ", "score": 2},{"body": "What if you were eating saltines and a ritz ended up in the package?", "score": 1},{"body": "Amazing story ", "score": 0},{"body": "Yea, I have thought about the Clip.  I would miss having album art and a scroll wheel, but I am getting desperate. \n\nI was hoping the mp3 player market would get refined by now, but instead it dried up.  ", "score": 3},{"body": "Oh, Wow. Well, that puts it into perspective. Thanks!", "score": 1},{"body": "it wasn't a smartphone.  just an mp3 player that could record audio when that wasn't a common feature.", "score": 14},{"body": "Tow-seption ", "score": 1},{"body": "I'm seeing a bikini monster can. I am confusedz", "score": 5},{"body": "It's a car roof.", "score": -2},{"body": "I've used one of these but it had no instructions. The problem is that it doesn't dry enough and if you try to dry again it sprays more soap and water on you!", "score": 1},{"body": "Oh, so it would be illegal becuase it was unexpected?\n\n  Edit: I said this assuming that by recording audio they meant real world audio like voices or something. I couldn't work out why the fact that it was \"only an mp3 player\" as opposed to a smartphone would change the legality of it.", "score": -6},{"body": "ecampus sent me a 5 hour energy with my last order.", "score": 1},{"body": "You shut up.  He gave an explaination to your mistake.  Why'd you have to be a dick about it?  ", "score": 3},{"body": "Looks like a Left 4 Dead [\"safe room\"](http://www.themarriedgamers.net/wp/wp-content/uploads/2010/10/l4d_smalltown03_ranchhouse0006.jpg)", "score": 1},{"body": "They probably banned all forms of corn syrup.", "score": 1},{"body": "\"Please don't eat me!!\" Haha pitful coconuts...", "score": 0},{"body": "Pepto Bismol makes me dry heave just to think about.  Your original comment was spot on.", "score": 1},{"body": "Couldn't be worse than Pepsi Blue, which looked and tasted like Windex.", "score": 1},{"body": "dat link doe", "score": 1},{"body": "My great-grandmother used to talk wistfully about the good old days when Coke was actually coke.", "score": 1},{"body": "not sure of the legality, but most mp3 players didn't have a mic and recording feature.  btw, we're talking recording real-world, not just recording tv/radio.\n\nedit:  like recording the audio of a college lecture, or something like that", "score": 6},{"body": "A lot of their candies are milk-flavored.  I suspect because most Asians are lactose-intolerant and can't enjoy the real thing.", "score": 1},{"body": "In their what? ", "score": 1},{"body": "Well can you explain to me the joke, then? Since apparently I don't get it.", "score": 1},{"body": "Looks fake.", "score": 1},{"body": "Looks like a re-labeled Nuka Cola Quartz.", "score": 2},{"body": "When I was little I loved the taste of amoxicillin (the bubble gum kind) and would always ask my doc to prescribe that for me. Now it tastes like shit though ):", "score": 1},{"body": "I was thinking Encinitas too, hahaha.  Small world.", "score": 0},{"body": "Who would want to watch a cam of someone living sex free? :P", "score": 2},{"body": "I dunno, I kinda like it.\nCoke orange was a let down, it was coke with a very mild orange aftertaste.\n\nRemember the salty watermelon Pepsi a few years back? Or the summer of fizzy coffee? ", "score": 1},{"body": "I was studying in Japan for a year. Didn't do any crazy exercise or anything. Just living there and having to adjust my diet and traveling habits helped me lose 30 freaking pounds.", "score": 1},{"body": "I vaguely have a huge penis. But in reality its not even there.", "score": 1},{"body": "What's more interesting is the device you're using to measure the inductance. Details?", "score": 4},{"body": "We have to go deeper...", "score": 2},{"body": "It kind of looks like a peach", "score": 1},{"body": "If only it could glow!", "score": 1},{"body": "I'm going to use your picture here as my new wallpaper. There is something so beautiful about this picture, though I can't say what... hmm?", "score": 1},{"body": "I'm all for eating weird-looking stuff, but.....", "score": 0},{"body": "Seed potatoes! Plant them, harvest fresh new potatoes, boiled served with mint and butter, yum. ", "score": 1},{"body": "I made a vine about [Pink Pepsi](https://vine.co/v/OHgvZnZKYri) a while back.", "score": 1},{"body": "I find this oddly satisfying", "score": 4},{"body": "This isn't a cement truck. It's a concrete transit mixer. Learn your shit OP. ", "score": 1},{"body": "Looks to me like a car pulled in with the wheels toward the right. Straightened the wheels out and backed up a little then pulled forward again. Finally they backed up with the wheels cranked to the left.", "score": 2},{"body": "[Reminds me of this...thing] (http://youtu.be/CgD0mSRP2rg?t=4m45s)", "score": 1},{"body": "[I can't possibly be the only one thinking of this...](https://danwoog.files.wordpress.com/2012/11/deer1.jpg)", "score": 1},{"body": "Oh god no!", "score": 1},{"body": "Or just a person trying to save another person. I don't see how you're determining genders here. ", "score": 1},{"body": "Pepsi. More like Pepto!", "score": 1},{"body": "Pepsi. More like Pepto!", "score": 1},{"body": "*obligatory Jurassic Park gif*", "score": 1},{"body": "The tracks in the middle of the ovals are the rear tires. The ovals are made by the fronts. A car came in from the cameras right side, and the driver turned the wheel to the left, swinging the car front toward the camera. The wheels stop. He puts it in reverse and cuts the wheel to the right creating the other half of the ovals as he backs into the spot. If you want to recreate this yourself, simply come down a road, pull into someone's driveway and back out turning the other way, turning around as if you were going the wrong way. ", "score": 2},{"body": "I still have mine :)\n", "score": 1},{"body": "This should be up voted more.  No other country has such obsessive fans.  I've lived here for a time and it's my home, but I really wish people would stop creaming themselves over flavors of snack food.  There really isn't a variety within the country.  I'd rather have a wealth of options than a summer Pepsi flavor for a month.  Wasn't one summer celery flavored?  I can't remember.  Really, I'd kill for cap'n crunch and some little Debbie.  And weed.  \n", "score": 3},{"body": "I was trying to look at the reflection of whatever device the photographer used to take this photo. It took me a good 90 seconds to figure it out.     \n\n^^^I ^^^am ^^^not ^^^a ^^^smart ^^^man.", "score": 26},{"body": "This was taken in my kitchen ", "score": -1},{"body": "I've passed a few Tow Truck-Trucks in my day", "score": 1},{"body": "And also it's impossible? Or is the loose piece from another coaster?", "score": 3},{"body": "I accidentally bought 40 salami flavored \"umai\" candies the other day. They're basically salami flavored giant cheesedoodles. No regrets.", "score": 1},{"body": "Pop an ass open!", "score": 1},{"body": "are you sure you're not confusing it with liquid amoxicilline? cuz that shit is da bomb", "score": 1},{"body": "What does it taste like?", "score": 1},{"body": "That's supposed to be a soap dish", "score": 1},{"body": "\"Can I get a coke?\" \"Is pink pepsi ok?\"", "score": 1},{"body": "Can't you give them some privacy?", "score": 1},{"body": "These trucks need to get a garage.", "score": 2},{"body": "It was a pleasant surprise, indeed!", "score": 1},{"body": "The one in the middle looks like he just finished. ", "score": 1},{"body": "this makes even less sense, what are you asking?", "score": 1},{"body": "They are new trucks being delivered", "score": 1},{"body": "Sexist that's how. ", "score": 1},{"body": "I think it's one of those sprinklers, that can move up from the ground when sprinkling and down again when not sprinkling.", "score": 1},{"body": "oh look yet another 'viral image' where the corporate logo is smack dab in the center, but yet again I bet it's 'just coincidental' ", "score": 7},{"body": "Looks like your phone has tourettes syndrome.", "score": 2},{"body": "oh..Oh....Ohhh its a straw", "score": -2},{"body": "/r/hailcorporate", "score": 72},{"body": "If you hate it so much stop drinking it.  Maybe carbonation would make it taste better.", "score": 2},{"body": "This player was released nearly 9 years ago, and you notice this just now?", "score": 3},{"body": "It's a different player altogether. ", "score": 3},{"body": "Ours are thought clouds: http://imgur.com/Gu1meyq", "score": 1},{"body": "I support this post much like that apple holder is supporting that apple. ", "score": 2},{"body": "This is a phenomenon called vivipary! Late in seed development, the accumulation of the plant hormone abcissic acid (ABA) is supposed to cause the seeds to become dormant while in the fruit until certain conditions are met, such as oxygen, moisture, and light exposure. Sometimes a mutation occurs that causes the seeds not to become dormant, such as a a malfunction in the ABA receptor. It's relatively common in tomatoes.", "score": 1},{"body": "Hue hue hue hue", "score": 3},{"body": "Did it work?", "score": 1},{"body": "Dat satisfying crunch doe", "score": 1},{"body": "It's ok it's 2198", "score": 1},{"body": "I was just thinking the same thing. I want to give it a hug or something", "score": 4},{"body": "Me too.", "score": 2},{"body": "I posted this like two months ago, and it got nowhere near as many upvotes. I think it's pretty good though. I buy it every once in a while. Tastes like old Pepsi Blue. ", "score": 1},{"body": "No way! That little device brings back so many memories. I believe there was a song pre downloaded on it that went something like this, \"There is a major and a minor to the key I'm singing and Oohhhh and I can say.\" Can anyone help me out with the name? \n\nEdit: through some extensive research, I've found it. Major and Minor - The Procession", "score": 14},{"body": "Well, that's not exactly true. Fruit is, in most cases, not nourishment for the seeds. That's what the endosperm is for, and why it is protected by a thick seed coat. The fruit is meant to be attractive to organisms that will eat it, and by doing so, help transport and fertilize the seeds.", "score": 4},{"body": "Gamestop by a liquor store. Almost the same I guess?", "score": 3},{"body": "It tastes orange", "score": 1},{"body": "Would this work?", "score": 1},{"body": "Maybe where he's from it's pronounced yorange", "score": 1},{"body": "Does it use Stevia?", "score": 1},{"body": "Turning right (it's allowed).", "score": 1},{"body": "I once worked at both gamestop and Starbucks at the same time. \nThey were side by side, and I often wore the starbucks headset when it was a dead night at gamestop to talk to them. It also meant free drinks always.", "score": 2},{"body": "And it's darker...racists", "score": 1},{"body": "Always wondered what Ulan Bator was like as a city. Is it big? Like, chinese-city-level big?", "score": 5},{"body": "You poor soul. I'm in Ireland and we have chupa chups in pretty much every shop, they're really common. ", "score": 1},{"body": "Uuhhmmm yep, Sweden", "score": 1},{"body": "fuck I should go to bed. This took me way too long to figure out. ", "score": 1},{"body": "ur username omg", "score": 1},{"body": "Pink Pepsi tastes almost exactly like Pepsi Blue. ", "score": 1},{"body": "I'm guessing \"OUTATIME\" was taken", "score": 1},{"body": "Because it was the recycling bin and someone threw garbage in it. We get paid for our scrap cardboard recycling but if it's got garbage in it they charge us to take it away instead. ", "score": 1},{"body": "Pepto Abysmal.", "score": 1},{"body": "/r/hailcorporate", "score": 3},{"body": "Are you sure it's not an apple holder? It sure tasted like an apple... ", "score": 1},{"body": "The fact me going to Gaia makes you so angry is delicious. I'm there right now. I got 10 gold. I'm going to buy a fancy hat. Teheheheh", "score": 1},{"body": "Don't they all pretty much look like that...?", "score": 3},{"body": "You posted this a few days ago", "score": 1},{"body": "It really is there. Can confirm. Clicked link. Found said hyperlink. No shawarma on website. Downvote.", "score": 1},{"body": "Oooh I'm so satisfied by this. Post to /r/oddlysatisfying if you haven't already. My mild OCD  (also known as 'weirdness') luurrrves that subreddit. ", "score": 1},{"body": "That's my birthday! ", "score": 1},{"body": "Only the ones that have seen a bottle of rum.", "score": -1},{"body": "Ya know, if you save up enough you might be able to get cash for the metal.", "score": 1},{"body": "no, it's 1998, which was, like, 9 years ago\n\nsource: am Ethiopian", "score": 1},{"body": "no, it should have read e^205 which is quite a lot", "score": 1},{"body": "Other way. Most likely their site had been hacked previously and they never picked up this.", "score": 2},{"body": "Me too!  It only broke because I tried to charge it with a cable from another device when on holiday and the screen went kaput.  But it still played!  It was like a party game trying to remember the menu sequence to change albums.", "score": 5},{"body": "If an item is too big/heavy for a regular envelope it will be placed in a box of sufficient size that it can withstand the processing and transportation through multiple depots and their internal transit systems of [roller belts](http://upload.wikimedia.org/wikipedia/commons/3/3b/Carton_Conveyor.jpg) and [slides](http://www.wired.com/wp-content/uploads/2014/06/20140514-AMAZON-PHOENIX-0319.jpg). As the box will need to be scanned the dimensions must exceed the bar code sticker that is attached to the box with your sender/delivery information. Say you are shipping a box from Buffalo NY to Sacremento CA. The item will generally be sent from a receiving outlet on a box truck to a [central location](http://www.vanderlande.com/upload_mm/2/5/3/5959_fullimage_DP_DHL.jpg) where it is off loaded and processed into the depot. This could be the local depot that would then ship it to a [regional depot](http://images.bwbx.io/cms/2013-09-18/0918_FedEx_Express_630x420.jpg) for processing and sorting. Once in the regional depot it will be separated into land or [air freight](http://static.panoramio.com/photos/large/31886227.jpg) depending upon the service paid. If it is a land delivery it will be sent on an 18 Wheeler/Semi to another regional depot where it will once again be in processed and sent through another series of belts and slides, thrown onto another vehicle to be dropped at the local depot or outlet. Transit by air freight is similar with the difference being re-sorted and weighed for the air cargo number crunchers to generate weights and measurements for the air cargo hauler company to comply with the weights and balances of the aircraft along with other packages being sent as cargo. So along the way it has gone through a local depot, regional depot, Central hub depot, another regional depot and a local depot and finally on to a truck to be delivered to a local outlet for pick up or to be delivered to the receiver address. Each depot has it's own system for routing and handling your package. The reason your box is larger than the small item inside is so that it doesn't cause [logistics issues](https://i.imgur.com/Lu6DWh.jpg) in the chain such as falling between the rollers or not being sufficiently weighted as to keep it stable and easily stackable. So make sure your box is sturdy enough to take the bumps along the way and your product will arrive in one piece. [Schrodinger's Cat](http://i.imgur.com/opvEg.jpg) for simplicity.", "score": 1},{"body": "I'd recommend a Clip+ as it is an excellent device but nowadays you can buy a proper Nokia smartphone for the same money...", "score": 3},{"body": "'Find the saltine'.", "score": 1},{"body": "My local mcdonalds has one, the thing is shit. It blows the air AT YOU at 1,000 kms per hour which does a great job of taking the water off your hands and putting it on your shirt/crotch region.", "score": 1},{"body": "I think you're thinking of Like-Likes.", "score": 4},{"body": "If you look at it long enough, it resembles a puppy.", "score": 0},{"body": "The elevator button are simple mechanical buttons. They text typeface could lead you to believe that they were actually little digital screens.", "score": 1},{"body": "Venti iced caramel macciato. As a starbucks employee, this is hands-down my favorite drink to make. Them layers", "score": -1},{"body": "http://website.informer.com/phpflashcards.com", "score": 1},{"body": "What if this is a clever marketing ploy?", "score": 1},{"body": "It's 2 sided. That is just the other side. ", "score": 2},{"body": "Oh ok", "score": 1},{"body": "only available in XXXL", "score": 1},{"body": "[Here's another shark on the Opel ADAM](http://4.bp.blogspot.com/-u0756mnGuBA/U01mH27xngI/AAAAAAAAHCM/sPJNTVINZ6g/s1600/291020-e.jpg)", "score": 2},{"body": "Someone posted this exact thing a day or two ago. Same title, same picture.", "score": 1},{"body": "I bet it tastes like beets", "score": 1},{"body": "i bet it tastes like beets", "score": 1},{"body": "I saw this on my Facebook newsfeed today! Working at one makes me judge other peoples drinks :p I always cover the cup in caramel when they ask for extra caramel. ", "score": -6},{"body": "Will do, cheers!", "score": 1},{"body": "The shots go on top. It's basically concentrated coffee on top of milk. It's supposed to be for people who like to drink their shots and wash then down with sweet milk but most people who get them just do it cause it looks pretty. ", "score": -2},{"body": "im gonna cum inside you and fuck your ears you dirty whore. oh god im cumming whats your eye color tyell me right now you whore", "score": -7},{"body": "Nice!", "score": 2},{"body": "I agree\n\n/u/20141220 30th day of January, 5th day of the week", "score": 1},{"body": "I literally took this yesterday in Florence, Italy. ", "score": 1},{"body": "/r/pics is more your crowd. ", "score": 0},{"body": "OP: *what do you mean, snow day?*", "score": 1},{"body": "And the added earbuds are really badly photoshopped.", "score": 1},{"body": "That was one link up when this was posted :)\n", "score": 1},{"body": "I'm 28. I'll know I'm a grown up when things like this fail to make me laugh.", "score": 3},{"body": "He is Viggo!\n\nYou are like the buzzing of flies to him!", "score": 1},{"body": "Drainbow", "score": 2},{"body": "IT'S A FUCKING STRAW!!! I couldn't figure that out for the life of mine, thought it was some strange part of the car roof... oh well", "score": 169},{"body": "Fewer holes", "score": -1},{"body": "Try [this](http://www.geek.com/xyzcomputing/mobiblu-dah-1500i-cube-mp3-player-571445/) little guy. I don't know if you can still buy them but there are some decent ones still out there. Rocking it since 2007.", "score": -1},{"body": "How the fuck do you see sexism in here? I was talking about the shapes. God you people are paranoid!", "score": 0},{"body": "Morning Superman.\n\nBrother.", "score": 1},{"body": "Me too. Those things were the shit. ", "score": 1},{"body": "/r/CrappyDesign ", "score": 5},{"body": "The right side has rectangle crackers, the left are square. Which is it?!", "score": 2},{"body": "That looks suspiciously like tubby custard...", "score": 1},{"body": "I'TS A FUCKING CAR ROOF AND A STRAW!!!! I couldnt even work that out. Back to bed I think, today is a write off.", "score": 37},{"body": "The huns were around in the Roman Empire times, more than a thousand years before the Mongol Empire and thousands of miles away from Mongolia.", "score": 6},{"body": "or /r/funny. as it's not that funny they'll love it!", "score": 1},{"body": "The roof of that car needs some elbow grease and wax. ", "score": -2},{"body": "what?", "score": 1},{"body": "You can easily tell it is not.. hence the top of the vehicle on the right hand side..", "score": 6},{"body": "/r/photoshopfail", "score": 1},{"body": "Nobody uses phones with dials, PCs, or regular mail anymore.", "score": -1},{"body": "Research **DOES** cause cancer MORON. Do you not know what a fact is? Apparently, that's also a fact.\n\n\nhint: They GIVE mice cancer to study them. Sheesh. ", "score": -1},{"body": "Nice.", "score": 1},{"body": "No it doesn't", "score": 47},{"body": "/r/hailcorporal", "score": -5},{"body": "Wait, are sansas valuable? Because I have one in my room I never use anymore...", "score": 2},{"body": "This is very mildly interesting.", "score": 1},{"body": "That's because they are different groups. He seems to have confused Attila the Hun and Genghis Khan.", "score": 3},{"body": "Sansa e250 with the Rockbox firmware was my favorite dedicated music player device. They screwed up with the Fuze so much, it didn't even work half the time.", "score": 1},{"body": "\"Fixed that for you\"\n\nDoesn't always mean that they actually fixed something, usually means they changed something as a joke (though sometimes it does get used to make corrections)", "score": 1},{"body": "no, you arent", "score": -7},{"body": "Of course. It's one of the best valued digital audio player out there.", "score": 4},{"body": "RADIO :)", "score": 1},{"body": "I feel your pain.  The worst are the people who staple in places *other* than the top left corner.  I had one guy send in a document where the whole pile (only about 20 pages) was stapled together, but every 2 or 3 pages was also stapled to each other -- sometimes with overlaps!  And then the random staple somehow in the middle of the page...\n\nIf you must clip them together, use a paperclip!", "score": 1},{"body": "*quickly checks value on the internet*\n\nEDIT: 35 bucks used on amazon. Hmm.\n\nEDIT 2: Looks like I can trade it in for a gift card of almost 100 dollars. Hmmmm.\n\nEDIT 3: Aaand it ain't even worth a dollar. crap.", "score": 5},{"body": "Many tape players could record radio.  I don't think it was an issue.", "score": 4},{"body": "word of the day for you:\n\n[pictogram](http://en.wikipedia.org/wiki/Pictogram) - an ideogram that conveys its meaning through its pictorial resemblance to a physical object. ", "score": 1},{"body": "I feel sorry for anyone who's not experienced the full glory that is Japanese or Taiwanese 7-11s. You're really missing out. They're a*maz*ing.", "score": 1},{"body": "#####&amp;#009;\n\n######&amp;#009;\n\n####&amp;#009;\n [**Pictogram**](https://en.wikipedia.org/wiki/Pictogram): [](#sfw) \n\n---\n\n&gt;\n\n&gt;A __pictogram__, also called a __pictogramme__, __pictograph__, or simply *picto*,  and also an '[icon](https://en.wikipedia.org/wiki/Computer_icon)' [*[citation needed](https://en.wikipedia.org/wiki/Wikipedia:Citation_needed)*], is an [ideogram](https://en.wikipedia.org/wiki/Ideogram) that conveys its meaning through its pictorial resemblance to a physical object. Pictographs are often used in writing and graphic systems in which the characters are to a considerable extent pictorial in appearance.\n\n&gt;Pictography is a form of [writing](https://en.wikipedia.org/wiki/Writing) which uses representational, pictorial [drawings](https://en.wikipedia.org/wiki/Drawing), similarly to [cuneiform](https://en.wikipedia.org/wiki/Cuneiform) and, to some extent, [hieroglyphic writing](https://en.wikipedia.org/wiki/Hieroglyphs), which also uses drawings as phonetic letters or [determinative](https://en.wikipedia.org/wiki/Determinative) rhymes. In certain modern use, pictograms participate to a [formal language](https://en.wikipedia.org/wiki/Formal_language) (e.g. [Hazards pictograms](https://en.wikipedia.org/wiki/GHS_hazard_pictograms)).\n\n&gt;====\n\n&gt;[**Image**](https://i.imgur.com/evb75HF.jpg) [^(i)](https://commons.wikimedia.org/wiki/File:Agawa_Rock,_panel_VIII.jpg)\n\n---\n\n^Interesting: [^GHS ^hazard ^pictograms](https://en.wikipedia.org/wiki/GHS_hazard_pictograms) ^| [^Icon ^design](https://en.wikipedia.org/wiki/Icon_design) ^| [^DOT ^pictograms](https://en.wikipedia.org/wiki/DOT_pictograms) ^| [^Stomagram](https://en.wikipedia.org/wiki/Stomagram) \n\n^Parent ^commenter ^can [^toggle ^NSFW](/message/compose?to=autowikibot&amp;subject=AutoWikibot NSFW toggle&amp;message=%2Btoggle-nsfw+co5mpcp) ^or[](#or) [^delete](/message/compose?to=autowikibot&amp;subject=AutoWikibot Deletion&amp;message=%2Bdelete+co5mpcp)^. ^Will ^also ^delete ^on ^comment ^score ^of ^-1 ^or ^less. ^| [^(FAQs)](http://www.np.reddit.com/r/autowikibot/wiki/index) ^| [^Mods](http://www.np.reddit.com/r/autowikibot/comments/1x013o/for_moderators_switches_commands_and_css/) ^| [^Magic ^Words](http://www.np.reddit.com/r/autowikibot/comments/1ux484/ask_wikibot/)", "score": 1},{"body": "This happens if you don't use the same smart object for both.", "score": 1},{"body": "I'm a Cajun and even I would be very hesitant to eat a green Kit-Kat.", "score": 2},{"body": "Given what limited context I can pull from the picture, I wonder if it wasn't an overly understated attempt at showing how the current MP3 player is protected and therefore able to be replaced with a newer or comparable product.", "score": 1},{"body": "&gt; that feature was probably illegal.\n\nTheres nothing illegal about the feature, otherwise dictaphones would be illegal.\n\nIts what you do with it that makes it an offense", "score": 8},{"body": "[deleted]", "score": 1},{"body": "More like chaos... Like an ordinary winter day up here. Just a little bit more snow. ", "score": 1},{"body": "&gt;Recording music from the radio is copyright infringement.\n\n\nBut possession of a device capable to record isn't", "score": 6},{"body": "You smoking SANSA-milla?  hahahaha \n\n\n... I have no friends. ", "score": 6},{"body": "Graphic designer here. Very easy to forget to update that - probably just edited a previous design. Especially when you're working on a project as boring as this one. ", "score": 26},{"body": "If you're using composition layers it can happen, they are tricky when you start going in between them making changes and hiding showing layers. Layer discipline! When you have a comp layer chosen make sure you remember: your last state before clicking away is your final state. Is this what you mean?", "score": 3},{"body": "It's green tea Kit Kat. Very popular in many Asian countries (at least people like to buy a lot of them when they visit Japan) and very delicious. IMO better than the original. I try to get my hands on those every time I get a chance.", "score": 2},{"body": "Aaaaah, that makes two of us.", "score": 5},{"body": "Now that you've mentioned it, there is one song that I've been meaning to search for and today happens to be the day; The Shanghai Restoration Project- Babylon of the Orient. ", "score": 2},{"body": "Oh man, I knew this looked familiar.  It just felt so California to me.  Damn I miss home!!", "score": 0},{"body": "Thanks ", "score": 1},{"body": "It's like a IRL depth-gif.", "score": -2},{"body": "I miss Rayong!", "score": 1},{"body": "OMG https://www.youtube.com/watch?v=G2jUhnCU9iA&amp;spfreload=10", "score": 1},{"body": "Subliminal advertising.\n\nYou don't fully realize, but there is a problem with the photo.  \nYour brain is in a state of conflict or activity trying to determine the problem, while you boringly stand there without any real thought going through your head, but this advert caught your eye for a moment. \n  \nYou never fully task your mind to determine the issue, so most of the time you look away disinterested not even fully realizing that there was something wrong in the photo. Three days later, you still remember the advertisement. \n\nThere is evidence of this concept that everyone can relate to. For example:  \nA guy bakes a cake and leaves his oven on. The oven displays a red light indicating 'ON'.  \nAs he rushes out the door, he sees the red light but thinks nothing of it. This has created conflict in his mind, because he knows something is wrong, he is just too preoccupied with other thoughts.  \nAfter leaving he realizes \"SHIT! I left the oven on\".  \nWhat you need to understand here is how he remembered.  \nIn many cases, he would remember baking, but not turning off the oven.  \nIn other cases he may even ask himself \"did I turn off the oven?\"  \nBut quite frequently it is more like \"I feel like I saw the oven lig- OH SHIT\" and THEN thinking \"did I turn off the oven?\" and THEN thinking \"I remember baking but not turning off the oven\". \n\nI am sure you can apply your own personal examples.\n  \nSubliminal advertising should not be all that common, from what I understand it may even be illegal(in some forms such as flashing in on a screen quickly?) but the point is, it has the potential to work with little backlash. Someone notices? The post it on social media, reddit etc. Even more exposure. People point out subliminal advertising? It was just a photoshop error. Nothing to write congress about. ", "score": 3},{"body": "I left my sansa on top of a cabinet at the gym once. Some fucker stole it. It had recordings of me and my friend talking about how sexy man boobs are, and how we remember 'Nam. Happy birthday to that guy.", "score": 3},{"body": "This thread has been linked to from elsewhere on reddit.\n\n\n - [/r/shitpost] [Look at my cup, isn&amp;#x27;t it great?](http://np.reddit.com/r/shitpost/comments/2u6uhx/look_at_my_cup_isnt_it_great/)\n\n\n*^If ^you ^follow ^any ^of ^the ^above ^links, ^respect ^the ^rules ^of ^reddit ^and ^don't ^vote ^or ^comment. ^Questions? ^Abuse? [^Message ^me ^here.](http://www.reddit.com/message/compose?to=%2Fr%2Fmeta_bot_mailbag)*\n\n", "score": 43},{"body": "If there's a strip mall next to a Wal-Mart there's always on there too. ", "score": 4},{"body": "No way is this the holla one!? \"Just Holla\" is the only part I can remember.", "score": 2},{"body": "My old Creative Zen Photo Sleek could record from it's built in AM/FM radio. God I miss that thing.", "score": 1},{"body": "Thanks,  the comment above mine gave the example of college lectures but have now edited it out, so I was confused as to why it would be illegal, when other devices have this capability.", "score": 1},{"body": "I was a Creative Zen Micro user, but the Sansa was also on the top of my list of purchase. Those MP3 players were amazing for their low prices.", "score": 2},{"body": "Every single strip mall in the U. S. has a Game Stop. ", "score": -2},{"body": "More likely the site has been hacked. It's wordpress and most likely an attacker has used a plugin or theme vulnerability to load up another script that inserts these links on posts. It's just good SEO.", "score": 1},{"body": "Upgrade to the Arya.", "score": 30},{"body": "Vulcanized.", "score": 5},{"body": "I thought we were talking about recording real world audio but other commenters seem to disagree", "score": 1},{"body": "http://imgur.com/65H77kw", "score": 1},{"body": "Well, I'm going to upvote you on the effort alone.", "score": 3},{"body": "It was THOUGHT that would work, that is, until CrazyRussianHacker proved it wrong.", "score": 1},{"body": "Sadly, three. ", "score": 4},{"body": "Haha what", "score": 1},{"body": "It used to be a necklace before all its wishes were used up.", "score": 2},{"body": "[Nokia 5510](http://en.wikipedia.org/wiki/Nokia_5510) had the same feature back in 2001. And if you wanted to copy songs from a CD you didn't have to bother with computer or software or anything, just plug in a 3,5mm cable like any normal headphones and you could record off of a cd player or anything else that has a standard headphone jack. You could even plug it into a TV and record MTV. Shit was cash.", "score": 1},{"body": "#####&amp;#009;\n\n######&amp;#009;\n\n####&amp;#009;\n [**Nokia 5510**](https://en.wikipedia.org/wiki/Nokia%205510): [](#sfw) \n\n---\n\n&gt;\n\n&gt;&gt;\n\n\n&gt;The __[Nokia](https://en.wikipedia.org/wiki/Nokia) 5510__ is a [mobile phone](https://en.wikipedia.org/wiki/Mobile_phone) announced on October 11, 2001.  The Nokia 5510 features a full [QWERTY](https://en.wikipedia.org/wiki/QWERTY) keyboard, an 84 x 48 monochrome display, and is notable for its digital music player. It has a 64 MB memory for storing audio files.\n\n&gt;Its successor is the __[Nokia 3300](https://en.wikipedia.org/wiki/Nokia_3300)__.\n\n&gt;====\n\n&gt;[**Image from article**](https://i.imgur.com/46InJzF.jpg) [^(i)](https://commons.wikimedia.org/wiki/File:NOKIA_5510_blue_topview.jpg)\n\n---\n\n^Interesting: [^Nokia ^3300](https://en.wikipedia.org/wiki/Nokia_3300) ^| [^Space ^Impact](https://en.wikipedia.org/wiki/Space_Impact) ^| [^Predictive ^text](https://en.wikipedia.org/wiki/Predictive_text) ^| [^Advanced ^Audio ^Coding](https://en.wikipedia.org/wiki/Advanced_Audio_Coding) \n\n^Parent ^commenter ^can [^toggle ^NSFW](/message/compose?to=autowikibot&amp;subject=AutoWikibot NSFW toggle&amp;message=%2Btoggle-nsfw+co5n4uk) ^or[](#or) [^delete](/message/compose?to=autowikibot&amp;subject=AutoWikibot Deletion&amp;message=%2Bdelete+co5n4uk)^. ^Will ^also ^delete ^on ^comment ^score ^of ^-1 ^or ^less. ^| [^(FAQs)](http://www.np.reddit.com/r/autowikibot/wiki/index) ^| [^Mods](http://www.np.reddit.com/r/autowikibot/comments/1x013o/for_moderators_switches_commands_and_css/) ^| [^Magic ^Words](http://www.np.reddit.com/r/autowikibot/comments/1ux484/ask_wikibot/)", "score": 2},{"body": "Dibs on the album name for my thrashcore band. on a related note, anyone want to join a thrashcore band? ", "score": 1},{"body": "/r/mildlyinfuriating ", "score": 1},{"body": "Nose appears intact, try making wishes OP.", "score": 1},{"body": "I try... but alas, I am nothing but a boiled egg expert. ", "score": 1},{"body": "They learned from the Gaming Industry.", "score": 1},{"body": "I miss my parents.", "score": 5},{"body": "So..a picture of a cup on the roof of a car? Next.", "score": 5},{"body": "I had one of these when I was a freshman in high school. It lasted me for so long. I lost one day when I was dragging mulch into our woods. My dad found it not too long ago. I kind of wish it would have turned on.", "score": 2},{"body": "I was like 'Do you even smart object??'", "score": 5},{"body": "e205, compared to 2.059, which for money rounds up to 2.06?", "score": 1},{"body": "I can fap to that", "score": 1},{"body": "Hmm just be honest you were searching that dick.", "score": -1},{"body": "I had one as well! Super simple to use, and worked great for people that couldn't afford iPods lol", "score": 1},{"body": "There's the Fuze which is pretty much a newer e200 without the replaceable battery. Rockbox compatible.", "score": 1},{"body": "I still use my Fuze daily. I've had it for years, and (except for diminished battery life) it still works great. It even survived getting smacked with a 50lb dumbbell when I forgot which pocket I had it in at the gym. \n\nI don't know what I'm going to do when the battery finally gives out. I'm going to be so sad. I had a Clip+ for a while, but the sound quality and battery life weren't nearly as good. Maybe I'll get lucky and find another one in good shape on ebay or swappa, or something.  ", "score": 1},{"body": "I enjoyed your comment. Have an up arrow", "score": 3},{"body": "There's a stark difference between the two", "score": 32},{"body": "Back in 2007 all MP3 players were durable, heck, I had one that went through the washing machine at least once and it still survived", "score": 1},{"body": "Even so, that earphone was terribly cropped. ", "score": 3},{"body": "Another thing you can do with wooden spoons is check if your frying oil is ready. If the oil sorta bubbles around the spoon then it's ready. ", "score": 2},{"body": "No. No it doesn't. It just looks like a cup and a straw on the roof of a car.", "score": 15},{"body": "Ear bud has no reflection.", "score": 1},{"body": "I found Pepsi brown in America.", "score": 4},{"body": "Wow, that's really interesting, i never saw this before o_o", "score": 0},{"body": "Facebank -&gt; Roofbank", "score": 1},{"body": "Plus the carbonation could help upset stomachs. \n\nI learned something from Doc Hollywood after all. ", "score": 1},{"body": "Graphic Designer here. Can also confirm.\n\nI worked for a wine company and had to add reflections like these to at least 1000 wine bottles when I first started.", "score": 3},{"body": "I used to have a Creative Vision Zen: M, now I have the Cowon x9:\n\nhttp://static.trustedreviews.com/94/000024bed/21e3/Cowon-x7-1.jpg\n\nI don't particular like iPods, so it's nice to see another MP3 company.", "score": 1},{"body": "Seems like it", "score": 1},{"body": "I had one of these bad boys with Rockbox installed. It was awesome! The first time I player Pokémon yellow was on this lol", "score": 1},{"body": "That is not, by definition, a new app. It is a newly updated app. ", "score": 1},{"body": "Omg that sounds good!", "score": 2},{"body": "Shouldn't it be like automatic reflection effect thing? ", "score": 4},{"body": "I want to see the picture taken 5 secs after this picture. ", "score": 3},{"body": "Nagilum.jpg", "score": 1},{"body": "Sorry, I was never a huge fan of Star Trek.", "score": 1},{"body": "I confirm! It is REALLY good! ", "score": 2},{"body": "Fake Chinese products, they can't even reflect right", "score": 2},{"body": "I think it's funny. :)", "score": 1},{"body": "The ad's quote \"need to be aware of your surroundings\" makes me believe that it wasnt a mistake.", "score": 1},{"body": "If you mean how do you make the reflection, it's super easy. It's not a new idea but Apple made that \"look\" popular with the iPhone.\n\nYou take your original image of whatever object, make a copy, flip it vertically so it's upside down, move it so that the 2 images are touching at the bottom. Then give the bottom one a transparency fade and reduce it's overall transparency a bit.", "score": 3},{"body": "Not only is the player improperly reflected in the graphic but there appears to be a faint reflection of a man with his tail out. ", "score": 1},{"body": "I was more annoyed by \"expresso\".", "score": 1},{"body": "\"Why the fuck would the trim between the roof and the rear window be *white*? That's just weird...\"    \n\nPretty much same thing going through my mind. Trying to figure out what part of the car that was to make that happen, or how shitty of a parking job went down to orient it that way, and was absolutely lost.", "score": 3},{"body": "Ghost embrio. ", "score": 2},{"body": "Noooooo.", "score": 2},{"body": "I enjoyed both of your comments. Both of you, have an up arrow.", "score": 2},{"body": "Man that sub reddit is salty", "score": 39},{"body": "It works about 90% of the time.", "score": 2},{"body": "Yeah, my little fingers can only get into sansa", "score": 5},{"body": "That's creepy.", "score": 1},{"body": "Also you don't listen to CDs with an MP3 player.", "score": 1},{"body": "http://i.imgur.com/mgZqjH8.gif", "score": 3},{"body": "Fourth, including me :/", "score": 2},{"body": "I believe that it may be intentional on their part to tie in with \"..you need to be aware of your surroundings.\" As in suggesting that if you weren't, you would've missed that and that if you were, you would come to a realization of how true the ad to be. ", "score": 1},{"body": "On the highway I lost my Sansa under the passenger seat while changing Alayne.", "score": 2},{"body": "Posted 20 minutes before you with over 30 votes of a difference.\n\nhttp://puu.sh/feoLh/a95d060894.png\n\nWhat the hell mildlyinterestingers?!/1", "score": -13},{"body": "http://vimeo.com/74350920", "score": 1},{"body": "My Creative Zen Nano Plus from ~2006 had audio in and could record radio. Don't know if it's older than this one or not though.", "score": 1},{"body": "/r/hailcorporate", "score": 9},{"body": "I've barely ever touched smart objects. Am I missing out on a world of efficiency?", "score": 1},{"body": "Just read an article that says that Marmite turns white when tapped or whipped and thought it mildly interesting.\n\nFound some Science from http://www.madsci.org/posts/archives/1998-05/893874671.Ch.r.html\n\n\"Seriously, though, this is an example of quite a general phenomenon. And curiosity driven experimentation and observation is a GOOD THING, even when it involves playing with your food.\n\nHave you looked at a lump of rosin that a violinist uses to prepare the bow? It is a block of yellow or orange material. But where the violinist has rubbed the bowstrings along it, it looks white. And the powder it produces definitely looks white. This is another example of essentially the same phenomenon.\n\nMarmite is a material that has visco-elastic flow properties, somewhere between a viscous liquid and a soft gel. When you pat the surface repeatedly with a spoon, what you are doing is generally roughening up the surface into a tangle of microscopic peaks and valleys. Some marmite adheres to the spoon, and is lifted into a sharp peak as the spoon is withdrawn. Because the material is not truly liquid, the peak stays there.\n\nOptically, marmite (as usually encountered with a smooth surface) is an indescribable brownish-black colour with a significant surface lustre. It can look quite shiny. What this means is that the light which reaches our eyes from a sample of marmite has travelled through a fair amount of light \nabsorbing material before we get a little bit of it reflected back (the brownish-black colour that we see). \n\nBut is also means that a small but significant proportion of the light -- perhaps 10 to 15% -- is reflected directly back from the surface (the lustrous or shiny appearance). When we roughen the surface, we increase the amount of that surface reflection, and we change things so that the reflection will be a diffuse one from several surfaces rather than a direct one. The result is that the material looks \nwhite, because most of the light we see coming from it has been reflected off its front surface in a diffuse way, without ever penetrating deeply into the material where it can be absorbed.\"", "score": 1},{"body": "That's a picture of a cup on top of a black car, so no it doesn't.\n", "score": 4},{"body": "Nope. This effect is achieved by actual copy and paste. The way I make it look like a reflection is by setting the opacity to about 50% then using a large 0% hardness eraser to make the fading effect. ", "score": 2},{"body": "Four it is then.", "score": 1},{"body": "And then /r/wtf after somebody tries to use this jankie ass creation. ", "score": 1},{"body": "This thread has been linked to from elsewhere on reddit.\n\n\n - [/r/explain_undelete] [\\[#46|+2341|86\\] The reflection of the MP3 player in this ad is the wrong device \\[/r/mildlyinteresting\\]](http://np.reddit.com/r/explain_undelete/comments/2u6z22/46234186_the_reflection_of_the_mp3_player_in_this/)\n\n\n*^If ^you ^follow ^any ^of ^the ^above ^links, ^respect ^the ^rules ^of ^reddit ^and ^don't ^vote ^or ^comment. ^Questions? ^Abuse? [^Message ^me ^here.](http://www.reddit.com/message/compose?to=%2Fr%2Fmeta_bot_mailbag)*\n\n", "score": 1},{"body": "[terrible old school website I found with info on this and other strange eggs](http://www.poultryhelp.com/oddeggs.html) ", "score": 7},{"body": "No variations of coca cola have have cocaine since 1929. The mexican coke tastes better because it uses real sugar.", "score": 1},{"body": "Don't you mean  increase transparency? Or reduce opacity?", "score": 2},{"body": "&gt;embryo", "score": 1},{"body": "Wasn't profitable bc it was too durable? :)", "score": 1},{"body": "/r/mildlyinfuriating\n\nyou done got ripped off. they owe you one nom.", "score": 0},{"body": "Ok so it works for gloves..  but ow the hell am I going to wash/dry the rest of my wardrobe ?", "score": 1},{"body": "So basically, Bill Clinton is saying \"Yes, she'll run, and I want to be called Adam the First Man\"???", "score": 1},{"body": "No shameless advertising here...", "score": 9},{"body": "You're right of course, I mixed up huns and Genghis. Thanks!", "score": 1},{"body": "Generally just a gradient mask even.", "score": 1},{"body": "Wait, what? You have dishes on top of your tower next to your keyboard? ", "score": 1},{"body": "Oh yeah!!", "score": 1},{"body": "Everyone loves a slinky, you're gonna get a slinky, slinky, slinky, GO SLINKY GO!", "score": 1},{"body": "A \"fart egg\" eh?  ", "score": 2},{"body": "We have one next to a caribou, does that count? ", "score": 1},{"body": "A cholesterol-free egg?  That's all white with me!", "score": 14},{"body": "I know that, I was just making a joke because of Mexico's reputation for cocaine.", "score": 1},{"body": "Am I the only one who thinks that the drink looks unappetizing?", "score": 8},{"body": "Finding all the Pepsi colors in Japan is not hard, all you have to do is go to family Mart or 7i", "score": 1},{"body": "/r/Hailfuhrer ", "score": 3},{"body": "Why does that parking lot look so familiar..", "score": 0},{"body": "http://i.imgur.com/wGi8eMl.jpg", "score": 1},{"body": "I know where this is - I am SO happy.", "score": 1},{"body": "Previous Watford girl. This is interesting.", "score": 1},{"body": "Ummm why are \"gayest\" and \"sexiest\" mutually exclusive? Trigger warning, please?! /s/", "score": 1},{"body": "Everytime I walk into a starbucks and just ask for a regular black coffee I get weird looks from people behind the counter. ", "score": -1},{"body": "Yeah... sometimes I wonder why those types of subreddits are even allowed.", "score": -20},{"body": "Iron deficiency and pica", "score": 1},{"body": "I used to do gradient mask but I find the eraser works just as well, gives more control, and is quicker.", "score": 2},{"body": "I hate when the caramel drips like that on the inside, i always think my fingers are gonna stick to it.", "score": 0},{"body": "Forced perspective is interesting!", "score": -1},{"body": "Now try the same thing with the wire unrolled.", "score": 1},{"body": "Yes, because if you want top karma, you post things to /r/mildlyinteresting .  Damn that Starbucks / GameStop conglomerate!", "score": 2},{"body": "Looks like the coffee's worth more than the car it's on.", "score": 1},{"body": "/r/misleadingthumbnails", "score": 0},{"body": "I have a Clip+ and it's great.  I tried rockbox and hated it, the stock interface is just perfect in my opinion.", "score": 1},{"body": "Yeah, seeing a Starbucks logo on reddit totally convinced me to buy drinks there forever.", "score": 21},{"body": "Saw that shit at Daiei today.", "score": 1},{"body": "reminds me of this : https://www.youtube.com/watch?v=7xG2GQ20P54", "score": 0},{"body": "/r/HailCorporate ", "score": 0},{"body": "Yup, that's the one. So much frustration over the years on finding it. ", "score": 1},{"body": "Make it six.  I've been putting on some weight for my winter hibernation.", "score": 1},{"body": "poor molested coffee.  ", "score": -1},{"body": "that's what she said", "score": 3},{"body": "/r/praisehelix", "score": 1},{"body": "\"Do you even know what a write off is?\" \"Yeah, you just write it off!\"", "score": 8},{"body": "It made the front page and that is /r/mildlyinteresting", "score": 1},{"body": "Congratulations!\n\n&amp;nbsp;\n\nIt seems like you have discovered a very rare type of egg!\n\nI would be very mad if I was trying to make scrambled eggs though.\n\n&amp;nbsp;\n\n\nRegards,\n\nOfficialEgg\n", "score": 37},{"body": "Alternate title:\n\nThis banana is really big.", "score": 4},{"body": "My egg had no egg!\n\n*Insert picture of egg shell halves next to empty pan*", "score": 1},{"body": "So, on one of those computer doohickeys?", "score": 1},{"body": "Stop it Michael!", "score": 2},{"body": "I'm sorry I thought you reposted my pic from a month or two ago", "score": 1},{"body": "you want some coffee with that milk?\n", "score": -1},{"body": "This might be the most inappropriate misuse of the word \"they're\" I have ever witnessed", "score": 1},{"body": "It's not about karma. It's about [Content marketing](http://en.wikipedia.org/wiki/Content_marketing) a form of [Native advertising](http://en.wikipedia.org/wiki/Native_advertising) ", "score": 1},{"body": "The Starbucks is right next to Game Stop. This is the area with Home Depot/Walmart/Vons/CVS like OP said off Palm in IB right off the 5.", "score": 3},{"body": "caramel mach?", "score": 0},{"body": "You must be yolking... Thats eggcatly what happened me 2 days ago.", "score": -2},{"body": "And that is how alphabet soup is made.", "score": 3},{"body": "On the one hand, it seems logical. Green is safe, red is danger.\n\nOn the other hand... we all kind of got used to green being on and red being off. So it can also cause some confusion I guess.", "score": 3},{"body": "Yes. Pretty much, when you use a smart object, you place a bounding box into the PSD that is tied to another file. So, it'll appear like you're placing the file on the document, but if you edit the original, the changes will show up in the PSD. In this example, they could have used two smart objects, one for the main picture, another for the reflection, and tied it to a picture of the player. And when the new model came out, just name the new picture like the old one, and place it into the directory, and the ad would've updated without the reflection being wrong.\n\nEDIT: I forgot to add, you can put effects onto a smart object, like the reflection's fading, so that it still would've had that fade out effect.", "score": 1},{"body": "Oh great placement, let me just stand here, out in the cold, for an hour as my phone charges.\n\nOr running back after a meeting to grab your phone that is probably a few buildings away.", "score": 1},{"body": "how high are you? I can't see any butts", "score": 1},{"body": "How does shit like this get to the front page?  It doesn't look like that at all, OP.  Shitpost.", "score": 5},{"body": "Those Starbucks sizes are getting ridiculous.", "score": 0},{"body": "could be worst, could be sewage ", "score": 1},{"body": "I know that feel bro", "score": -3},{"body": "Yep!     \nLetter farming isnt easy, but its honest work.", "score": 2},{"body": "I was going to laugh, but it's not a yolk.", "score": 2},{"body": "Because we're allowed to having differing opinions on here. ", "score": 18},{"body": "You conspiracy weirdos are out in full force today. Yes, he joined three years ago and made thousands of posts all over so he could post a mildly interesting picture of a Starbucks cup. ", "score": 9},{"body": "No shit, but without that sweet sweet karma, you won't get to the top.\n\nAlso, need to buy things at CVS next time I remember.", "score": 1},{"body": "Personally I don't believe people should be allowed to be assholes.", "score": -19},{"body": "Will you be seeking out more egg-related posts? Please continue this novelty account, I have subscribed. ", "score": 8},{"body": "Bum nut", "score": 1},{"body": "Omg is this in Santee?", "score": 0},{"body": "I hope you don't need this warning, OP, but don't eat those potatoes! Once they go into sprouting mode, potatoes show off their nightshade heritage and produce a lot of [solanine](http://en.m.wikipedia.org/wiki/Solanine), a nerve toxin and cytotoxin. You'll be lucky if you get away with just nausea, vomiting, and diarrhea.", "score": 1},{"body": "You may have just killed the first cholesterol free chicken. ", "score": 3},{"body": "That will depend on whether or not people find me to be eggy.", "score": 10},{"body": "[You know what they say...](http://youtu.be/gNdcl_Tm99E)", "score": 1},{"body": "Doesn't that make you am asshole?", "score": 18},{"body": "#####&amp;#009;\n\n######&amp;#009;\n\n####&amp;#009;\n [**Solanine**](https://en.wikipedia.org/wiki/Solanine): [](#sfw) \n\n---\n\n&gt;__Solanine__ is a [glycoalkaloid](https://en.wikipedia.org/wiki/Glycoalkaloid) [poison](https://en.wikipedia.org/wiki/Poison) found in species of the [nightshade](https://en.wikipedia.org/wiki/Solanum) family ([Solanaceae](https://en.wikipedia.org/wiki/Solanaceae)), such as the [potato](https://en.wikipedia.org/wiki/Potato) (*Solanum tuberosum*) and the [tomato](https://en.wikipedia.org/wiki/Tomato) (*Solanum lycopersicum*). It can occur naturally in any part of the plant, including the [leaves](https://en.wikipedia.org/wiki/Leaf), [fruit](https://en.wikipedia.org/wiki/Fruit), and [tubers](https://en.wikipedia.org/wiki/Tuber). Solanine has [fungicidal](https://en.wikipedia.org/wiki/Fungicide) and [pesticidal](https://en.wikipedia.org/wiki/Pesticide) properties, and it is one of the plant's [natural defenses](https://en.wikipedia.org/wiki/Plant_defense_against_herbivory). Solanine was first isolated in 1820 from the [berries](https://en.wikipedia.org/wiki/Berry) of the European black nightshade (*[Solanum nigrum](https://en.wikipedia.org/wiki/Solanum_nigrum)*), after which it was named. \n\n&gt;====\n\n&gt;[**Image**](https://i.imgur.com/JNcnqz2.png) [^(i)](https://commons.wikimedia.org/wiki/File:Solanine.svg)\n\n---\n\n^Interesting: [^Solanidine](https://en.wikipedia.org/wiki/Solanidine) ^| [^Glycoalkaloid](https://en.wikipedia.org/wiki/Glycoalkaloid) ^| [^Solanum ^jamesii](https://en.wikipedia.org/wiki/Solanum_jamesii) ^| [^Potato](https://en.wikipedia.org/wiki/Potato) \n\n^Parent ^commenter ^can [^toggle ^NSFW](/message/compose?to=autowikibot&amp;subject=AutoWikibot NSFW toggle&amp;message=%2Btoggle-nsfw+co5oxen) ^or[](#or) [^delete](/message/compose?to=autowikibot&amp;subject=AutoWikibot Deletion&amp;message=%2Bdelete+co5oxen)^. ^Will ^also ^delete ^on ^comment ^score ^of ^-1 ^or ^less. ^| [^(FAQs)](http://www.np.reddit.com/r/autowikibot/wiki/index) ^| [^Mods](http://www.np.reddit.com/r/autowikibot/comments/1x013o/for_moderators_switches_commands_and_css/) ^| [^Magic ^Words](http://www.np.reddit.com/r/autowikibot/comments/1ux484/ask_wikibot/)", "score": 1},{"body": "The seventh seal has been broken and the apocalypse is nigh. ", "score": 4},{"body": "Yeah? Well your mother is a whore", "score": 7},{"body": "Here in Brazil we have pink guaraná called [Jesus](http://www.nerdsviajantes.com/wp-content/uploads/2012/07/IMG_9923.jpg).", "score": 1},{"body": "A liquor store next to a Gamestop? What is this place, heaven?", "score": 0},{"body": "You must be yolking!? Sorry but I don't mean to eggaggerate my eggcitement.  ", "score": -2},{"body": "Am I the only that thinks the shape of the bottle is attractive? Hey oh!", "score": 1},{"body": "Thats no yolk!\n", "score": 0},{"body": "OP did you buy a game from GameStop?", "score": 0},{"body": "happy birthday.", "score": 1},{"body": "I remember that! Although I still miss Crystal Pepsi, Surge, and Coca Cola C2.", "score": 1},{"body": "Ha yeah I can see that but I doubt that's what it really is since it belongs to his gf and she's never watched or played a pokemon in her life", "score": 1},{"body": "reddit meetup? lmao", "score": 1},{"body": "What is this, a Gamestop for ANTS?", "score": -1},{"body": "nice optical illusion", "score": -1},{"body": "Wait...soda-emporium.com is a thing?! Saving as a favorite site momentarily.", "score": 1},{"body": "I, for one, am wholeheartedly egging you on.  ", "score": 4},{"body": "what I only see is Gamestop : D", "score": 0},{"body": "[Haha!](https://1cyjknyddcx62agyb002-c74projects.s3.amazonaws.com/files/2014/01/LaughingCat.jpeg)", "score": 5},{"body": "No it doesn't....", "score": 2},{"body": "You've gotta be yolking me.", "score": 0},{"body": "Ooooh is tht why old potatoes have that \"earthy\" taste? ", "score": 1},{"body": "What's with the deck? I'm pretty sure i bought that same one from canadian tire 3 years ago for my 240sx. Could Lamborghini not afford an inhouse development?", "score": 1},{"body": "And that's no yolk.", "score": 0},{"body": "Anybody else have a craving for Starbucks now?\n\nFuck you subtle advertising. Also fuck the person who took this picture for blatantly displaying the Starcrack logo like that. ", "score": 0},{"body": "No, it doesn't. It looks like a close up of cup and straw on top of a car. ", "score": 2},{"body": "What does no cholesterol &amp; fat per serving mean? Is the serving size so small that the fat and cholesterol content is beneath a certain threshold? As I see it, if there is no cholesterol or fat in a single serving, there shouldn't be any if you eat the whole damn package.", "score": 1},{"body": "Maybe he shoulda cooked it longer so it wouldn't be so rare.\n\n*tsssssssss*", "score": 1},{"body": "this sometimes happens in my bathroom when I take a bubble bath :/", "score": 1},{"body": "No, not really", "score": 3},{"body": "Can someone explain this for me? I seem unable to figure how the photo is taken?!", "score": -1},{"body": "TIL heaven is a pretty standard strip  mall", "score": 0},{"body": "Dont make this a thing", "score": 2},{"body": "So much hate.", "score": -2},{"body": "Tell me about it. Bunch of assholes.", "score": 5},{"body": "Yeah I try this every time I cook pasta and it rarely works ", "score": 1},{"body": "/r/SplitDepthPictures", "score": 0},{"body": ".... Trebek.", "score": 4},{"body": "As someone who proofreads advertising, this is my nightmare.", "score": 1},{"body": "\"Coffee\"", "score": -3},{"body": "There's a ginger soul in the egg next to that one.", "score": 1},{"body": "I dont understand, where is the car?", "score": 1},{"body": "Rave candy!", "score": 1},{"body": "Foam octopus living in your drain.", "score": 1},{"body": "All you got was the roosters dead sperm ", "score": 1},{"body": "Is 7i their version of 7-eleven? I had thought 7-eleven was international", "score": 1},{"body": "Not really, the background is a bit too blurry, thus making it obvious that the cup is simply in the foreground, and the shops are far behind it. Check out [forced perspective.] ( http://en.wikipedia.org/wiki/Forced_perspective)", "score": 3},{"body": "fucking savages in this ~~town~~ sub-reddit", "score": 2},{"body": "#####&amp;#009;\n\n######&amp;#009;\n\n####&amp;#009;\n [**Forced perspective**](https://en.wikipedia.org/wiki/Forced%20perspective): [](#sfw) \n\n---\n\n&gt;\n\n&gt;__Forced perspective__ is a technique that employs [optical illusion](https://en.wikipedia.org/wiki/Optical_illusion) to make an object appear farther away, closer, larger or smaller than it actually is. It is used primarily in [photography](https://en.wikipedia.org/wiki/Photography), [filmmaking](https://en.wikipedia.org/wiki/Filmmaking) and [architecture](https://en.wikipedia.org/wiki/Architecture). It manipulates [human](https://en.wikipedia.org/wiki/Human) [visual perception](https://en.wikipedia.org/wiki/Visual_perception) through the use of scaled objects and the correlation between them and the vantage point of the spectator or camera.\n\n&gt;====\n\n&gt;[**Image**](https://i.imgur.com/SFEpSIr.jpg) [^(i)](https://commons.wikimedia.org/wiki/File:Fairway-Rock-mil-atop.jpg) - *Unintentional forced perspective effect in this U.S. Navy photograph. The CH-47 Chinook helicopter at left is more than eighteen feet \\(5.4m\\) tall and almost one hundred feet \\(30.5m\\) long.*\n\n---\n\n^Interesting: [^Forced ^Perspective ^\\(Fringe)](https://en.wikipedia.org/wiki/Forced_Perspective_\\(Fringe\\)) ^| [^Hanging ^miniature](https://en.wikipedia.org/wiki/Hanging_miniature) ^| [^In-camera ^effect](https://en.wikipedia.org/wiki/In-camera_effect) ^| [^Trompe-l'œil](https://en.wikipedia.org/wiki/Trompe-l%27%C5%93il) \n\n^Parent ^commenter ^can [^toggle ^NSFW](/message/compose?to=autowikibot&amp;subject=AutoWikibot NSFW toggle&amp;message=%2Btoggle-nsfw+co5pgol) ^or[](#or) [^delete](/message/compose?to=autowikibot&amp;subject=AutoWikibot Deletion&amp;message=%2Bdelete+co5pgol)^. ^Will ^also ^delete ^on ^comment ^score ^of ^-1 ^or ^less. ^| [^(FAQs)](http://www.np.reddit.com/r/autowikibot/wiki/index) ^| [^Mods](http://www.np.reddit.com/r/autowikibot/comments/1x013o/for_moderators_switches_commands_and_css/) ^| [^Magic ^Words](http://www.np.reddit.com/r/autowikibot/comments/1ux484/ask_wikibot/)", "score": 2},{"body": "Yo dog, I heard you liked spoons, so I got you a spoon to spoon your spoon", "score": 1},{"body": "Under the cup", "score": 4},{"body": "Now it's worth 49.8", "score": 1},{"body": "Well, if the chicken was raped it's body has a way of shutting the whole thing down. Resulting in no yolk. Source - I'm from Alabama.", "score": 0},{"body": "Marketing and Branding don't exist to sell products.", "score": 6},{"body": "I knew as soon as I saw the thumbnail that hailcorporate would have a shitfit. It is a shameless corporate shitpost though.", "score": 2},{"body": "Thanks for advertising starbucks to me...", "score": -1},{"body": "They have cooler stuff than we do. I want to try a wasabi kit kat.\n\nMy mum brought back a willy wonka chocolate bar, but it was too much, we couldn't eat it. Had way too much going on. And something peppery, but who knows, we can't read anything other than Willy Wonka.", "score": 1},{"body": "Actually, that is a giant cup!\n", "score": 0},{"body": "This is like a 100% less disgusting version of the cumbox.", "score": 1},{"body": "....this is shit. wasn't fooled for a second.", "score": 3},{"body": "No it's not. It's grape.", "score": 2},{"body": "[Reference](https://www.youtube.com/watch?v=UayQTu2kH-U)", "score": 1},{"body": "weird it says my birthday is today, too.. the cake is a lie", "score": 1},{"body": "At first I thought it was Peter Pan flying and Peter Pan telling Wendy she can't go to Neverland.", "score": 1},{"body": "every basic girl's dream: to swim in a giant cup of Starbucks ", "score": 0},{"body": "It doesn't say purple anywhere", "score": 0},{"body": ":O it's times like this that it's hard to be Canadian", "score": 1},{"body": "/r/yolkfree", "score": 1},{"body": "Actually 7 Eleven is a Japanese owned company", "score": 1},{"body": "If I were in advertizing I'd just reach out to accounts with a benign posting history and offer them X amount for a one off posting. \n\nThat way you always have a different accounts with actual post histories posting your marketing and it'd be very hard for reddit to track or do anything about. \n\nNow this may just be an innocent post that happens to frame a corporate logo dead center. But you cannot tell me that advertizes are not spending time and money looking to crack social media in ways that don't instantly scream 'I'm an advert' . ", "score": 0},{"body": "EXACTLY. I was like how does this have this many upvotes?!?", "score": 3},{"body": "When I scroll down this website, it hurts my brain. ", "score": 2},{"body": "A reference to this, [dave chapelle stand-up](https://www.youtube.com/watch?v=UayQTu2kH-U) \n\nDo you have a title change suggestion, then?", "score": 1},{"body": "Almost good enough for /r/oddlysatisfying", "score": 1},{"body": "I love how this was taken in Sherman oaks CA", "score": 1},{"body": "Just emphasizing that the title says one thing but the image shows another, and that there is no reconciliation provided, but only more confusion.", "score": 1},{"body": "Well, we had a green cat appear on the streets. http://www.moreto.net/im/45051.w470.jpg\nhttp://i.actualno.com/actualno_2013/upload/news/2014/12/07/0695065001417941975_444866_600x458_actualno.jpg\n\nNo photoshop :)", "score": 1},{"body": "What's the point of the /r/hailcorprate bullshit? We're not allowed to show logos of companies? Do people from that sub believe when a logo is shown its actually an advertisement planted by that company?", "score": 6},{"body": "No. This just isn't interesting or funny in any way at all. Scrap it. Start over.", "score": 0},{"body": "Imperial beach", "score": 1},{"body": "3eggy5me", "score": 3},{"body": "Best post so far in the thread.", "score": 1},{"body": "It looks like a giant cup of diabetes to me", "score": 1},{"body": "You're a real dick.", "score": 2},{"body": "I guess the yolk's on you!", "score": 1},{"body": "Same here.  There are lots of interesting suggestions I'd like to try, but I'll have to wait 5 years before that happens again!  It happened twice last year - that was freaky.", "score": 1},{"body": "What it looks like is obesity", "score": 1},{"body": "No can label ever does. \n\nHow are you just finding this out now? ", "score": 1},{"body": "Added to the list!", "score": 3},{"body": "Holy shit this is amazing. What kind of photography technique would you name this? \n\nAlso what Camera? Lens?", "score": 0},{"body": "I know where you live ._.!", "score": 1},{"body": "This looks like florence KY. Is this florence KY?", "score": 1},{"body": "Who gives a shit? Oh, I better cover up the logo so people don't think it's an advertisement.", "score": 1},{"body": "Please think of the paint on your car!!", "score": 1},{"body": "dumbest post of all-time.", "score": 2},{"body": "Had it always been or was it bought?", "score": 1},{"body": "shortly after a viral circulation of the water bottle yolk removal pro tip.............not buying it.", "score": -1},{"body": "I don't think the person that posted that understands this subreddit.", "score": 4},{"body": "Venti caramel Mochiato.....delicious!", "score": 1},{"body": "the GMO's have gone too far!!!", "score": 0},{"body": "Then why do you keep voting for them?", "score": 0},{"body": "Mmm iced caramel macchiato. Fucking delicious.", "score": 1},{"body": "It looks like 1000 calories to me.", "score": 1},{"body": "It's a strip mall with a CVS Pharmacy that happens to sell liquor next to a GameStop.\n\nOh and it's apparently a conspiracy to advertise because you can see logos...ugh.", "score": 1},{"body": "Thats how you get pinkeye", "score": 1},{"body": "You know you can buy established reddit accounts right?", "score": 1},{"body": "The person who took this photo.must do the angles of photography for porn to make the dicks look huge.", "score": 1},{"body": "I hope he is for real and isnt playing some sort of sick yolk on us.", "score": 3},{"body": "Caffeine sells itself.", "score": 1},{"body": "WHAT.", "score": 1},{"body": "And for good reason too.", "score": 1},{"body": "Weird, I cracked an egg today with TWO yolks!!", "score": 1},{"body": "Redditor for one hour? Get the fuck out of here.", "score": 1},{"body": "Some of them do. A lot of the people there work in the industry and recognise marketing schtick when they see it.", "score": 4},{"body": "No, actually it looks exactly like a free advertisement for Starbucks. \n\nBuy ad space like everyone else. ", "score": 1},{"body": "Go fry an egg!", "score": 1},{"body": "How do we know you just didn't buy egg whites?", "score": 2},{"body": "Reminds me of a scene in an old movie: The Abyss", "score": 1},{"body": "You're the man", "score": 1},{"body": "/r/karmaconspiracy", "score": 1},{"body": "Yeah I know. ", "score": 1},{"body": "I believe that 7-11 of Japan bought out the main company", "score": 1},{"body": "These jokes are really cracking me up ", "score": 1},{"body": "It is a facade. There is no wider angle, this is super common in oldrr downtown areas of america. Its a false front", "score": 1},{"body": "People will buy old reddit accounts. More for age and karma/link karma.\n\nIt's also very easy to fake active post history on many accounts simultanously.\n\nThere is a company working now to automate reddit (and other) personas using natural language processing and self-learning from similar posts. Interesting stuff.", "score": 2},{"body": "It looks like a giant cup either way. That's gotta be a thousand calories.", "score": 1},{"body": "You're an idiot if you think companies aren't using Reddit for viral marketing. A lot of the time people say /r/hailcorporate in a joking manner, but it definitely happens. Getting a post to the front page is probably some of the best free advertising you can ask for.", "score": 3},{"body": "Isn't there that one illusion that schizophrenic people can't see? That one with the inverted face?\n\nAnyway, i think you may have some sort of mental illness, possibly one deals with straws.", "score": 3},{"body": "Eggsactly.", "score": 1},{"body": "I can see the yolk sitting in the bottom shell in your hand.", "score": 1},{"body": "Hey, they gotta start somewhere.", "score": 1},{"body": "Uhh....okay...? ", "score": 1},{"body": "IT EXISTS.", "score": 1},{"body": "OMG those GMO's. ", "score": 1},{"body": "It's kinda like circlebroke. It's just people who think that they're above Reddit when, in reality, they're the same except they lack self awareness. ", "score": 2},{"body": "We are using a Chromecast. We opted to not have cable when we moved in over a year ago so this is our primary entertainment device, and I must say it has been amazing. Netflix, YouTube, Google Play Movies and various other Chromecast apps have been more than enough, and we get some channels over the air via our antenna.", "score": 1},{"body": "I don't know...  it looks more like a gigantesco iced caramel macchiato, extra caramel. ", "score": 1},{"body": "That's Starbucks' new 'porketta' size cup.", "score": 1},{"body": "I'm also thinking a way of doing it would be to process the new queue with an OCR type program that just looks for your companies logo then send that link out to bot accounts that upvote it (you'd stagger these upvotes and have them come from different IP's so not to trigger any anti spam software reddit has) \n\nThat way you just make sure that 'real' content gets to the top happens to be the one with your logo on them. ", "score": 1},{"body": "i guess this makes up the countless eggs i've used that have had double yolks.", "score": 1},{"body": "Yes it doesn't.", "score": 1},{"body": "This is clearly the switch to a killing machine. ", "score": 1},{"body": ":-) ok that made me smile. You had ruined my morning, somehow. I don't know why I let you get to me. I felt really stupid. ", "score": 1},{"body": "2eggy4me !!", "score": 1},{"body": "Stop being so chicken. ", "score": 1},{"body": "Guess it ended up in one of those eggs that have 2 yolks", "score": 1},{"body": "It clearly looks like it's boiling over on the left side.", "score": 1},{"body": "Now make me a cellphone case out of this stuff!", "score": 1},{"body": "Poor stillborn chicken .", "score": 1},{"body": "This might be good on the grammar subreddit", "score": 1},{"body": "Whoa.. that kinda blew my mind!\n\n\nI bet people would be more impressed with this picture if they knew the whole straw deal.", "score": 1},{"body": "/r/thatHappened ", "score": 1},{"body": "This happens at my kitchen sink every time I do laundry. ", "score": 1},{"body": "Don't eat it!\nI had one like this about 15 years ago. I was making a few eggs and already had some in the pan so thought, fuck it. Ate them and.....got salmonella poisoning. Not fun! :(", "score": 1},{"body": "something, something, unfertilized. ", "score": 1},{"body": "&gt; You're an idiot if you think companies aren't using Reddit for viral marketing.\n\nYou're also an idiot if you think every logo that hits the front page was an intentional advertisement from that company.\n\n", "score": 1},{"body": "Yeah it smelled kinda funny so I just chucked it out ", "score": 1},{"body": "See, I've heard of a version called \"Six Clicks to Jesus\". Choose any subject and  you can get to something Christianity related in six links or less damn near every time.", "score": 1},{"body": "But is this really doing much advertising? The post wasn't like \"my grande iced coffee with milk and sugar from Starbucks looks like a giant Starbucks cup of coffee in a parking lot!\" If it's advertising then it's not very good advertising", "score": 1},{"body": "WHY would you ever want that much cream in a coffee??", "score": 1},{"body": "/r/confusing_perspective has examples of this if anyone wants too see. ", "score": 1},{"body": "In Japan, you get to be made fun of free", "score": 1},{"body": "Caramel, milk, cream. And some coffee.", "score": 1},{"body": "nice try $$tarbucks!", "score": 1},{"body": "At the bottom of the picture, you can see his name is spelled Wain.  He also signed it like that.  This guy is actually an impersonator from back in the day. \n", "score": 1},{"body": "Is this in San Antonio?", "score": 1},{"body": "$SBUX", "score": 1},{"body": "How does it smell\n\n\n...", "score": 1},{"body": "I was convinced this was the spot on Lomas Santa Fe, right next to the 5", "score": 1},{"body": "No, my first thought was \"coffee ordered by someone who doesn't actually like coffee.\"", "score": 1},{"body": "I used to work at a grocery store with a similar set up! This was always entertaining, unless you had a billion other things to do and then it was just one more thing to clean up.", "score": 1},{"body": "You're a wiser man than I was. ", "score": 1},{"body": "Now I know how they get all those double yolk eggs; They steal the yolk from other eggs... mystery solved!", "score": 1},{"body": "I don't care, that's what \"whatever\" means.", "score": 1},{"body": "I don't get it. What is the point of interest here?", "score": 1},{"body": "ehhhhhhhh if it wasnt for the car directly behind it - maybe. this is kind of a stretch.", "score": 1},{"body": "Wait hold up tell me about this face thingy", "score": 1},{"body": "Understanding this made a lot of things make more sense. ", "score": 1},{"body": "And that's noooo yoke. ", "score": 1},{"body": "No...", "score": 1},{"body": "Legal drug trade is a fine business. ", "score": 1},{"body": "Oh pleeeeeease... skim milk, obviously.  You think OP would waste the extra calories on milk or cream?!", "score": 1},{"body": "..and the car next to it melting into the ground.", "score": 1},{"body": "It's the 3D mask spinning. When you look at the inside it will appear to pop our", "score": 1},{"body": "Obviously lacking a sense of humor having no yolk to show for it. ", "score": 1},{"body": "Not every logo is put here by a company. ", "score": 1},{"body": "It's that schizophrenics don't get confused by the illusion. \n\nNot that they can't see it ", "score": 1},{"body": "Hailcorporate?", "score": 1},{"body": "Ah", "score": 1},{"body": "The cup is sitting on the car roof which is black.", "score": 1},{"body": "Taking a picture of your Starbucks drink is so plebeian ", "score": 1},{"body": "You should read the sidebar at /r/hailcorporate.\n\n&gt;Just because no one got paid to make a post doesn't make it any less of an advertisement if it acts just the same as an advertisement.\n\n&gt;This is simply a place to document things that act as ads.", "score": 1},{"body": "Of course. But when the logo is almost dead center, you'd have to be an idiot to not be at least a little suspicious.", "score": 1},{"body": "Only looks like that from the thumbnail, otherwise it just looks like a cup on the roof of a car.  Click bait", "score": 1},{"body": "Thanks! That's the information I was looking for.", "score": 1},{"body": "Dramatic Scale-Change done right.", "score": 1},{"body": "Das auto.\n\n\n^^^ we're doing German, right?", "score": 1},{"body": "Birthday cake for people who like rusty spoons ", "score": 1},{"body": "&gt; a lot of the time people say it in a joking manner", "score": 1},{"body": "A buck, bucking a buck, bucking a buck?", "score": 1},{"body": "No it doesn't.", "score": 1},{"body": "What I would do for a parking lot sized caramel macchiato. ", "score": 1},{"body": "Um...  Yeah.  ", "score": 1},{"body": "That's why you [buy](http://www.smodesk.com/reddit.html)", "score": 1},{"body": "Wait that's my brain on drugs.  O no I've fallen off the wagon!", "score": 1},{"body": "Can anybody please explain how this game worked?", "score": 1},{"body": "This is the standard for electrical disconnects. ", "score": 1},{"body": "You need to wash your car. Or do something about the matte finish.", "score": 1},{"body": "Of course, the cup is clearly holding a gopro.", "score": 1},{"body": "Is that how they catch the monster in \"Attack of the Fifty Foot White Girl\"? ", "score": 1},{"body": "I see that now. Thanks for clearing things up!", "score": 1},{"body": "Page last updated in 2011.\n\nReminds me of my church using FrontPage up until last year.", "score": 1},{"body": "Car in the back ruined it. ", "score": 1},{"body": "Might as well drink the medicinal.  It doesn't do anything for any of the conditions it is supposed to help.", "score": 1},{"body": "Whiskey was good. The Pepto actually upset my stomach. Kind of ironic. ", "score": 1},{"body": "Just wait till Nancy Grace hears about this. ", "score": 1},{"body": "Go home, you are drunk.", "score": 1},{"body": "Why's it gotta be the dark one?", "score": 1},{"body": "The OP did actually call it a \"drink,\"  you're the one the brought up \"coffee.\"\n\nThough, I agree with the sentiment.", "score": 1},{"body": "This is the kind of image that they should use with Machine Learning for when they detect the size of objects, etc.", "score": 1},{"body": "Banana for scale.", "score": 1},{"body": "[I was looking for the wrong Chris Evans](http://i.imgur.com/SpiEkcZ.png?1)", "score": 1},{"body": "As baked as the roof looks, yes.", "score": 1},{"body": "And also saved an eggshell from a normal egg for the picture?  Unlikely.  It would make much more sense to crack it into their hand, let the whites run through and, discard the yolk then take a picture.", "score": 1},{"body": "That's fowl humour.", "score": 1},{"body": "soooo ... a large milkshake?", "score": 1},{"body": "The egg-less omelette is still the best.", "score": 1},{"body": "I actually think both Adam and George would make amazing fathers. Funny yet kind.", "score": 1},{"body": "So, is that a glass of cream with dash of coffee on top?", "score": 1},{"body": "Flubber!", "score": 1},{"body": "why say 'a drink' in the title when the starbucks logo takes is pretty much dead center on the picture?", "score": 1},{"body": "I thought the title was an obscure punchline to a weird joke. And you were offending that guy. Guess /r/funny took me over.", "score": 1},{"body": "Now this is actually mildly interesting. Unlike the bimonthly post about double yolks. ", "score": 1},{"body": "oh jeez... thanks, I'd edit that if I could", "score": 1},{"body": "If not for the roof of the car right behind it this would be almost impossible to unsee. ", "score": 1},{"body": "Yes it does. ", "score": 1},{"body": "Haha op ate a fart egg", "score": 1},{"body": "[Starbucks doesn't sell coffee, they sell milkshakes.](https://www.youtube.com/watch?v=xTVJ6bDeVxk)", "score": 1},{"body": "MFing snakes in the MFing drain.", "score": 1},{"body": "You must be from the south", "score": 1},{"body": "WHY ARE WE YELLING???", "score": 1},{"body": "Two yolks are really common because of all of the hormones that they feed chickens anymore. Especially if you get the Extra Large or Jumbo or whatever they're called, it's pretty common to get the whole dozen with two yolks.", "score": 1},{"body": "Why doesnt the woman on the cup have visible breasts or nipples?", "score": 1},{"body": "Shooting blanks", "score": 1},{"body": "I don't know why but this grosses me out?", "score": 1},{"body": "If they worded it like that, it wouldn't get to the front page. Obviously subtlety is important. I wouldn't have thought of Starbucks once today if I hadn't seen this image, but I briefly considered getting some when I did, and I'm pretty pretty sure that's what they're going for.", "score": 1},{"body": "And it works 100% of the time 90% of the times!", "score": 1},{"body": "There's something very middle America about this pic. Find a way to work Perez Hilton in there and they'll put it in the Smithsonian. ", "score": 1},{"body": "It probably has deadbolt style locks that drive into the floor and top of the door frame. Common with this style of french door.", "score": 1},{"body": "Technically, ventis really are giant fucking cups.", "score": 1},{"body": "There is an all-you-can-eat sushi place where I live. If you finish everything you order (within a time limit, I think 90 mins) you pay the flat rate. If you don't finish something you must also pay the menu price for that item. ", "score": 1},{"body": "where do i add the detergent? \n\nwhere is the agitator? \n\nis this an energy star appliance?\n\ndoes it have different settings for dedicates?", "score": 1},{"body": "what's going on here", "score": 1},{"body": "This kills the egg.", "score": 1},{"body": "Albino egg.", "score": 1},{"body": "Voting for who, exactly?", "score": 1},{"body": "O.O of frweeeeeeeeeee?!", "score": 1},{"body": "I had a double-yolk'd egg the other morning. I think I took yours by accident. :(", "score": 1},{"body": "Toss the ball. Catch it in the cup. Dump it out of the cup. Toss it and catch it in the cup again. ", "score": 1},{"body": "Snakes and sparklers are the only ones I like", "score": 1},{"body": "Got anything that's actually original?", "score": 1},{"body": "what happens when you press it?", "score": 1},{"body": "this post looks like a shitty starbucks ad for reddit.", "score": 1},{"body": "&gt; spoon-shaped \n\nRight.", "score": 1},{"body": "How?", "score": 1},{"body": "OH I thought it was supposed to be inside the car", "score": 1},{"body": "In all honesty this thing looks fucking delicious.", "score": 1},{"body": "Honestly seeing this made me want one. You can't deny that this is /r/HailCorporate material. ", "score": 1},{"body": "Poor author pleads with everyone to stop sending him pictures of eggs at the bottom. I think I'll send him a picture of a banana..shaped like an egg. ", "score": 1},{"body": "Can you elaborate zenarchist?", "score": 1},{"body": "You did good today bruh", "score": 1},{"body": "Eggy as fuck.", "score": 1},{"body": "Is that supposed to be some sort of yolk?", "score": 1},{"body": "\"Because I formed it that way\". \n\nThere's the rest of your title. ", "score": 1},{"body": "Looks more like an iced caramel macchiato. ", "score": 1},{"body": "Nice back and forth you two. ", "score": 1},{"body": "Nah. It's not like those gay ass mochas people get thinking its coffee. Then add a bunch of other crap to it. The macchiato is good. Get an extra shot or two of espresso and you are set. ", "score": 1},{"body": "That was one Heroic Long Legs going back for his Bro.\n", "score": 1},{"body": "This is fake, so fuck you dumbass cunt.\n\nedit: thanks for the gold!", "score": 1},{"body": "Taiwanese Ladyboy.", "score": 1},{"body": "Just plain old rooster juice.", "score": 1},{"body": "Florida? I'm guessing from the Walgreens/Liquor store combo.", "score": 1},{"body": "It's not in any way an interesting pic, it's something that's been done a million times. Except this time there's a starbucks logo front and center.\n\nDo you not see how often corporate stuff is the center of the posts in this sub? \n\n\"hey look! I got 3 pop tarts in this pack of 2 somehow!\" it's always food related stuff that's likely bs", "score": 1},{"body": "Reminds me of those alphabet magnets on the refrigerator.", "score": 1},{"body": "This is what happens when roosters start wearing condoms. ", "score": 1},{"body": "[I say hey!](http://youtu.be/32FB-gYr49Y?t=2m)", "score": 1},{"body": "I would have posted this in /r/rage ", "score": 1},{"body": "I guess, but I don't see why people feel the need to complain about this stuff so much, as if buying a product that you like is somehow evil.", "score": 1},{"body": "How delightfully eggcentric.", "score": 1},{"body": "oh my", "score": 1},{"body": "That is not even mildly interesting. I should shove that cup so far up your ass you can taste it for posting this shit.", "score": 1},{"body": "My ex-girlfriend got mad at me once because She got no yolk in one of her eggs, when I got two yolks in one of my eggs.", "score": 1},{"body": "Eggciting!!", "score": 1},{"body": "&gt;but can occur if a bit of reproductive tissue breaks away, stimulating the egg producing glands to treat it like a yolk and wrap it in albumen, membranes and a shell as it travels through the egg tube.  You can tell this has occurred if, instead of a yolk, the egg contains a small particle of grayish tissue.\n\nWelp, I'm done.", "score": 1},{"body": "[I can see it.](http://2.bp.blogspot.com/-vQf5bsOnh6o/UGYWyp6G-3I/AAAAAAAAC3I/3iSCv2VkIPg/s1600/Chinese+soup+spoon.jpg)", "score": 1},{"body": "Uh have you ever had a macchiato from starbucks before? It's actually super bitter and anyone who *doesn't* drink coffee would find it super unappetizing. \n\nThe brown liquid at the top is straight up espresso dumped into a cup full of milk with a bit of sugar.\n\nThey intentionally don't stir it so that as you drink it it starts off as just milk and sugar and gets progressively more bitter as you reach the end. \n\nBy about halfway through the cup it's just very strong iced coffee. ", "score": 1},{"body": "Albumen.", "score": 1},{"body": "No it doesn't", "score": 1},{"body": "I think it's the stay puft man's glory hole.", "score": 1},{"body": "The end of the work is nigh", "score": 1},{"body": "How do you subscribe to a user's posts?", "score": 1},{"body": "I read this in bugs bunnys voice ", "score": 1},{"body": "Take that shit right back to whole foods frying pan and all. I know its whole foods eggs, you got the brown kind.", "score": 1},{"body": "Nice try, Starbucks marketing team.", "score": 1},{"body": "Imagine if your sperm in your balls would magically start germinating....weird...", "score": 1},{"body": "I guess we should censor every fucking logo to avoid giving any company an advantage. Shut the fuck up.", "score": 1},{"body": "https://www.youtube.com/watch?v=MusyO7J2inM", "score": 1},{"body": "That chicken is shootin' blanks.", "score": 1},{"body": "Re[le]vant username xD Upboats to de left", "score": 1},{"body": "You know what that means... You've got a baby chicken running around somewhere in your house", "score": 1},{"body": "it is indeed...", "score": 1},{"body": "Rooster Semen . Enjoy.", "score": 1},{"body": "&gt;[**Watch the Football! - That Mitchell and Webb Look - BBC Two [1:56]**](http://youtu.be/MusyO7J2inM)\n\n&gt; [*^BBC*](https://www.youtube.com/channel/UCCj956IF62FbT7Gouszaj9w) ^in ^Comedy\n\n&gt;*^1,087,096 ^views ^since ^Feb ^2008*\n\n[^bot ^info](http://www.reddit.com/r/youtubefactsbot/wiki/index)", "score": 1},{"body": "Or it's just a dude posting on reddit", "score": 1},{"body": "Roosters have no part in Yoke, just fertilizing the yoke. The Yoke is like the woman's egg. \n  When you buy eggs at the farmers market or where ever if  that farmer has a rooster you have a chance of getting a fertilized egg, maybe a tiny fetus. Most eggs you buy at the super market keep their chickens Rooster Free, so no little chicken fetus inside.    \n\n  This is just a weird fluke.", "score": 1},{"body": "You don't. ", "score": 1},{"body": "Brand awareness, keeping the brand image in your mind", "score": 1},{"body": "Clearly the majority have NOT seen this trick. I know, it's hard to believe not everyone's as reddit obsessed as you, and that this guy just happened to see this illusion after going to Starbucks. But you know it's true.", "score": 1},{"body": "Chicken had an abortion. ", "score": 1},{"body": "They totally did. A nice runny yolk to go with a tattie scone is my favourite part of a cooked breakfast. ", "score": 1},{"body": "No one actually seems to go AROUND mini roundabouts. Just slightly over it in the relevant direction. It's too small to go around tightly. Point in the right direction, give way to your right, same rules apply.", "score": 1},{"body": "Your egg's a really bad comedian. He's got no yolks!", "score": 1},{"body": "This egg has offended me and my people", "score": 1},{"body": "You cared for Swindon before then?", "score": 1},{"body": "It's not just about saying \"BUY THIS NOW\" \n\nIt'sabout getting that brand into your head, get you thinking about the brand.\n\nSo when theres a selection of brands selling the same product, you recognise this one.\n\nWhen you think \"I need a drink\", you think starbucks.", "score": 1},{"body": "Please do make this a thing.", "score": 1},{"body": "Do you really? Do you have to?", "score": 1},{"body": "Looks like there's some assembly required.", "score": 1},{"body": "How does it smell?", "score": 1},{"body": "Could be. ", "score": 1},{"body": "I'm in Yorkshire and so none of this concerns me.", "score": 1},{"body": "My local gamestop is next to starbucks can confirm", "score": 1},{"body": "Intentional or not, it's still the same, it's advertisin g", "score": 1},{"body": "Oh my god, op didn't censor logo from a restaurant cup that happened to make the illusion /r/hailcorporate, wahhh!", "score": 1},{"body": "return it", "score": 1},{"body": "It's not that, it's the fact that Reddit is supposed to be a social news site run by the users, but as it gains popularity more and more of these types of posts are showing up. \n\nIt's clear that advertisers are aware of the popularity and 'hivemind' of reddit, so they buy esablished accounts to subtly put their product in front of us. \n\nAgain, it's not that it's evil or anything but it's clear that these posts are abusing the system. There are proper forums and channels for advertising (for instance, the ads) but marketing agencies would rather get free publicity, just like the kind provided in this post. ", "score": 1},{"body": "Cheers mate.", "score": 1},{"body": "What if the yolk's on you?", "score": 1},{"body": "What do you want, everybody to censor every fucking logo before they post on Reddit to satisfy your paranoid delusions that everyone's an advertising spy?", "score": 1},{"body": "And really, this doesn't look like giant coffee. I was aware of the camera trick immediately.  \n  \nAll I see is a picture of a Starbucks cup. Which is really all this is. It's not really funny, if you see the trick it's not really interesting (even mildly). But it *is* a huge Starbucks logo in the center of a picture.", "score": 1},{"body": "I say this far down you get downvoted anyways!", "score": 1},{"body": "What do you want, everybody to censor every fucking logo before they post on Reddit to satisfy your paranoid delusions that everyone's an advertising spy?", "score": 1},{"body": "I hate egg yolks so if this happened to me I'd be egg-static!", "score": 1},{"body": "That's racist!", "score": 1},{"body": "I see, so zenarchist is really saying, *yes they're trying to sell you their product but in a less direct way than what we assume*.", "score": 1},{"body": "Kinda had the same feel", "score": 1},{"body": "Which drink is that? It looks so yummy. ", "score": 1},{"body": "I was about to come here and criticise you and say \"No, it's a stalactite.\" Then I saw that no, you're right, it's growing from the ground and is mildly interesting.", "score": 1},{"body": "OP means that the left donor's handle has been used more therefore more polished", "score": 1},{"body": "Kill it. Kill it with fire!\n\nhttp://i.imgur.com/eN514xh.gif", "score": 1},{"body": "Holy shit smeeee, I knew you were an ER doc. Now I know you're a dad as well.", "score": 1},{"body": "Woooo, everyone's cakeday... :D", "score": 1},{"body": "What do you want, everybody to censor every fucking logo before they post on Reddit to satisfy your paranoid delusions that everyone's an advertising spy?", "score": 1},{"body": "Omelette this pun thread continue, I haven't had un oeuf yet", "score": 1},{"body": "This is the stupidest fucking shit I've ever read. Fuck you cunt.\n\nEDIT LOL THANKS FOR THE GOLD", "score": 1},{"body": "&gt;so they buy esablished accounts to subtly put their product in front of us.\n\nI see this being said all the time, but have yet to see any proof", "score": 1},{"body": "I once got an egg with two yolks. Should've taken a pic!", "score": 1},{"body": "Now that's the kind of mildly interesting things I come to this subreddit for.", "score": 1},{"body": "/r/hailcorporate would bitch even more if he did", "score": 1},{"body": "I did but my title was too long and got pulled.  So this is the second attempt. ", "score": 1},{"body": "So it's a place to link pictures that have a product logo on it? that's it? what's the point?", "score": 1},{"body": "A) Macchiatos never look that perfect in reality\nB) He hasn't taken a single sip from it and he's already at his car\nC) The logo is perfectly in frame, as well as in the center of the photo\n\nSo no, some guy didn't just 'happen' to take this picture, this is 100% pure unadulterated starbucks propoganda. \n\nI'm a huge starbucks fan, I go there at least 3 times a week, but you can't deny that this is marketing at its finest. ", "score": 1},{"body": "What do you want, everybody to censor every fucking logo before they post on Reddit to satisfy your paranoid delusions that everyone's an advertising spy?", "score": 1},{"body": "That's actually pretty cool, love the use of perspective.", "score": 1},{"body": "What do you want, everybody to censor every fucking logo before they post on Reddit to satisfy your paranoid delusions that everyone's an advertising spy?", "score": 1},{"body": "[Here ya go](http://www.hasbro.com/common/instruct/Mystery_Date_2005.pdf)", "score": 1},{"body": "Ohhhh, so it's *healthier*... because all the cholesterol is in the yolk? I always thought people who order egg white omelettes were brain damaged.  ", "score": 1},{"body": "Black pudding+baked beans for me. Don't think I've ever known anyone else to say that's their favourite part. I'll find someone, one day. :(", "score": 1},{"body": "It is. It's on a car (in a parking lot) and it's a venti (huge cup).", "score": 1},{"body": "&gt;No-yolkers are called ... more commonly, \"fart\" eggs.    \n    \n    \n    \n_You're eating a fart_", "score": 1},{"body": "It didn't fall, it was pushed!", "score": 1},{"body": "I'm afried these puns are rotten.", "score": 1},{"body": "Looks like the yolks on you.", "score": 1},{"body": "This was immediately my thought when I saw \"spoon\". ", "score": 1},{"body": "Made in china", "score": 1},{"body": "What do you want, everybody to censor every fucking logo before they post on Reddit to satisfy your paranoid delusions that everyone's an advertising spy?", "score": 1},{"body": "**Out of this world!!**\n\n*I'll show myself out...*", "score": 1},{"body": "No baby chicken fetus for you", "score": 1},{"body": "Why does it matter? Does it offend you or something? I don't get why it's a big deal anyway.", "score": 1},{"body": "I wouldn't eat it if I was you.", "score": 1},{"body": "Congratulations! You created an account just for this comment! Have an eggcellent day!", "score": 1},{"body": "Guess the yolk's on you.", "score": 1},{"body": "I don't know really. the 2eggy kid obviously didn't realize that was the joke... and I had to comment even though I didn't have anything to say.\n", "score": 1},{"body": "What do you want, everybody to censor every fucking logo before they post on Reddit to satisfy your paranoid delusions that everyone's an advertising spy?", "score": 1},{"body": "Or just not post stupid shit like this. That works too. ", "score": 1},{"body": "i think that egg contained the secrets of the universe; but NOOOO you had to throw it out cause it was stinky.....", "score": 1},{"body": "Well, this egg definitely didn't came before chicken.", "score": 1},{"body": "What do you want, everybody to censor every logo before they post on Reddit to satisfy your paranoid delusions that everyone's an advertising spy?", "score": 1},{"body": "OP sucked it out with an empty plastic water bottle", "score": 1},{"body": "I agree. Looks like a cup and a straw on top of a car. How impressive.", "score": 1},{"body": "Imperial beach, ahh finally I  recognize a place. ", "score": 1},{"body": "How could you prove it? \n\nSay you're an average redditor and you've got a few accounts. Your main account, maybe the odd throwaway, professional, etc. \n\nOne day a new user sends you a PM asking if you're interested in selling one of your accounts. \n\nIf you're not interested you ignore them, but if you think \"hey I wonder how much they want for it\" you PM them back. \n\n2.6 Million people are subscribed to mildlyinteresting, so this post has been seen by at least double that (90% of reddit is lurkers). That's over 5 million people. Think of how much a TV ad would cost which is going to be seen by 5 million people. However with this, there's no cost at all aside from buying an account with a 'clean' history. \n\nSo with that being said they offer Joe Shmoe a ludicrous amount of money, make him sign an NDA, and up to the top with this post. \n\nThey may even let dude keep his account so that he doesn't \"suddenly disappear\". It's not that crazy to think that corporations are willing to use dirty advertising tactics to reach millions upon millions of people for basically free. ", "score": 1},{"body": "What do you want, everybody to censor every fucking logo before they post on Reddit to satisfy your paranoid delusions that everyone's an advertising spy?", "score": 1},{"body": "Worth it.", "score": 1},{"body": "Weird my hen just laid an egg that is MASSIVE compared to her other ones. I'm scared it's a double egg. No please.", "score": 1},{"body": "Is that you HowToBasic?", "score": 1},{"body": "Imperial beach, CA", "score": 1},{"body": "But can you unboil it?", "score": 1},{"body": "Urgh this makes me uncomfortable. What is that, 56K wood?", "score": 1},{"body": "What do you want, everybody to censor every fucking logo before they post on Reddit to satisfy your paranoid delusions that everyone's an advertising spy?", "score": 1},{"body": "2 for 1.", "score": 1},{"body": "If he cooked it in less time he would have a blue egg.", "score": 1},{"body": "Is it wrong I found that website nostalgic &amp; read most of the content, all the while thinking, \"This guy knows a lot about chickens &amp; eggs.\"", "score": 1},{"body": "I guess it had no reason to live", "score": 1},{"body": "You're an idiot if it bothers you this much. You noticed it more than I did.you must be wanting it already. I swear, some people just WANT shit to complain about.\n\nIrony being that I'm complaining about the complainers...", "score": 1},{"body": "yes! that'd be awesome! will you please make it happen?", "score": 1},{"body": "That's a cochlear implant. It can make deaf people hearing again.Some people have two.", "score": 1},{"body": "yea same", "score": 1},{"body": "this is bad ass! and true! ", "score": 1},{"body": "http://www.cookinglight.com/eating-smart/nutrition-101/nutrition-myths-facts/eggs-cholesterol-levels", "score": 1},{"body": "So your just eating chicken sperm.", "score": 1},{"body": "So it looks like it cut into the floor just deep enough, huh.\n\nNeat.", "score": 1},{"body": "http://www.cookinglight.com/eating-smart/nutrition-101/nutrition-myths-facts/eggs-cholesterol-levels", "score": 1},{"body": "This isn't white what I was expecting", "score": 1},{"body": "Because vaseggtomy.", "score": 1},{"body": "That's one of the reasons we, humans cook food before eating it. ", "score": 1},{"body": "I hadn't seen it before, and I found it—appropriately enough—mildly interesting. Why do you care if corporate stuff is the centre of posts in this sub? I don't think it's intentionally so anyways, but even if it were, who cares? You don't *have* to see it. Unsubscribe if it bothers you this much.", "score": 1},{"body": "I really doubt this was done for advertising. It just seems so weirdly petty to complain about this. Sometimes people can buy products and take photos of them without being corporate whores.", "score": 1},{"body": "https://www.youtube.com/watch?v=8dCZm5aLj9A\nHow does this guy make you feel?", "score": 1},{"body": "I'm already very aware that Starbucks exist, a picture on reddit that I looked at for 2 seconds doesn't really change that.", "score": 1},{"body": "I feel like you just cracked the shell and drained only the egg white into the pan and then threw out the yolk.", "score": 1},{"body": "yeh its funny that the Official Egg is currently the top comment and congratulating OP on this find. He should know better.", "score": 1},{"body": "this pleases me", "score": 1},{"body": "Ever look at the bottom of the inside of a Dyson Airblade after it's been used in a restaurant for a couple months? There is a seam. Usually packed full of black crud.", "score": 1},{"body": "Oh it does", "score": 1},{"body": "Looks like this egg\n( •_•) \n( •_•)&gt;⌐■-■ \n(⌐■_■)\nIs all bumen.", "score": 1},{"body": "He's Fucking Robocop.", "score": 1},{"body": "It's an albino cheese puff.", "score": 1},{"body": "This is not a funny yolk.", "score": 1},{"body": "As someone who's just learning French, this cracked me up.", "score": 1},{"body": "Uhhhh... Thats... Thats what she said?", "score": 1},{"body": "[Ah, Forget the whole thing](https://www.youtube.com/watch?v=XbzGLdiICk4)", "score": 1},{"body": "Holy Foambow! One day we'll see a double foambow", "score": 1},{"body": "&gt;February 2011\n\n&gt;dial up\n\n&amp;#3232;_&amp;#3232;", "score": 1},{"body": "No, it doesn't. I know that brand awareness isn't a thing, but one post on reddit for a brand that's already very well known isn't going to change anything. If it was a smaller chain, then sure, but it's fucking Starbucks. This is like somebody taking a picture with McDonalds in the background and then you complain about them being a corporate whore.\n\nreddit has a weird paranoia about corporations.", "score": 1},{"body": "But less humorous. ", "score": 1},{"body": "That'd be because black pudding is the fucking devils work.", "score": 1},{"body": "you mean these yolks are cracking you up", "score": 1},{"body": "then my work here is done (climbs in giant egg shell and zooms up into space)", "score": 1},{"body": "Yolks on you!", "score": 1},{"body": "I would have eaten it. Damn eggs just look so innocent.", "score": 1},{"body": "Ah, it is hasbro.  I remember the commercials for this when I was younger but it never really looked like something I would be in to.", "score": 1},{"body": "Is that a camera in your hotel room??", "score": 1},{"body": "How are we supposed to keep up with the eggaggerated, yolk free, egg body standards!? #realeggshaveyolks ", "score": 1},{"body": "GMO much? Lol", "score": 1},{"body": "Well they aren't actually tiles... Its just concrete that has lines stamped into it before it dries. Cheaper that way.", "score": 1},{"body": "/u/RibsNGibs to the rescue! Second comment down:\n\nhttp://www.reddit.com/r/mildlyinteresting/comments/2t8nuf/someone_made_a_3point_turn_and_left_interlaced/", "score": 1},{"body": "Japanese are the best in the junk foodiness department. I drank a lot of [Gabu Nomi](http://ventejapon.fr/wp-content/uploads/2014/09/140217_01_11_LL.jpg) while I was there... *10/10* would get diabetes again.", "score": 1},{"body": "You don't have a problem with corporate marketing replacing content while pretending it's not ads?\n\nYou don't know what happened to digg do you?", "score": 1},{"body": "I don't know, he seems to me to be a man of eggsellent character", "score": 1},{"body": "eggsellent", "score": 1},{"body": "You mean an egg-white omelette? I don't see how one might make an omelette without any egg. That's either nothing or just cheese and whatever else you put in there.", "score": 1},{"body": "Don't worry, size doesn't matter all that much anyway.", "score": 1},{"body": "16gb", "score": 1},{"body": "I don't know how long you've been on reddit for, but about 5 years ago when it was still in its adolescence this kind of shit never happened. \n\nEver since reddit's been 'mainstream' (roughly 3 years ago) there's been an influx of \"look at this brand\" posts with literally no actual content in them making it to the front page. \n\nLike honestly what is the purpose of this post aside from making you look at a delicious drink? There's literally nothing else here, how did it make it to the frontpage if not assisted via unethical means of getting upvotes? ", "score": 1},{"body": "Yeah, guys, this is ova. ", "score": 1},{"body": "/r/thatHappened ", "score": 1},{"body": "Need a hug?", "score": 1},{"body": "To increase our awareness of corporate advertising (paid or unpaid, intentional or unintentional) in our world.\n\n&gt;Advertisements are everywhere, even if you are not aware of them.\n\n&gt;This reddit [/r/hailcorporate] is based on the principle that popular culture has permeated so far into our own lives that we ourselves are acting unknowingly as shills for a multitude of things.", "score": 1},{"body": "Dude what the hell, I can see the yolks in your left hand", "score": 1},{"body": "I think I know where it went. I bought a dozen eggs last year and the entire dozen had two yolks in each egg. :)", "score": 1},{"body": "You didn't HAVE to comment.", "score": 1},{"body": "Bad", "score": 1},{"body": "Well reddit recently added this great new feature—you can create your own subreddit. Maybe you should go make your own mildlyinteresting with no corporate ads.", "score": 1},{"body": "I'd visit the egg factory and claim you've won something. ", "score": 1},{"body": "WHAT IS THIS WORLD COMING TOO!!!!???", "score": 1},{"body": "Well, that went over easy.", "score": 1},{"body": "That's funny because my egg had no white this morning. Suspicious. ", "score": 1},{"body": "How does he smell!?", "score": 1},{"body": "The 7th seal is broken. Let a pestilence and woe fall upon the land.", "score": 1},{"body": "Well, between black pudding and rock and roll, the Devil and I are on good terms.", "score": 1},{"body": "My friend, you must be new, because on here anybody will do ANYTHING for karma.", "score": 1},{"body": "It's mildly interesting because the car camouflages with the background. I'm assuming they put the drink on top of the car, noticed it looked a bit odd, and took a picture. I don't see why you have to assume that some evil businessman thought a great way to advance his business would be to post a picture of the drinks everyone's seen before on reddit.\n\nObviously it does happen sometimes, but they'd probably do it on /r/pics or /r/videos, and at least have the post be related to the brand.", "score": 1},{"body": "GAINZ", "score": 1},{"body": "Eggcellent! May I recommend buying eggs from an actual farm not a factory farm?", "score": 1},{"body": "Oops...I dropped the ball.\n\nBut wait, it's okay. The ball is on a string and attached to the cup.", "score": 1},{"body": "You're taking this way too seriously, get a grip dude.", "score": 1},{"body": "No, it doesnt", "score": 1},{"body": "Onwards to Japan!\n\n*Travels to Mexico*", "score": 1},{"body": "It's poison. \n\nThrow it out. ", "score": 1},{"body": "stuck the landing", "score": 1},{"body": "Yea....it's 2015 and the fastest option where I live is DSL that maxes out at 600 kb/s...", "score": 1},{"body": "As someone who can't eat food dye, I think this would kill me. :P", "score": 1},{"body": "YOU GOTTA BE YOLKIN WITH ME\n\n\n\nits ok i hate myself too....", "score": 1},{"body": "That scaffolding to cookie ratio means that almost (or possibly, more than) half of the product is wasted just because it didn't form like a twisted fucking bean/hyena-poop crossover... c'mon engineers?", "score": 1},{"body": "\"I'm not even yolking!\" If you have more terrible egg puns please let me know", "score": 1},{"body": "Did you come up with that pun yourself, or did you poach it from someone else? ", "score": 1},{"body": "Just stay away from HowToBasic. He and eggs have a violent history. ", "score": 1},{"body": "That would jave made an amazing ~~tale~~ movie... If, y'know... They weren't Daddy Long Legs...", "score": 1},{"body": "Or a fetus.", "score": 1},{"body": "lol, dude I'm jealous of the drugs you take... that shit looks nothing like what you described... You high like modafucka", "score": 1},{"body": "Exactly.  Its been mildy amusing me for a while.  The letter unstick and re stick every time I use the bottle!", "score": 1},{"body": "What a rip off!", "score": 1},{"body": "I'm not saying that this particular post is 100% posted by a marketing team. I do think there's a real possibility that this is just a genuine post which happens to seem like a hailcorporate post, but you can't deny that marketing happens on reddit. Probably more than most people care to admit. \n\nThe only way to prevent this site from becoming a sprawling cesspool of advertisements is to apply critical thinking and use the up/down vote button appropriately. ", "score": 1},{"body": "Is it just me, or does anyone else want a whole box of pasta just like this?", "score": 1},{"body": "FYI. The new one. Not the classic one...\n\nR.I.P. Classic Logo...", "score": 1},{"body": "Looks to be an [International XT pickup truck](http://en.wikipedia.org/wiki/International_XT) with a camper top. ", "score": 1},{"body": "[](#placeholder-awb)Comment is being processed... It will be automatically replaced by new text within a minute or will be deleted if that fails.", "score": 1},{"body": "HowToBasic does not approve.", "score": 1},{"body": "Obviously it does happen, but unless it's something really obvious I don't see the problem with it. Starbucks isn't even mentioned in the title.", "score": 1},{"body": "You've been yolk'd.", "score": 1},{"body": "This whole thread is full of rotten egg jokes", "score": 1},{"body": "Bring it back for refund.", "score": 1},{"body": "Hen must have been taking birth control. ", "score": 1},{"body": "I egg-gree ", "score": 1},{"body": "is that a hobbit?", "score": 1},{"body": "You must be yolking.", "score": 1},{"body": "I guess it a *Cut above the rest*", "score": 1},{"body": "Meta", "score": 1},{"body": "I guess it's a *Cut above the rest*", "score": 1},{"body": "Source?", "score": 1},{"body": "If I remember, the black burger was squid ink. ", "score": 1},{"body": "It would not be too much to turn the cup and hide the logo?", "score": 1},{"body": "So I see you like cream with a splash of coffee", "score": 1},{"body": "Zero yolk? I almost ate that shit! Where the fucks the rest of my yolk? You didn't think I was going to count that shit mother fucker? \"Aziz Ansari breakfast problems\"", "score": 1},{"body": "Espresso, coffee's gay cousin.  I'll take just plain, real coffee.  Black and by the gallon.", "score": 1},{"body": "r/severelyuninteresting", "score": 1},{"body": "We've called him Bilbo for ages already :')", "score": 1},{"body": "You're gonna cut yourself of that egg, boy.", "score": 1},{"body": "Yeah but does it need to be? There's not 1 person on this site who doesn't immediately recognize that logo. ", "score": 1},{"body": "I don't think that is what happens. I've seen this before many times, and if the seed had germinated then it would have grown into a plant with roots and leaves, not just another pepper.\n\nhttp://www.gardeningknowhow.com/edible/vegetables/pepper/little-pepper-inside-pepper.htm", "score": 1},{"body": "Probably more so than cholesterol (although eggs were a favorite scapegoat for a while there), the yolks contain the nutrient dense calories in an egg. So by eliminating them you lower both the calories and nutrients in your breakfast. There's still some good protein in the whites I guess, so long as you don't like enjoying life. ", "score": 1},{"body": "That's the thing, everyone on the site already knows it so well, so I don't see how just showing the logo will change anything. OP didn't even say it was a good drink or anything, it's just there.", "score": 1},{"body": "&gt; He should know better.\n\nWouldn't an egg be female?", "score": 1},{"body": "how does it smell?\n", "score": 1},{"body": "The yolk is apparently not on you.", "score": 1},{"body": "Even Roosters shoot blanks from time to time.", "score": 1},{"body": "The service was fast and the place was impeccably clean *but* the food was awful.  Really, truly bad.  The meat was dried out under heat lamps and sauced dishes floated in their own grease.  I suspect the true penalty was eating your meal.", "score": 1},{"body": "Proof that zombie chickens are real! ", "score": 1},{"body": "I don't think eggs have genders.", "score": 1},{"body": "Lol my eggs totally stole one of your yolks.\n\nhttp://i.imgur.com/WKRoj9V.jpg", "score": 1},{"body": "Aren't those roots a tree?  \n\nSome grow roots up,  out of the ground.  \n\nDey don't look like no stumps to me lucie. ", "score": 1},{"body": "Health nuts' dream.  You know how annoying it is trying to separate the yoke from the egg white.", "score": 1},{"body": "Maybe he isnt that offical after all.", "score": 1},{"body": "What a mildly interesting fact.", "score": 1},{"body": "Uhh...just but egg whites you peasant ", "score": 1},{"body": "But that's the baby bird. That's the part I want to eat. - Red Forman", "score": 1},{"body": "It's still lower in calories and fat. So depending on your dietary goals, it's still often a healthier choice.", "score": 1},{"body": "They did, they called it IRC. ", "score": 1},{"body": "that picture doesn't look like a giant cup in a parking lot, it looks like a close-up picture of a starbucks beverage. shit, everything behind the cup is completely out of focus.", "score": 1},{"body": "Just starting the laying cycle. Happens all the time.", "score": 1},{"body": "Chickens only have one hole that they pee, poop, and lay eggs out of. ", "score": 1},{"body": "r/misleadingthumbnails", "score": 1},{"body": "Well played Starbucks, well played\n", "score": 1},{"body": "Return that shit and let them know!", "score": 1},{"body": "Eh, it just gets recycled back through the machine anyway. Or at least that's the minimum level of competence you should expect. I'm sure they don't just throw it all away.\n\nI'd image it gets cut this way, then the \"scaffolding\" gets removed and reprocessed while the cutouts go on to get cooked.", "score": 1},{"body": "Eggs are affordable, nutritious, and versatile. Also delicious. Please subscribe me to egg facts!", "score": 1},{"body": "After the wrapping is taken off that Red Bull will hold its value better than the textbook. ", "score": 1},{"body": "Every bodybuilders dream", "score": 1},{"body": "Dope. I like black coffee as well. ", "score": 1},{"body": "I was eggspecting a different pun from you, but it's allwhite; I got this yolk covered.", "score": 1},{"body": "Quite el*egg*ant if you ask me", "score": 1},{"body": "Guess the yolks on you.", "score": 1},{"body": "Every white girls dream right their ", "score": 1},{"body": "Egg here. Got ya!", "score": 1},{"body": "People think of other redditors as their peers, so seeing that our 'peers' drink starbucks reinforces our own desire to do so as well as acknowledges that it's socially acceptable to do so. \n\nDepending on who you talk to there's a large social stigma against \"overpriced sugar water\" as people like to put it. This post directly opposes that stigma by saying to the world \"hey I drink starbucks and so should you\". \n\nThere's a lot that goes through your mind in the 4 seconds it takes you to click on a link on your frontpage, quickly glance at it, let a little air out of your nose, and move on to the next post about cats. ", "score": 1},{"body": "please continue to exeggcute this novelty account. I'll be scrambling to find your future posts", "score": 1},{"body": "(n)eggy(n+2)me", "score": 1},{"body": "Two differently-sized bananas for scale; I feel the universe collapsing.", "score": 1},{"body": "I personally have purchased lots of cartons of eggs that all have double yolks. And the only thing that's seriously changed in the egg industry in the last 50 years is the hormones that they feed them now.", "score": 1},{"body": "That's it. We're officially living in the future.", "score": 1},{"body": "Where did you buy your eggs? Zygote to the market for mine.", "score": 1},{"body": "Just like your soul.", "score": 1},{"body": "I technically have broadband internet where I live.", "score": 1},{"body": "TIL the yellow thingy inside an egg is called yolk", "score": 1},{"body": "Eggbortion ", "score": 1},{"body": "Albino", "score": 1},{"body": "Omelette du fromage?", "score": 1},{"body": "AWESOME!  My $200 textbook came unbound, and hole punched. umm can you not spare some book glue and cardboard for fuck sake.", "score": 1},{"body": "Ripleys believe egg or not", "score": 1},{"body": "Not really a big deal if that person also enjoys going to Starbucks. Going to a place you might enjoy because someone on reddit posted about it isn't a bad thing in any way. \n\nEven if they were actually saying \"I like Starbucks, you should go there\" it's still not even remotely a bad thing. You're allowed to recommend things made by big corporations. \n\nI don't see why people complain when it's Starbucks or something,  but when it's a new movie nobody cares, even though it's pretty much exactly the same thing.", "score": 1},{"body": "Well then I guess the yolk is on you! Honk honk weeeeeee blblblblblbl wake waka.", "score": 1},{"body": "What an eggnigma ", "score": 1},{"body": "Take it back to the store you bought if from. You shouldn't have to \"shell\" out for faulty goods", "score": 1},{"body": "These were considered lucky by my grandparents.... I was always told that it was the first egg (like a trial/test egg) before a hen started laying \"real\" yolk filled eggs. ", "score": 1},{"body": "Okay, pal. I'm the one who needs to get a grip. Got it.", "score": 1},{"body": "You wrote an awful lot, yet provided no proof", "score": 1},{"body": "Emo floor.", "score": 1},{"body": "Those are some sweet handles", "score": 1},{"body": "you've got to be yoking!", "score": 1},{"body": "Some people live in very remote or rural areas with phone service but, the ISPs haven't built up broadband infrastructure yet.\n\nKind of hard to justifying the cost if all the stuff they're building only services a half dozen homes.", "score": 1},{"body": "Too Eggit, too Eggit to quit!", "score": 1},{"body": "My company runs on it. The five brothers that own the company all share one big office. The centerpiece is a bank of restaurant grade coffee makers. I'm the only one in my building that drinks it though so I just have a k-cup machine in my office.", "score": 1},{"body": "Interesting point about the movie thing, very good analogy. \n\nI suppose you're right, it's okay to recommend things that you like. \n\nFor me, where it becomes a problem is when there's no content to go with it, just a \"buy this\" with 0 discussion. ", "score": 1},{"body": "there is a chicken out there shooting blanks", "score": 1},{"body": "Yes it does. ", "score": 1},{"body": "Huh? I'm pretty sure, by the fingers and especially the nail, op is a female..? ", "score": 1},{"body": "Made In China ", "score": 1},{"body": "Chicken Invaders came true.", "score": 1},{"body": "These are not my bills, I am posting for a friend that does not reddit. I will try to get him to answer any further questions that you may ask.", "score": 1},{"body": "[So one of those Egg Council creeps got to you too, huh?](http://imgur.com/JaVgowl)", "score": 1},{"body": "I was oddly surprised that this isn't a thing yet.", "score": 1},{"body": "I took this picture back in Dec 2012 at work. It was bitterly cold, but the snow and ice had started to melt and drip down on the shrub this spiderweb was in. ", "score": 1},{"body": "Yeah I wasn't exactly sure if this was the case, more like guessing. Probably should have researched a bit before posting. So basically it's a seed acting as a parasite? ", "score": 1},{"body": "Eggs-actly what I needed to put I smile on my face. ", "score": 1},{"body": "That's your daily fat/sugar intake in one cup. Enjoy! ", "score": 1},{"body": "i recently cracked an egg with 2 yolks in it. Now i know where it came from", "score": 1},{"body": "... did you read my comment at all? I'm specifically pointing out how easily the marketing teams could cover their tracks, therein making proof impossible to find. \n\nJust because someone covers up a murder really well doesn't mean it didn't happen. ", "score": 1},{"body": "check if you have guarantee and get a refund", "score": 1},{"body": "that's not funny", "score": 1},{"body": "what... what does this mean?", "score": 1},{"body": "Doesn't it look refreshing though? Damn look at the way those colors are blending. \n\nIf the cup was turned and the logo wasn't showing this would not be on the front page. \n\nhailcorporate as fuck", "score": 1},{"body": "These lack of yokes are really cracking me up*", "score": 1},{"body": "Runny yolk, tattie scone and square sausage. Yes.", "score": 1},{"body": "eww. lol. eww.", "score": 1},{"body": "I am thinking how I will look in Japanese Maiko or Samurai dress.", "score": 1},{"body": "Call the federal reserve and ask them to run the serial numbers", "score": 1},{"body": "You're HowToBasic, aren't you?", "score": 1},{"body": "That brings me back to '99. My university gave these as freebies ", "score": 1},{"body": "If only there were a subreddit that was dedicated to these sorts of explanations. One where people could post their understanding of science, but it was allowed to be shitty. ", "score": 1},{"body": "This is my favorite part of renting from Chegg", "score": 1},{"body": "that chicken was sterile. ", "score": 1},{"body": "not even if Disney made it?", "score": 1},{"body": "Bitch please.\n\nWww.twitter.com/therealeggy", "score": 1},{"body": "Not every time a logo hits the front page, but this one is clearly hailcorporate", "score": 1},{"body": "it's scored concrete not a crack. and not a tile. ", "score": 1},{"body": "Nasty. The sushi place I'm talking about is actually quite good. The only problem is going with a group and ending up ordering too much food because \"someone will eat it\" and then struggling to finish so you don't have to pay extra. ", "score": 1},{"body": "Hmmm I might have to look into that today. ;) Thanks!", "score": 1},{"body": "No marriage then. You are cursed! For a hundred bucks, however...", "score": 1},{"body": "This is one of Willy Wonka's escape squirrels. ", "score": 1},{"body": "Especially not-even-if Disney made it... Pixar on the other hand...", "score": 1},{"body": "\"OP says his egg had no yolk but really bought egg whites, then links to /r/karmaconspiracy to make himself less suspicious\"", "score": 1},{"body": "[Just for you](http://imgur.com/vLOy1bc)", "score": 1},{"body": "The heel has no soul.", "score": 1},{"body": "How does he smell?", "score": 1},{"body": "Oh boy, a reddit pun thread! Let me give it a go:\n\nI stuck my dick in a chicken once!\n\nWait, shit, can I have another try?", "score": 1},{"body": "This happened to me as well except I received a disposable razor and laundy detergent pod as well. Chegg gets a lot of companies that want to give free samples to college students in the hope that the students will buy their products.", "score": 1},{"body": "eggcelent", "score": 1},{"body": "Shooting blanks", "score": 1},{"body": "YEAAAAAAAA", "score": 1},{"body": "I thought it was eggcelent", "score": 1},{"body": "call sean connery, hes the only one to have ever successfully escaped alcateggz.", "score": 1},{"body": "This is uncomfortable", "score": 1},{"body": "Hormonal imbalances *can* be a source of double yolked eggs, but your ignoring a treasure trove of other potential factors. \n\nFor instance:\n\n-Changes in lighting conditions for hens. Light can affect the egg laying cycle and egg producers are far more likely to stimulate productions with lights now than they were 50 years ago.\n\n-Some jurisdictions disallow/discourage the sale of double yolked eggs. Less likely to see them if they're being sorted out, and sorting guidelines almost certainly vary more often than every half-century.\n\n-You mentioned buying extra large and jumbo eggs. A double yolked egg is naturally heavier/larger than a single yolked egg, increasing your likelihood of seeing a double-yolker.\n\n-Your eggs are probably sourced from flocks that are relatively closely linked in terms of genetics. If your eggs all come from a relatively closed source, and that source is inclined to producing double yolks through a hereditary defect/anomaly, you're more likely to end up with double yolked eggs.", "score": 1},{"body": "If you look in the background, the same exact box is there with one difference...it's not photoshopped.", "score": 1},{"body": "Nah. Just got into the Wonka factory and chewed the wrong gum, is all.", "score": 1},{"body": "Ha! Its hard work keeping such defiant bottles in line.", "score": 1},{"body": "Marketing is used to attract attention and create interest.\n\nBranding is used to create awareness and exposure\n\nAdvertising is used to bring in sales.", "score": 1},{"body": "A female can't be a wiser man than a male? That is so sexist!", "score": 1},{"body": "I had several of the peppers that I grew last year do this. At least one of them started molding as well. :/", "score": 1},{"body": "Damn. Sounds good. We just have an old shitter coffee maker in our break room that hardly gets cleaned. I just try to get coffee before going in. ", "score": 1},{"body": "When I was a kid I worked on an egg farm. It was beyond hideous.  This was many years ago. I assume things are better now.  At any rate, once I came across a massive egg.  Incredibly huge for a chicken egg.  I thought, wow, it must be a triple yolker. Double yolkers are fairly common. I cracked the egg and found egg white as well as a fully developed other egg.  It must have ripped that hen's butt wide open.", "score": 1},{"body": "That comma popped outta no where, eh?", "score": 1},{"body": "suck on my salty balls", "score": 1},{"body": "They have flavors that don't sound too appetizing at first but end up being awesome.  Just different.  Without being a weaboo I will tell you that they're stuff is interesting yet tasty", "score": 1},{"body": "TIL egg yolk procurement is a zero-sum game.", "score": 1},{"body": "Yeah it would. I really doubt anyone upvoted it just because Starbucks is in it. Hell, a lot of people on reddit hate Starbucks.", "score": 1},{"body": "... Then you didn't cook them. ", "score": 1},{"body": "These are the healthier version of eggs. ", "score": 1},{"body": "He was avoiding the obvious, other than that is was eggcellant!", "score": 1},{"body": "So many of the things on this subreddiit make me go \"Dude that's not mildly interesting, that's hella interesting!\"", "score": 1},{"body": "Why couldn't be the other kind of egg? All yolk and no white!", "score": 1},{"body": "I dont mean to cause you any sorrow but, you dont have any gold", "score": 1},{"body": "Calm down, reddit marketing guy.", "score": 1},{"body": "Will you teach me how to grammar? **EH**? \n", "score": 1},{"body": "Linked by op himself. ", "score": 1},{"body": "That chicken had ONE job! Fail. ", "score": 1},{"body": "That's Paul Bissonnette", "score": 1},{"body": "That's what the egg said.", "score": 1},{"body": "May I suggest r/Foamy/ to anyone interested?", "score": 1},{"body": "Keep this picture away from /r/OCD.", "score": 1},{"body": "That is a freightliner... a bit more badass than the international imo", "score": 1},{"body": "I wonder if anyone else has thought to spell \"joke\" as \"yolk\" in this thread... probably not.", "score": 1},{"body": "It's a weird, beautiful city. It was made by a traditionally nomadic culture, so the city is like this odd dusty sprawl of buildings. No real grid going on: there's a big main boulevard with a kind of government building, a huge soviet-style hotel called THE ULAANBAATAR, a post office, and some other buildings on it, then from there it's all these meandering roads and little squares kind of circling around it. It's kind of surreal how _not_ like most cities it is. Winters are really harsh and long, so everything is built with that in mind. Amazing, beautiful place. And don't try to out-drink a Mongolian.", "score": 1},{"body": "yolks on you!", "score": 1},{"body": "Good Morning Vietnam... :(", "score": 1},{"body": "PLEASE! No more yolk yolks. ", "score": 1},{"body": "Faux chicken", "score": 1},{"body": "Please collab with howtobasic , thanks. ", "score": 1},{"body": "The Mouse owns Pixar. So same shit different label.", "score": 1},{"body": "Who takes pictures of their iced coffee??", "score": 1},{"body": "i stole the yolk", "score": 1},{"body": "No fuck him for being new!", "score": 1},{"body": "A Backsack", "score": 1},{"body": "Mouse owns Lamp but Lamp has freewill...\n\n", "score": 1},{"body": "I think this will be leggendary.", "score": 1},{"body": "Yolks on you.", "score": 1},{"body": "But that's the baby bird!  That's my favorite part! ", "score": 1},{"body": "What do you think is more likely: a person who has been using reddit for years takes a picture of his coffee for whatever reason and notices that it looks gigantic so he makes a post or a person who works for an advertising company paid for him to post a picture of his coffee to this particular subreddit? All because he didn't obscure the logo for some reason? If you choose #2, you should probably go outside and interact with people more because your brains are fried. Just because something can happen doesn't mean it's lurking around every corner, especially something that means so little in real life.", "score": 1},{"body": "Maybe in truth he's only a shell of a man.", "score": 1},{"body": "I was onboard up until that terrible pun. Sorry, eggman.", "score": 1},{"body": "Anyone can say \"Well this could happen, and you can't prove it doesn't\"\n\nYou need to prove it does happen\n\n", "score": 1},{"body": "Mine had 3, must have gotten mixed into it. ", "score": 1},{"body": "you should get your money back", "score": 1},{"body": "Obligatory \"Yo dawg, we heard you like towing stuff....\"comment.", "score": 1},{"body": "So many yolks for a yolkless egg ....... I'll see my way .", "score": 1},{"body": "Half of Norfolk chickens carry salmonella tbf mate. Could've easily been coincidence assuming your location fits your username", "score": 1},{"body": "Albumin.", "score": 1},{"body": "If a product requires these large and many instructions and still confuses people (I know from experience), then it's not a really good product..", "score": 1},{"body": "Maybe it had an eggstential crisis.", "score": 1},{"body": "Anyone can say \"This thing happens, and you can't prove it doesn't\"\n\nYou need to provide proof it does happen\n\n&gt;Just because someone covers up a murder really well doesn't mean it didn't happen.\n\nAnd that's not a very good analogy, when there's a murder, someone is dead and there's no arguing about it\n\nBut when a product is in a picture on Reddit, chances are it's just a coincidence, it's not guaranteed a company intentionally posted it", "score": 1},{"body": "I'm not sure that the answer is fully understood.", "score": 1},{"body": "What if that was your last egg? I'd be so pissed.", "score": 1},{"body": "There's no way someone would name their reddit account inaccurately. ", "score": 1},{"body": "Alaska or some other rural area not profitable to wire with cable. ", "score": 1},{"body": "ugh there's even hair... gross. ", "score": 1},{"body": "Whenever someone asks something like this, someone else usually says you have to have \"Reddit Enhancement Suite.\"\n\nI don't know what that is, but I want it. ", "score": 1},{"body": "On a roll. Yummy. Any breakfast roll without a tattie scone is just plain wrong. ", "score": 1},{"body": "[And a yellow pepper started growing on the green one](http://imgur.com/ovIfMEU)", "score": 1},{"body": "Is it me or does this seem to be happening a lot?", "score": 1},{"body": "I guess the *yolk's* on you then.", "score": 1},{"body": "Yes he did.", "score": 1},{"body": "That space popped outta nowhere, eh?\nEgg on your face!", "score": 1},{"body": "things you read on reddit that would get you institutionalized  for saying in public. Thank you so much for that comment you have made my day.", "score": 1},{"body": "I was really surprised to see this wasn't the only pepper post when I opened the subreddit.. But not as surprised as I was this morning when I cut open my pepper, so I thought I'd share anyway.", "score": 1},{"body": "Oh baby a tripple!\n", "score": 1},{"body": "FYI, green peppers, yellow peppers, and red peppers are all the same pepper, they're just different stages of ripeness.", "score": 1},{"body": "that's a lot of waste for a cracker company.", "score": 1},{"body": "Well, who came first?", "score": 1},{"body": "Not funny...", "score": 1},{"body": "\"couldn't resist\" may have been a better way to word that.", "score": 1},{"body": "There are also people who order them because they just don't like yolks. Don't stop judging anyone", "score": 1},{"body": "Was living in Geneva, Switzerland at the time.", "score": 1},{"body": "...so do most people?", "score": 1},{"body": "Maybe you can answer something for me.  Did you come first or did the chicken?", "score": 1},{"body": "What? Where? ", "score": 1},{"body": "Do you mean David cross?", "score": 1},{"body": "Dude. That is harshly interesting.", "score": 1},{"body": "Oh don't get me wrong--there's something uniquely satisfying about seeing pics like that and I'm glad you shared.  I've just seen this phenomenon happening a lot lately.  ", "score": 1},{"body": "You just cooked the egg savior!! All is lost. Who will deliver them from bondage now?", "score": 1},{"body": "Dammit, Monsanto!", "score": 1},{"body": "That's a cracker.", "score": 1},{"body": "reeeeight.", "score": 1},{"body": "It's a form of artistic expression symbolizing that we need energy to do the things we love, and coffee is the centerpiece of that energy. It's larger than our desire for the things in the background:\n\n* GameStop, symbolizing our desire to play games or have fun\n* ...Liquor Store? Errr... Symbolizing our desire to get wasted.\n\nIf you don't have the energy to do either of these things, then you won't enjoy your life to its fullest. Remember that the next time you guzzle down a gallon of your favorite beer: ensure you've had enough coffee to even out that sedative. Then you can have the energy to enjoy the feeling of being wasted.", "score": 1},{"body": "What keyboard is that? Looks kind of like a blackwidow ultimate but with pink lighting?", "score": 1},{"body": "That's actually really interesting! No wonder they all taste slightly different.", "score": 1},{"body": "&gt; Don't stop judging anyone\n\nThanks, I won't. ", "score": 1},{"body": "I didn't, but I can also see that.", "score": 1},{"body": "^ (*n*)eggy(*n*^2)me\n\nreally should be. ", "score": 1},{"body": "That's what *she* said", "score": 1},{"body": "Yes, it was giant. Yes, I did feel sorry for whichever of my hens laid it. ", "score": 1},{"body": "Take it back to where you bought it and demand a refund. It's the right thing to do. Hopefully if enough people come forward and complain about this disgusting trend egg suppliers might finally stop trying to cheat us out of delicious yolks. ", "score": 1},{"body": "\"Ugh, these eggs are disgusting. This chicken should be ashamed of itself.\"\n\n— Kramer (Seinfeld - The Little Jerry)", "score": 1},{"body": "It's like a giant, fuzzy caterpillar. Look at how cute it is!", "score": 1},{"body": "[Here's the story of rape by \"Bert\" Massey in 1915 in Toronto, Canada,](http://torontoist.com/2013/02/historicist-a-massey-family-murder/) who was the son of Charles Albert Massey. I don't know if Bert was CAB II, or if CAB II was his brother, or if this Massey family is totally not related to the rapist in the washington post article.\n", "score": 1},{"body": "Newfags can't\n\n \n\n \n\nQuintuple-space.", "score": 1},{"body": "I'm surprised they haven't genetically modified some hens to not produce a yolk in their eggs. I'm sure it would be popular among some people, like body builders who eat tons of egg whites.\n\nOf course they have \"eggbeaters\" in a container, but this could be cheaper and feel less processed. ", "score": 1},{"body": "http://www.reddit.com/r/pics/comments/1odhj4/giant_purple_indian_squirrel/\n\nThere are already purple squirrels.", "score": 1},{"body": "\"Fuck you and your breakfast.\" \n\n- Chicken", "score": 1},{"body": "I once had a whole carton full of eggs which all had 2 yolks", "score": 1},{"body": "I bet they're good", "score": 1},{"body": ":3", "score": 1},{"body": "E=mcEgg?", "score": 1},{"body": "I presume he heard it over the hollandaise ", "score": 1},{"body": "How did you get salmonella poisoning? Did you cook it? If so, why didn't cooking it kill the bacteria?", "score": 1},{"body": "The white is the embryo, the yoke is the food.", "score": 1},{"body": "Yolk can still eat it though!", "score": 1},{"body": "Can't you add them as a friend or something?", "score": 1},{"body": "No-yolkers are called \"dwarf\", \"wind\" [or, more commonly, \"fart\"] eggs.  Such an egg is most often a pullet's first effort, produced before her laying mechanism is fully geared up.  In a mature hen, a wind egg is unlikely, but can occur if a bit of reproductive tissue breaks away, stimulating the egg producing glands to treat it like a yolk and wrap it in albumen, membranes and a shell as it travels through the egg tube.  ", "score": 1},{"body": "That was anti-climatiegg ", "score": 1},{"body": "The egg white turns into the chicken, the yoke is the food.", "score": 1},{"body": "The egg. Duh. Evolution, man. ", "score": 1},{"body": "That's still better than 5kb/s dial-up.", "score": 1},{"body": "Chinese fakes.", "score": 1},{"body": "\"Release me from this prison or face my wrath\"", "score": 1},{"body": "9 MPG, Oh the humanity!", "score": 1},{"body": "Keflavik (Reykjavik) airport in Iceland?", "score": 1},{"body": "Melt them down and make a brick. ", "score": 1},{"body": "Serious question. What does a darker color yolk mean? I've taken pictures over the last month or so and I've noticed 1 outta ~20 eggs I eat has a dark color yolk. Is sams club selling me fake eggs ? ", "score": 1},{"body": "http://33.media.tumblr.com/f6b42a82f6db1d8fe456d69079e66b60/tumblr_n16lssFUq31sd5eo5o3_500.gif", "score": 1},{"body": "The white is the part that turns into the chicken...", "score": 1},{"body": "find the source, and selectively breed!", "score": 1},{"body": "Was mostly cooked. I like my eggs slightly run. Or did anyway. ", "score": 1},{"body": "Definitely don't google image search. Smegma is \"dick cheese,\" more commonly seen with uncut guys who don't clean well enough under their foreskin.", "score": 1},{"body": "I think the webmaster is stuck in the 90s.", "score": 1},{"body": "Holy shit can we stop posting these?", "score": 1},{"body": "I think it's just metal with some crazy laser engravings ", "score": 1},{"body": "Or maybe he wanted to give OP salmonella poisoning.", "score": 1},{"body": "no! its more like a Siamese twin", "score": 1},{"body": "So that's what those two lump are...", "score": 1},{"body": "So one of those Egg Council creeps got to you too, huh?", "score": 1},{"body": "That's some horrible Google translating right there. \n\n", "score": 1},{"body": "Guess the yolks on you\n\n\nI'll show myself out", "score": 1},{"body": "This is how they get White Meat chicken.", "score": 1},{"body": "Good point", "score": 1},{"body": "I think he's pretty runny.", "score": 1},{"body": "Was at the lady friend's parents house and they had eggs offered to us in the morning to cook if we wanted.  I cooked them and put them in a bagel sandwich... I noticed right away the egg white was super rubbery but didn't want my first visit with the parents to go bad, so just choked it down.  Thankfully did not get sick, but it was painful to choke down.", "score": 1},{"body": "Banana for scale.", "score": 1},{"body": "What's really crazy is, if you close one eye and look at the picture from a distance it actually looks just like blatant advertising. Amazing.", "score": 1},{"body": "No yolk doesn't mean salmonella. That's a coincidence. ", "score": 1},{"body": "always been hella attractive ", "score": 1},{"body": "He's at it again!", "score": 1},{"body": "He's an offical egg. He wants the eggs to win.", "score": 1},{"body": "What the devil are you doing, stealing ideas from others?", "score": 1},{"body": "French has no verb, it's just written \"the flush\".", "score": 1},{"body": "Why? ", "score": 1},{"body": "His joke looks all white. ", "score": 1},{"body": "/r/iamverysmart", "score": 1},{"body": "Satellite is global.", "score": 1},{"body": "Looks like the yolk is still in the bottom shell in your hand. Liar!", "score": 1},{"body": "A major defect is going to change best cooking practices, which aren't formed on the basis of \"if you're cooking something that is nothing like what this product should actually be.\"", "score": 1},{"body": "Don't eat that.", "score": 1},{"body": "A defect. If the egg would have been fertilized the baby would have starved. You just saved a baby's life because you stopped that egg from being fertilized. Good job. (No sarcasm I swear)", "score": 1},{"body": "Um, no. Unfertilized eggs have yolks, like all the grocery store eggs. ", "score": 1},{"body": "And I got the double double[caption](http://imgur.com/IHjwfPp.jpg)", "score": 1},{"body": "That's a completely different thing...", "score": 1},{"body": "That looks mildly racist...", "score": 1},{"body": "A bowl of ham, bacon, and melted cheese doesn't sound too bad.", "score": 1},{"body": "Looks like an eggbortion to me", "score": 1},{"body": "Eggs without yolk are called \"dwarf\" or \"wind\" eggs.[2] Such an egg is most often a pullet's first effort, produced before her laying mechanism is fully ready. In a mature hen, a wind egg is unlikely, but can occur if a bit of reproductive tissue breaks away, stimulating the egg-producing glands to treat it as a yolk and wrap it in albumen, \"membranes and a shell as it travels through the egg tube. This has occurred if, instead of a yolk, the egg contains a small particle of grayish tissue. This type of egg occurs in many varieties of fowl, including chickens (both standard and bantams), guineafowl and Japanese (Coturnix) quail.\" -\"Cock Egg.\" Wikipedia. Wikimedia Foundation, n.d. Web. 30 Jan. 2015.  \n\nhttp://en.wikipedia.org/wiki/Cock_egg\n", "score": 1},{"body": "Must be. I'm not expert. It was later that day I went to a&amp;e though. ", "score": 1},{"body": "[](#placeholder-awb)Comment is being processed... It will be automatically replaced by new text within a minute or will be deleted if that fails.", "score": 1},{"body": "He's all white now.  \n  \nEdit: Guys, stop! I'm not yolking!", "score": 1},{"body": "this may not apply to eggs from the grocer, but I have chickens and they sometimes lay eggs without yolks and they are fine to eat! they sometimes just get flustered and poop out an egg before the yolk forms. they're usually really tiny and cute and are called witch eggs!", "score": 1},{"body": "That you HowToBasic?", "score": 1},{"body": "You sound pretty paranoid.", "score": 1},{"body": "I am cracking up.", "score": 1},{"body": "The yolk is the ovum, a single cell. Most chicken eggs you buy are unfertilized.\n\nIts best to think of chicken eggs as chicken periods.\n\n", "score": 1},{"body": "I didn't cook it, but I suppose when cooked it'd just be a spaghetti that's (a bit more than) twice as long...", "score": 1},{"body": "Sorry bro, but this dude is official. ", "score": 1},{"body": "ELI5?", "score": 1},{"body": "You are the most eggiest, my lord", "score": 1},{"body": "Ewwww........", "score": 1},{"body": "/u/OfficialEgg", "score": 1},{"body": "thats nice product!", "score": 1},{"body": "Holy shit, that subreddit is literally the thing it hates, and I love that.", "score": 1},{"body": "Egg.", "score": 1},{"body": "Jerry! These guys write stuff off all the time! ", "score": 1},{"body": "Wow this is pretty serious. Or in other words, its no yolk.\nI'm sorry.", "score": 1},{"body": "Well here in the UK they've started expanding the fiber network to the countryside. Then again, it is a much smaller country.", "score": 1},{"body": "This is the End?", "score": 1},{"body": "It there a non-busy chipotle-made burrito for scale?", "score": 1},{"body": "[Here you go.](http://redditenhancementsuite.com/)", "score": 1},{"body": "That's scary! like....really scary. ", "score": 1},{"body": "CTRL+F, 53 instances of Yolk. . . \n\nnah we good.", "score": 1},{"body": "Poultryhelp.com. I can just tell this guy lives on some farm with a bad internet connection.", "score": 1},{"body": "And now my phone has salmonella!", "score": 1},{"body": "I used to drink Naked drinks a lot for breakfast.  I got one and it tasted a little off, I was like... screw it, these are expensive, and I drank it anyway.   \n\nI got the worst food poisoning ever.   I can't even look at those drinks now.", "score": 1},{"body": "Racist, that's not a rotten part of the onion as if the lily white parts were somehow better.\n\nThat brown part, I'll have you know, is the heart of the onion and the reason for its existence, sorta like the heart of Africa is home to emergence of our species.\n\nWithout that brown heart that onion is nothing more than a wimpy scallion or a scrawny shallot. \n\nStop oppressing us with your white onion privilege!", "score": 1},{"body": "contrachickceptive\n", "score": 1},{"body": "Because I don't eat eggs at all. ", "score": 1},{"body": "Is this a store egg or one from a farm?  I'd be surprised if an egg like this would get past the automated quality assurance that goes into store eggs.  Defective eggs are not uncommon but get screened out.", "score": 1},{"body": "I usually eat burritos shortly after I buy them.  There is only one scale ever needed: the banana. ", "score": 1},{"body": "In pretty sure I got your missing yolk in my double yolk egg.", "score": 1},{"body": "Yeah,goid advice not to eat food that isn't \"right\". But almost no chance of contracting salmonella from raw egg. No chance from cooked. ", "score": 1},{"body": "Please expound....\n I'm not confused by it either....", "score": 1},{"body": "Einhen?", "score": 1},{"body": "I'm too lazy to scroll back up, can someone tell me OP's name?", "score": 1},{"body": "Budum... tisssh!", "score": 1},{"body": "I think they want you to clean your laundry and then off yourself. ", "score": 1},{"body": "After 20 years of marriage, I did, once again... She was not pleased ", "score": 1},{"body": "That sounds like it was just a coincidence. I can't blame you for not wanting to eat one after what happened to you. I got salmonella omw to my Homecoming dance years ago, pretty sure it was from a Spanish Omelette, haven't had one since.\n", "score": 1},{"body": "Of course someone upvoted it because Starbucks is in it. That's the whole idea. If you don't think that there are accounts devoted to upvoting corporate labels of companies that they work for then you are sadly mistaken. I suggest visiting /r/hailcorporate and looking at some prime examples of this happening.", "score": 1},{"body": "If only they came with Adderal as well. ", "score": 1},{"body": "It was full of hen cum.", "score": 1},{"body": "I'm in Northern California but in a rural area.", "score": 1},{"body": "Lots of mildly interesting peppers today. This one is my fave.", "score": 1},{"body": "You're not lyin', but wouldn't it be closer to 35kb/s?", "score": 1},{"body": "I didn't make it, don't ask me. Haha", "score": 1},{"body": "ayy lmao", "score": 1},{"body": "is this a yoke?!", "score": 1},{"body": "True but it is more expensive than what I have now for comparable speeds.", "score": 1},{"body": "Of course there are accounts like that, but the OP of this post obviously isn't one of them.\n", "score": 1},{"body": "I call BS - there's no way. My chipotle would never do this to me! Looks more like you ate half and re-wrapped it. ", "score": 1},{"body": "(n)eggy (p+2)lease", "score": 1},{"body": "Guess the yokes on you.", "score": 1},{"body": "Hey! Just because we're eggs doesn't mean we're not human! We do have genders you reggcist!", "score": 1},{"body": "Don't remember if it's ultimate but the lights cycle through different colors. It isn't a mechanical", "score": 1},{"body": "This isn't mildly interesting. This is pure /r/HailCorporate\n\nYou are a student and my target audience. Buy my product.", "score": 1},{"body": "Swegg", "score": 1},{"body": "Looks like you really fowled up breakfast.", "score": 1},{"body": "That's so strange, I wonder why that happens", "score": 1},{"body": "Yeah I probably would of just eaten it, lol", "score": 1},{"body": "They don't\n\nSource: former egg turned baby", "score": 1},{"body": "ME with guitar:  I gave OP an egg...that had no yolk.... I gave OP... \nOP [grabs guitar and smashes it against wall] Sorry.", "score": 1},{"body": "The yolks write themselves.", "score": 1},{"body": "But what if that's a giant banana?", "score": 1},{"body": "&gt; This gave rise to the myth that when a cock's egg was hatched, it would produce a cockatrice, a fearsome serpent which could kill with its evil stare. \n\nLmao", "score": 1},{"body": "(psst... That's not \"her\" leg!)", "score": 1},{"body": "Really, you think it's impossible to have a short burrito?  I'll even offer up the possibilities of no rice, no beans, or whatever.  All are more likely than \"oh my beloved corporation would never shortchange little ol' me.\"  -__-  \n\nThey were busy and screwed me over.", "score": 1},{"body": "&gt; Redditor for one hour?\n\nAnd already more loved than you.\n\n^And ^me. ^=(\n", "score": 1},{"body": "Hey man, I'm on my bulk and the whites are killer when it comes to protein / calories ratio. ", "score": 1},{"body": "I had no idea National Poison Prevention Week was a thing! Makes perfect sense that it's the same week as St. Patty's Day and the first day of spring. It reminds me that I should prevent alcohol poisoning AND that I shouldn't ingest any cleaning products while I do my spring cleaning. This is genius! ", "score": 1},{"body": "Thats a great joke for a Fry-day", "score": 1},{"body": "Does it taste old by chance?", "score": 1},{"body": "BRING BACK THE &lt;BLINK&gt;", "score": 1},{"body": "You can still get salmonella from cooked eggs if they aren't handled correctly and aren't *completely* cooked to at least 160 degrees. No one cooks their eggs to that temperature because they turn out dry and rubbery and, even if they do, they don't cook every part to that temperature.", "score": 1},{"body": "Probably need another comma after humans.", "score": 1},{"body": "here's a crazy notion: we can't stop people from abusing reddit, but instead of getting them to fuck off, just... don't purchase drinks at starbucks.\n\nthe massive persecution complex reddit has about BEING LIED TO and THEY'RE TRYING TO DECEIVE US and WE MUST PREVENT OTHERS FROM BEING DUPED TOO, HEROES is fucking ridiculous, and it's like people think others are just so goddamn flimsy that they'll succumb and be snookered by bullshit, like a photo of a logo, or an errant review on a game site, and then attack the shit out of anyone involved with it because they're DECEIVING THE PUBLIIICCCC \n\ncalm down folks, control yourself and hope that sets an example for others, their actions are not on your shoulders, you are not batman", "score": 1},{"body": "West Bromwich? ", "score": 1},{"body": "who thought this was a good idea to manufacture? better yet, who thought this was a good idea to purchase? what the fuck", "score": 1},{"body": "There is only one scale ever needed:  [the banana.](http://i0.kym-cdn.com/photos/images/original/000/661/763/cb1.jpg)", "score": 1},{"body": "I had an egg with 5 yolks in it once. \n", "score": 1},{"body": "I think it's funny. What the matter, can't take a *yolk*?", "score": 1},{"body": "&gt;You're a wiser ~~man~~ woman than I was. (going by the structure of fingers and the nails)", "score": 1},{"body": "You can still get salmonella from cooked eggs if they aren't handled correctly and aren't completely cooked to at least 160 degrees. No one cooks their eggs to that temperature because they turn out dry and rubbery and, even if they do, they don't cook every part to that temperature.", "score": 1},{"body": "That's just a wall with a handle now", "score": 1},{"body": "You can still get salmonella from cooked eggs if they aren't handled correctly and aren't completely cooked to at least 160 degrees. No one cooks their eggs to that temperature because they turn out dry and rubbery and, even if they do, they don't cook every part to that temperature.", "score": 1},{"body": "oeuf, enough already!", "score": 1},{"body": "/r/IAmNotAFish more like. I mean fucking honestly. Are you going to look down on people for knowing basic addition next?", "score": 1},{"body": "You should return it for a refund", "score": 1},{"body": "Her?", "score": 1},{"body": "\"Good taste\" or tastes good?", "score": 1},{"body": "I love all the egg jokes on here. You all are a bunch of Comedi-hens!", "score": 1},{"body": "Because (as another Redditor in this thread pointed out) the egg is poisonous and will most likely give you salmonella poisoning.", "score": 1},{"body": "Finally, my pc's gaming capabilities are like that of real life!", "score": 1},{"body": "You've got to be yolking me", "score": 1},{"body": "It may appear that way but in actuality she's just squeezing her legs together cause she has to pee so bad. ", "score": 1},{"body": "or just separate the the yoke from the whites.  I do that some of the time.", "score": 1},{"body": "Oh god. ", "score": 1},{"body": "Yes it does.", "score": 1},{"body": "\"Hey...\"\n\n\"What?\"\n\n\"You've got a set of balls on your back.\"\n\n\"Yeah...I know.\"\n\n\"Okay.\"", "score": 1},{"body": "Haha, yolk's on you!", "score": 1},{"body": "Reminds of when you search zerg rush in goggle.", "score": 1},{"body": "I am so glad the manufacturer chose not to install a zipper.", "score": 1},{"body": "The brown part just needs to pull itself up by its bootstraps.  It shouldn't expect the white part to help it out.", "score": 1},{"body": "Pretty sure it might mean how fresh the egg is.  Eggs straight from a chicken usually have a yolk that's practically orange.  As the egg ages, it loses it's dark colour. The lighter the yolk, the older the egg.  But it might also have to do with breed of chicken and feed and stuff, so don't quote me on it. :)", "score": 1},{"body": "He's familiar with some eggs in some places, but not all ova. ", "score": 1},{"body": "Honestly you're an idiot if you even remotely care about it. If you don't want Starbucks, don't buy it.", "score": 1},{"body": "I have the same pc case &lt;3", "score": 1},{"body": "No it doesn't. ", "score": 1},{"body": "It's a good thing you brought your super unnecessarly HD camera with port and starboard  attachments", "score": 1},{"body": "Ooh, a double-yolked post!", "score": 1},{"body": "Some funky flavors are good ideas... this **isn't** one...", "score": 1},{"body": "What were you eggspecting?", "score": 1},{"body": "We dont know if he beat her or not\n\nbut damn is op looking suspicous ", "score": 1},{"body": "That moment when you're grossed out by the very object you want to poke more than anything.", "score": 1},{"body": "TIL a lot of people don't realize that roosters have *nothing* to do with chickens laying eggs that we eat. Chickens lay eggs regardless of whether a rooster is around. Think of those tasty scrambled eggs as \"chicken periods\".", "score": 1},{"body": "Broadband got redefined, didn't it? ", "score": 1},{"body": "You just can't trust those fresh farm raised eggs I tell Ya.", "score": 1},{"body": "Bloodstain near the knife is pretty scary.", "score": 1},{"body": "Not unless you add an \"as\" to the front of \"humans.\"", "score": 1},{"body": "Why isn't s/he hibernating?", "score": 1},{"body": "It's because someone got the double yolk.", "score": 1},{"body": "I bet that stuff actually came from YOUR egg sack.", "score": 1},{"body": "Solas?", "score": 1},{"body": "*drops an anvil on your head*.", "score": 1},{"body": "Happy Egg from a Tesco. ", "score": 1},{"body": "I mean rates of salmonella in eggs are estimated around 1 in 20000 and most digestive issues are not likely due to salmonella. You're more likely to get problem eggs from other food borne bacteria in your refrigerator or from improper handling.", "score": 1},{"body": "Wow.. you weren't \"Yolking\"! :)", "score": 1},{"body": "This person got a raw deal when she bought these eggs. \nIt's not something to yolk about.", "score": 1},{"body": "\nIs that thing hanging in the middle a piercing?  ", "score": 1},{"body": "Hey, if you want a big set of hairy balls hitting you in the back all day, that is your business and I am not going to judge.  ", "score": 1},{"body": "I think it makes it difficult to poop though", "score": 1},{"body": "Even whole milk works pretty well in root beer (I don't know about diet or orange). The down side is that I'm likely to drink a lot more of it that way.", "score": 1},{"body": "That's because it's coiled, which is how induction is created.", "score": 1},{"body": "A creepy little swan", "score": 1},{"body": "Oh God this thing is revolting, Where can I buy one.?", "score": 1},{"body": "Okay, so he gets 25 Mbps. Still don't see how it's relevant to the guy getting 600 Kbps", "score": 1},{"body": "igga/lease = p/n", "score": 1},{"body": "MildyInteresting: This gets posted every week atleast.", "score": 1},{"body": "If you say so buddy.", "score": 1},{"body": "Even whole milk works pretty well in root beer (I don't know about diet or orange). The down side is that I'm likely to drink a lot more of it that way.", "score": 1},{"body": "/r/mildlyracist", "score": 1},{"body": "I almost get pickpocketed there, not too long after taking that picture \n\nOh, the red night shot was tricky too, I almost got run over by someone", "score": 1},{"body": "You're picking up what I'm putting down. Well done sir.", "score": 1},{"body": "You should post this on /r/funny because there is no yolks. ", "score": 1},{"body": "You should save your self cutting for at home OP.", "score": 1},{"body": "There you go, it doesn't :)", "score": 1},{"body": "Regardless, I'm not wrong...\n\nI like my eggs runny, but if you don't cook your eggs thoroughly you risk getting salmonella... regardless of if it has a yolk or not.", "score": 1},{"body": "probably stolen by that science-guy who did the AMA the other day", "score": 1},{"body": "It's just the Scotsman's bathroom. ", "score": 1},{"body": "[Word cloud out of all the comments.](http://i.imgur.com/JJGalzD.png)\n\nDon't like this? Message me!", "score": 1},{"body": "You sir, activated the black hole in our earth...", "score": 1},{"body": "What are you, chicken?", "score": 1},{"body": "Looks like a loogy", "score": 1},{"body": "/r/shittyaskscience?", "score": 1},{"body": "This isn't anything new, chegg sends out redbull, deodarant, razors, even small bottles of body spray. Not that I'm complaning... im fuckin broke =/", "score": 1},{"body": "/r/shittyaskscience", "score": 1},{"body": "What came first, you or the chicken?", "score": 1},{"body": "This can be faked you know. ", "score": 1},{"body": "As you can see, it's my first post. I'm not on this sub a lot, so when I saw it I thought it was \"mildly interesting\". Guess I'll check next time. ", "score": 1},{"body": "It's the robot from The Jetsons", "score": 1},{"body": "Old eggs aren't the problem, but improperly handled ones. Eggs last between 4 to 8 weeks if properly refrigerated, though they do degrade in quality.\n\nIt is highly unlikely to contract salmonella from eggs and I like my eggs sunny side up or poached. I also frequently make drinks that contain raw egg and make my own mayonnaise (which is just raw eggs and oil pretty much). I'm not saying it's common. \n\nI *am* saying that there is still a *chance* to contract salmonella. Telling people to just \"cook their eggs\" isn't good, especially if they're preparing food for people with immune issues like pregnant women, the elderly, or those with compromised immune systems.\n\nAlso, you're far more likely to catch salmonella from cross contamination since the bacterial colonies tend to form on the outside of the egg shell. People crack their eggs to poach and, while that's going, use the same unwashed hands to toss their salad. Then when they get sick, they blame the undercooked eggs rather than the cross-contamination.", "score": 1},{"body": "Being this stupid, should be a crime.", "score": 1},{"body": "Problem solved now you can forget about them.", "score": 1},{"body": "Count Peppula", "score": 1},{"body": "was expecting truckpackingtruckpackingtruckpackingtruckspackingtrucks from The Simpsons, not dissappointed", "score": 1},{"body": "it looks so goddamn offended.\n\n*how fucking dare you.*", "score": 1},{"body": "Nah, just my Note 4. Has a beastly camera", "score": 1},{"body": "Maybe or maybe 'it' is better as it has no sex organs.  Well none that i have seen anyway.", "score": 1},{"body": "(\\'-')\\ \n\n*Leaves without washing hands*", "score": 1},{"body": "You stole that guy's yolk!", "score": 1},{"body": "\"Eggs are bad\" always lacked truthiness to me, so I felt vindicated when nutritional science pulled their heads out of their assess. Same thing happened with salt. ", "score": 1},{"body": "n(lease)^(-1) = p(igga)^(-1)", "score": 1},{"body": "Why you chose to take a picture of it on a surface that is the exact same color, we'll never know.", "score": 1},{"body": "... but it was delicious", "score": 1},{"body": "Am I the only one who feels like this doesn't look like Arnold? Like, at all?", "score": 1},{"body": "Real life master race", "score": 1},{"body": "ebola", "score": 1},{"body": "and i was picking up a to-go order for someone, i do not love sprouts that much.", "score": 1},{"body": "It's supposed to be.  It's for children or shorter people.  Most of the time they're even lower than that.", "score": 1},{"body": "He thought, as I did until reading your comment, that they cut them after cooking. Man we're dumb.", "score": 1},{"body": "Seems fair.  If someone somehow thinks $25 is a justifiable price for a salad, then the extra $.69 for a worker's healthcare is nothing.", "score": 1},{"body": "I was trying to reply to you both, in a way. Your parent commenter worded his as if to say he's in the kb range.", "score": 1},{"body": "How eggs-traordinary", "score": 1},{"body": "I'd look like a fucking samurai^tom cruise in the last samurai.", "score": 1},{"body": "Looks more like Reagan", "score": 1},{"body": "nothing like LA restaurant prices.", "score": 1},{"body": "But just look at those feet!", "score": 1},{"body": "Must of come from the south with all the \"teeth\" it has", "score": 1},{"body": "In Japan there are some people known as gaijin hunters who seek out American \"friends\" so they can practice their English. ", "score": 1},{"body": "What a rip off", "score": 1},{"body": "Pump the brakes.", "score": 1},{"body": "There's about 3 ounces of actual coffee in the cup", "score": 1},{"body": "Your egg is stupid.", "score": 1},{"body": "Gonna throw off your macros for the whole day, but it does appear to be a gift from Brodin.", "score": 1},{"body": "Could be one of them fake eggs. ", "score": 1},{"body": "QUICK! Find the chicken that laid that so we can breed a new race of yolkless chickens!\n\n...Wait.", "score": 1},{"body": "The 7th egg from the 7th chicken.", "score": 1},{"body": "You can't possibly be saying the French language has no verbs correct?", "score": 1},{"body": "I've seen shorter, but 2 inches just seems pointless. ", "score": 1},{"body": "its vegetarian i guess", "score": 1},{"body": "If you consume 1 dozen raw eggs per week for the next 30 years you should come across one the that has SE. If you handle that egg properly (refrigeration). cook it properly, and have a normal immune system you have essentially no chance contracting salmonella. \n", "score": 1},{"body": "Sorry. Deleted because it violated Rule 4.", "score": 1},{"body": "Wait is that proof they're making fake eggs now?", "score": 1},{"body": "I gave my love a chicken that had no bone....", "score": 1},{"body": "I think we can all agree that eggs are mildly interesting", "score": 1},{"body": "I don't even see it a little bit.", "score": 1},{"body": "The before and after photos are inspiring....but I wonder if he could have done it without (a) dedicated trainers, (b) freedom from working, and (c) that dangling carrot of hundreds of dollars!", "score": 1},{"body": "This is insane. You have 4 posts and I stumbled upon two of them today in completely unrelated subs (here and /r/fitness).", "score": 1},{"body": "Except it's not, it goes right back into the next batch.", "score": 1},{"body": "That's what she said!", "score": 1},{"body": "Then use substitution in the sentence: Please clean my house.", "score": 1},{"body": "Well, 3.5 years.  I was just giving an alternative option for how the picture came about.", "score": 1},{"body": "Those crackers or whatever look like feminine pads.", "score": 1},{"body": "Ah murphy's law in action. ", "score": 1},{"body": "I see where you're coming from now. It's still just weird, since the majority of people don't think of broadband as kb range even before the redefinition.", "score": 1},{"body": "That seems really disgusting", "score": 1},{"body": "Yolk's on you!", "score": 1},{"body": "If you're cold, they're cold, let them inside.", "score": 1},{"body": "Holy shit. It's 2015.\n\nSorry everyone; I just had a moment.", "score": 1},{"body": "Only if you ate it raw?", "score": 1},{"body": "One time i ate one and next thing i know I'm running down the street in my draws and wake up in a pigeon coupe. Aint been right ever since", "score": 1},{"body": "Or you're frickin weird.", "score": 1},{"body": "That would be memorizing while drying my hair in the corner.  I haven't seen one of those in years.", "score": 1},{"body": "Would you say it's no yolk to eat eggs with no yolk?", "score": 1},{"body": "That's goddamn tragic.", "score": 1},{"body": "It's for children.", "score": 1},{"body": "I'll believe it... But only because I want to.", "score": 1},{"body": "ask and I shall answer.  Obviously some questions won't be answered, but I shall attempt to humor you for as long as possible", "score": 1},{"body": "Thank monsanto", "score": 1},{"body": "A rare steak is still a cooked steak. There's the colloquial food definition of \"cook\" and there's the chemical definition, most people mean the latter when the talk about cooking.", "score": 1},{"body": "this thread is so scrambled", "score": 1},{"body": "What are you putting in the cup? Lead or feathers? They'll be quite different weights though they take up the same volume.\n\n", "score": 1},{"body": "You won man!", "score": 1},{"body": "Circle broke is self aware though. Read the side bar, tab at the top, and the smug cartoon guy at the bottom.", "score": 1},{"body": "Interesting you bring this up...\n\nAs we all learn from a young age, multiplication and exponentiation are defined recursively. That is to say, if *m* and *n* are positive integers, we have:\n\n*m* \\* *n* = *m* + *m* + ... + *m* (where the number of *m*s in that expression is *n*)\n\nand\n\n*m*^*n* = *m* \\* *m* \\* ... \\* *m* (again, with a total of *n* *m*s in that expression).\n\nAs far as positive integers are concerned, these can be taken as *definitions* of multiplication and exponentiation (and are usually presented as such in elementary education). Notice that addition is presented as the *foundational* operation, since multiplication has been defined as repeated addition, and exponentiation has been defined as repeated multiplication, which incidentally makes it a form of repeated addition as well. So we can say that addition is the *first* operation, multiplication the *second*, and exponentiation *third*, in some sort of hierarchy where the next operation is *n*-fold repetition of the previous one. Then you might ask, can we continue this hierarchy beyond exponentiation? Certainly. The fourth and fifth operations are naturally called \"tetration\" and \"pentation\", from the Greek numeral prefixes for *fourth* and *fifth*. Being of little practical use, there is no standardized notation for tetration and pentation, but tetration is usually denoted by putting the index (called a \"hyperpower\") before the base, instead of after (in contrast with exponentiation). Thus, we have:\n\n^*n* *m* = *m*^(*m*^(...^*m* ) ) (*n* times)\n\nFor positive integers *m* and *n*. (Notably, the extension of tetration to non-integer numbers is not quite settled, for more info see wiki). And similarly with pentation.\n\nWe can continue this hierarchy forever. But here's something interesting: we know that 2+2=4, 2\\* 2=4, and 2^2 =4. But it turns out that the the operation of 2 with itself is equal to 4 *for all* operations in the infinite hierarchy. Why is this true? Well, suppose that we have 2 operated with 2 equals 4 for the *N*th operation in the hierarchy. Then 2 operated with 2 in the (*N*+1)th operation is given by: 2 operated with itself 2 times, with the *N*th operation. But we already supposed that this is equal to 4! If you are familiar with mathematics, you should realize that I've just made an inductive argument; this proves that 2 operated with itself equals 4 for all operations in the hierarchy.\n\nNow earlier I said that addition was the foundational operation. But it happens that addition itself can be represented as repetition of some other operation: this \"more foundational\" operation is called *zeration*, the *zeroth* operation. Again, there is no standardized notation, but here I'll use the \"at\" symbol @. Due to some technical aspects, I have to refer to the \"successor function\" S, which gives the next integer. So S(0)=1, S(1)=2, S(S(1))=S(2)=3, S(98)=99, etc. Then zeration has the following peculiar definition:\n\n*m* @ *n* = S(m) (if m&gt;n) **or** S(n) (if n&gt;m) **or** S(S(m)) (if m=n)\n\nAnd, as you can prove for yourself, addition can be *constructed* from zeration, as follows:\n\n*m* + *n* = *m* @ *m* @ ... @ *m* (*n* times).\n\nNotice that even in zeration, we have 2@2=4.\n\n(You might ask, can we go further backwards, with negative operations? The answer is no, and it's pretty easy to prove yourself. Assume that a \"-1\"th operation exists, for example, and you will eventually find a paradox, meaning that such an operation cannot exist. However, we can extend the ordinary number system to allow such a thing to exist, similarly to how we have complex numbers for inversion of exponentiation.)\n\n**tl;dr** the \"2edgy4me\" meme generalizes to \"*n*edgy(*n*P2)me\", where P is any operation in the infinite hierarchy of operations described above.", "score": 1},{"body": "Can someone please find/photoshop a Pigeon *Coupe*?", "score": 1},{"body": "That's how they get ya", "score": 1},{"body": "mercury's in retrograde. ", "score": 1},{"body": "No it doesn't", "score": 1},{"body": "Apparently the fact that the real world has no rules on product placement really bothers this guy. \n\nSent from my iPad", "score": 1},{"body": "Fat in general is not bad for you. They're a better source of calories than carbs. The only one you really need to watch out for is trans fat. And less calories doesn't necessarily mean healthier. ", "score": 1},{"body": "Nor did I, I agree the redefinition was long overdue.", "score": 1},{"body": "Sugar. I was tired and didn't think about obvious things like the difference between mass and volume. I just wanted to know how many cups of sugar were in my juice. ", "score": 1},{"body": "I know!  I was confused at first because it was my first attempt at a computer build, and was wondering why it came with so many screws.", "score": 1},{"body": "It's not just \"cook\". It's \"handle properly and cook thoroughly to 160 degrees throughout the egg\".", "score": 1},{"body": "i suspect Cicada 3301", "score": 1},{"body": "It's a shady way to force the consumer to tip a mandatory \n\nHealthcare expenses are business expenses, already accounted for in the backoffice. Putting it in a bill for the *client* is intentionally to make a statement.\n\nSimilar to [greenwashing](https://en.wikipedia.org/wiki/Greenwashing).\n\nIt's awesome that a business is paying for health, but not the reason for putting it on a customer's bill.", "score": 1},{"body": "&gt; this could be prevented by throwing the egg over the family dwelling so it smashed at the other side without touching the roof. \n\nIs it really necessary to throw it over the family dwelling?\n\nCan't you just crack it and mix it with the chicken feed?", "score": 1},{"body": "Googled cause I was curious. Found this on a farmer's comment page: \n\n\n\"......More commonly occurs in young pullets but can happen in mature hens when ...a bit of reproductive tissue breaks away, stimulating the egg producing glands to treat it like a yolk and wrap it in albumen, membranes and a shell as it travels through the egg tube.\" ", "score": 1},{"body": "[](#placeholder-awb)Comment is being processed... It will be automatically replaced by new text within a minute or will be deleted if that fails.", "score": 1},{"body": "Ahhhh, yes. HowToBasic.", "score": 1},{"body": "What's the point of an egg without yolk anyway. ", "score": 1},{"body": "Tagged as \"surprise ninja maths professor\"", "score": 1},{"body": "i guess where i'm getting the waste idea is that it's baked. clearly it should have gone back in the hopper with the rest of the dough before the baking process. i see it now.", "score": 1},{"body": "Did you cook it all the way through?", "score": 1},{"body": "Lol yeah. Its a house full of women who don't trust anyone else with their hair. We're prepared. ", "score": 1},{"body": "Businesses pass those expenses on to consumers anyway.  At least this one is open about it.", "score": 1},{"body": "I use the short ones because it keeps my dick from dangling in the water.", "score": 1},{"body": "If you used to be him?", "score": 1},{"body": "Same here.. But at least I got a tide detergent package and a red bull! (The red bull was useless to me because I quit drinking energy drinks this year)", "score": 1},{"body": "Coming soon: The back to the future reboot \"2 future 2 furious\".", "score": 1},{"body": "&gt; shady way to force the consumer to tip a mandatory amount.\n&gt; Healthcare expenses are business expenses\n\nAll expenses are passed onto the consumer and if there is profit left over the business stays open. If not, the business is closed. Simple. \n", "score": 1},{"body": "How do I know you didn't just take the yolk out ehh...\n", "score": 1},{"body": "That's awesome they never send enough screws. ", "score": 1},{"body": "That still doesn't help some of us.  We have to go for the [floor urinals] (http://www.urinal.net/winco_foods/ud3.jpg).", "score": 1},{"body": "I got a double double!\nhttp://imgur.com/MQK3tGV", "score": 1},{"body": "To be fair, the Official Egg never says the find is a good thing.\n\n&gt; It seems like you have discovered a very rare type of egg!   \n[One that can give you instant salmonella poisoning]\n&gt; \n&gt; \n&gt; \n&gt; I would be very mad if I was trying to make scrambled eggs though.    \n&gt;[Because they would have to go to the trouble of getting a new egg out of the fridge]\n\n", "score": 1},{"body": "This all stems from the true OG(Original Game) 6 degrees of Kevin Bacon. In which you link one actor to Kevin Bacon using other actors that either or both have worked with. So let's do Ben Affleck:\n\n\nBen Affleck was in Good Will Hunting (1997) with Matt Damon \n\nMatt Damon was in Ocean's Eleven (2001) with Julia Roberts\n\n Julia Roberts was in Flatliners (1990) with Kevin Bacon\n\n Ben Affleck's Bacon number is 3", "score": 1},{"body": "I would be pissed because I like them scrambled. ", "score": 1},{"body": "Yolk's on you. :)", "score": 1},{"body": "I wouldn't let that in if I were you.", "score": 1},{"body": "Rule 34.  No exceptions.", "score": 1},{"body": "I like you Egg man. Want some vodka with your eggs? I love vodka at midnight with my scrambled eggs. ", "score": 1},{"body": "I would have totally hard boiled this.", "score": 1},{"body": "Looks like that chicken got a first trimester abortion", "score": 1},{"body": "Former*", "score": 1},{"body": "n(igga) - p(lease) = 0", "score": 1},{"body": "Don't eat it! You'll get salmonella!", "score": 1},{"body": "Right now somebody has an optical drive that doesn't have instructions and didn't come with screws.", "score": 1},{"body": "...until you went all Sylar on it.", "score": 1},{"body": "And those conditions were what I pointed out. Just saying \"cook your eggs\" is not enough to protect yourself. You must:\n\n* Cook the eggs completely to 160 degrees throughout.\n\n* Make sure the shell does not come in contact with any food that is not cooked to at least 160 degrees throughout.\n\n* Wash hands thoroughly after handling the egg or its shell and before handling any other food that is not cooked to at least 160 degrees throughout.\n\nNobody follows those steps correctly unless they're in a tightly controlled environment. And I don't just mean a restaurant kitchen. Cooking eggs to 160 degrees throughout makes them tough and rubbery. Thoroughly washing your hands takes at least 5 minutes to do correctly. And not even restaurant professionals take the temperature of more than two or three sections of something they cook at most to verify it's cooked. Miss a pocket, you could miss a bacterial colony.\n\nDoes this matter for most of the population? No. You've got about a 1:15,000 to 1:20,000 chance to have an egg that contains *any* salmonella. The people it does matter to, though, are young children, pregnant women, the elderly, and those with compromised immune systems.\n\nI personally take my eggs sunny-side up, over easy, or poached (in other words, the yolk is lucky if it hits 130 degrees). I also prepare many desserts which contain undercooked batters containing raw eggs as well as several punches and drinks that contain raw egg.", "score": 1},{"body": "Yes it does", "score": 1},{"body": "I found a pepsi yellow where I live. Funny because it just had a normal label on it. Didn't taste very good.", "score": 1},{"body": "That's one cold pussy.", "score": 1},{"body": "Why do we need to increase our awareness of it? Advertising isn't a new concept. It's been everywhere for quite a while now.", "score": 1},{"body": "They were more bland than anything. ", "score": 1},{"body": "Came here for a scientific explanation of this.  Got puns instead.", "score": 1},{"body": "How eggs-citing!!", "score": 1},{"body": "Now on the poundsaver menu?", "score": 1},{"body": "\"How you like your eggs, fried or fertilized\"", "score": 1},{"body": "gg", "score": 1},{"body": "I didn't even know it was safe to consume squid ink. I guess it's good that it's bland though", "score": 1},{"body": "Salmonella poisoning's no yolk.", "score": 1},{"body": "The yolk's on you...sorry.", "score": 1},{"body": "Does it really need to smash on the other side of the house? Seems like just smashing the egg would do the trick. Not to mention that you wouldn't know that you had one of these until it was already broken.", "score": 1},{"body": "My God if I could afford gold you'd get it.", "score": 1},{"body": "Yeah.", "score": 1},{"body": "Haha, hopefully not- I'm thinking maybe it just fell into my box during the shipping process, but it was basically a bulk package of instructions and screws- I can't see one order coming with 10 copies of the same instruction booklet and 3 bags of 40 screws each.", "score": 1},{"body": "Then all of your Cocks will be cursed!!", "score": 1},{"body": "Where is the heart?", "score": 1},{"body": "Shit yeah. I walked right into that. ", "score": 1},{"body": "Chernobil?", "score": 1},{"body": "Thanks Obama", "score": 1},{"body": "You're fucking welcome!", "score": 1},{"body": "... and thanks to ol' Joe\"", "score": 1},{"body": "You've got to be yolk'n me!", "score": 1},{"body": "**I THOUGHT YOUR FINGER AND THE EGG SHELLS WERE A DICK AND BALLS OH MY GOD**", "score": 1},{"body": "Chegg Marketing.", "score": 1},{"body": "You're welcome!", "score": 1},{"body": "thanks obama", "score": 1},{"body": "Obama Obama Obama.... What about me! I want some thanks too", "score": 1},{"body": "too complicated, i'd fuck it up.", "score": 1},{"body": "From the thumbnail I thought u were flipping off the egg in the pan.  Coulda been hilarious", "score": 1},{"body": "A drink? A drink? That is a double espresso mochiatto latte with extra syrup, worthy of an Instagram post...sheesh. A drink.", "score": 1},{"body": "New from mcdonalds ", "score": 1},{"body": "Jesus.. They had the chance to call it *Booty Dew* and didn't? Someone dropped the ball on this one.", "score": 1},{"body": "It is for reasons like that, that I believe the Universe started to exist. Some factor, somewhere, somehow, started to follow the simple rule that nP2 is true, and then all the other rules and implications of math came to follow. ", "score": 1},{"body": "But its not open about it to be true, it trys to look good for doing stuff that is mandatory in the absolute majority of industrialised nations", "score": 1},{"body": "It will just make your floor all wet", "score": 1},{"body": "Those hands look like the hands of defeat and disappointment. ", "score": 1},{"body": "Well, that one's a dud.", "score": 1},{"body": "Well I guess the yolk's *put's on sunglasses* on you. ", "score": 1},{"body": "DANKEEEEE", "score": 1},{"body": "The yolk isn't on you then.", "score": 1},{"body": "Lol cock eggs", "score": 1},{"body": "/r/ExplainLikeImCalvin ?", "score": 1},{"body": "If that's really Genghis Kahn, that isn't mildly interesting, that's just plain awesome.", "score": 1},{"body": "I guess the chicken crossed the road for the free wifi at mcdonalds.", "score": 1},{"body": "Abort! Abort!", "score": 1},{"body": "This thread really is eggsellent", "score": 1},{"body": "6 by my count.", "score": 1},{"body": "Looks like jesus! sell it for millions!", "score": 1},{"body": "Thankd for the sentiment, but don't give money to billionaires. ", "score": 1},{"body": "I think one other big issue for people like you is that bonded dsl should be an option as there is always two phone lines ran to each house.\n\nBut phone companies won't do it, even for twice the monthly fee.  Despite it being trivial, the equipment all supports it.", "score": 1},{"body": "Perplexed citizen uncovers notorious screw-smuggling ring, more at 11.", "score": 1},{"body": "Did you eat it?", "score": 1},{"body": "Ok, how did you do it?  Fired a blank at paint on canvas or some other  way?  ", "score": 1},{"body": "HENopause.", "score": 1},{"body": "you want to write that the doge tipbot. ;)", "score": 1},{"body": "There's definitely an abortion joke to be found in this.", "score": 1},{"body": "The technical name is sprue...", "score": 1},{"body": "You can literally see the yolk in their hand under the shell. ", "score": 1},{"body": "Great hand acting OP! Your hand totally looks like it's screaming WTF!\n\nYou could be the next Adams Family \"Thing\" (was played by magician Christopher Hart)", "score": 1},{"body": "I have no idea what any of this means.", "score": 1},{"body": "I've been finding nothing but double yolk in a carton of omega-3 eggs. i'm confused.. but grateful. ", "score": 1},{"body": "Cool, but don't chew on it; mmm... hydrogen peroxide flavour.", "score": 1},{"body": "Who needs to manually submit a comment when the front page can do it for you!", "score": 1},{"body": "In the UK at least there are helicopters with infra-red cameras to detect that kind of thing.  I guess they needed better loft insulation.", "score": 1},{"body": "that is a beautiful website ", "score": 1},{"body": "Probably had an abortion. That slut. ", "score": 1},{"body": "[The Yolk's on You.](http://www.dailymotion.com/video/xvnaee_the-yolk-s-on-you_shortfilms)", "score": 1},{"body": "Hopefully no one cracks the pun train", "score": 1},{"body": "I rather avoid seeing the salary breakdown on the check. Pay them, but don't tell me, it's your job not mine.", "score": 1},{"body": "I once had a suprise when I cracked an egg into a pan. It was a partially formed baby chicken. I lost my appetite for eggs for about a week.", "score": 1},{"body": "A lot of conservative business have talked about doing this as a means of protesting the Affordable Care Act. Most notably done by Papa Johns.  Although they don't actually show the amount on the receipt.\n\nhttp://www.forbes.com/sites/calebmelby/2012/11/12/breaking-down-centi-millionaire-papa-john-schnatters-obamacare-math/", "score": 1},{"body": "A planet made out of Bacon", "score": 1},{"body": "He wasn't yolking...I will see myself out.", "score": 1},{"body": "It's an indication of the nutritional value of what the hens eat. The color is due to carotenoids, like beta carotene. I've noticed that when I buy pastured eggs they have a darker, more orange colored yolk. That's because the chickens are allowed to run around outside eating bugs like they're supposed to.", "score": 1}]